{"title": "ABB FIA Formula E World Championship", "content": "Join Formula E It's quick, easy and free to sign up You'll get access to:                                     News. Analysis. Exclusive Features                                                                     Priority Booking. Early Bird Pricing                                                                     Competitions. Discounts. Experiences                                                                     Predict. Vote. Win.                                 Stay up-to-date with alerts so you don't miss a moment of the action Sign up today to get the latest news and exclusive content from on-and-off the track Formula E aspires to accelerate change towards an electric future, one race and one city at a time. Using the spectacle of world class sport, we are sending a powerful and meaningful message to help alter perceptions and speed-up the switch to electric mobility.   Hi, we noticed you’re not in United Kingdom. Would you like to switch to our global store? Hi, we noticed you’re not in United Kingdom. Would you like to switch to our global store? Hi, we noticed you’re not in United Kingdom. Would you like to switch to our global store? ALL THE OFFICIAL FORMULA E MERCHANDISE FREE UK SHIPPING WHEN YOU SPEND £70 Formula E Team collection available nowSHOP NOW Formula E Team collection available nowSHOP NOW Introducing the brand new official Formula E Season 9 collection SHOP NOW Introducing the brand new official Formula E Season 9 collection SHOP NOW Camo Cap£27.00 Wordmark Trucker Cap£27.00 Change Accelerated Hoodie£76.50 Packable Backpack£27.00 Tonal Hoodie£72.00 Gradient Water Bottle£20.00 Title PartnerGlobal PartnerTechnical PartnerPrincipal Partner  Unbeatable tech, global city circuits, top teams and drivers, unpredictable competition, world's greenest sport. Get into the action. Inspired by a fighter jet, every aspect of the Gen3 has been rethought, redesigned and rebuilt to become the most advanced electric car on the track. Setting the benchmark for high-performance, efficient and, sustainable racing without compromise. Meet the most competitive grid in motorsport, where any driver has the chance of climbing to the top step of the podium. It's a grid made up of world class drivers with skills from all over the motorsport spectrum, driving some of the most legendary names in racing. We're talking McLaren, Jaguar and Porsche among others all vying for the big prize: world championship glory. Formula E is more than a just a racing series - it's a battle for the future. Our radical cars - all powered by electricity - pave the way for the road cars of tomorrow, with the series acting as a competitive platform to test and develop the latest in electric technology. Join Formula E It's quick, easy and free to sign up You'll get access to:                                     News. Analysis. Exclusive Features                                                                     Priority Booking. Early Bird Pricing                                                                     Competitions. Discounts. Experiences                                                                     Predict. Vote. Win.                                 Stay up-to-date with alerts so you don't miss a moment of the action Sign up today to get the latest news and exclusive content from on-and-off the track Formula E aspires to accelerate change towards an electric future, one race and one city at a time. Using the spectacle of world class sport, we are sending a powerful and meaningful message to help alter perceptions and speed-up the switch to electric mobility. Treten Sie der Formel E bei Die Anmeldung ist schnell, einfach und kostenlos Sie erhalten Zugriff auf:                                     Nachricht. Analyse. Exklusive Funktionen                                                                     Prioritätsbuchung. Frühbucherpreise                                                                     Wettbewerbe. Rabatte. Erfahrungen                                                                     Vorhersagen. Abstimmung. Gewinnen                                 Beiben Sie mit den Benachrichtigung immer auf dem Laufenden und verpassen Sie keinen Moment der Renn-Action! Melden Sie sich noch heute an, um die neuesten Nachrichten und exklusiven Inhalte auf und neben der Strecke zu erhalten Die Formel E strebt danach, den Wandel hin zu einer elektrischen Zukunft zu beschleunigen, ein Rennen und eine Stadt nach der anderen. Mit dem Spektakel des Weltklassesports senden wir eine starke und aussagekräftige Botschaft, um dazu beizutragen, die Wahrnehmung zu verändern und die Umstellung auf Elektromobilität zu beschleunigen. Rejoignez la Formula E C'est simple, rapide et gratuit pour s'inscrire Vous aurez accès à :                                     Nouvelles. Analyse. Caractéristiques exclusives                                                                     Réservation prioritaire. Tarification lève-tôt                                                                     Compétitions. Réductions. Expériences                                                                     Prédire. Vote. Gagner                                 Mettez des alertes pour ne rien manquer de l'action Inscrivez-vous aujourd'hui pour recevoir les dernières nouvelles et du contenu exclusif sur et hors piste La Formule E aspire à accélérer le changement vers un avenir électrique, une course et une ville à la fois. En profitant du spectacle d'un sport de classe mondiale, nous envoyons un message puissant et significatif pour aider à modifier les perceptions et à accélérer le passage à la mobilité électrique. Unisciti alla Formula E Iscriversi è facile, veloce e gratuito Avrai accesso a:                                     Notizia. Analisi. Caratteristiche esclusive                                                                     Prenotazione prioritaria. Prezzi anticipati                                                                     Concorsi. Sconti. Esperienze                                                                     Prevedi. Votazione. Vincita                                 Rimani aggiornato con le notifiche per non perderti i momenti migliori Iscriviti oggi per ricevere le ultime notizie e i contenuti esclusivi dentro e fuori pista La Formula E aspira ad accelerare il cambiamento verso un futuro elettrico, una gara e una città alla volta. Sfruttando lo spettacolo di uno sport di livello mondiale, stiamo inviando un messaggio potente e significativo per aiutare a modificare le percezioni e accelerare il passaggio alla mobilità elettrica. Únete a la Fórmula E Registrarse es rápido, fácil y gratuito Obtendrá acceso a:                                     Noticias. Análisis. Características exclusivas                                                                     Reserva prioritaria. Precios de reserva anticipada                                                                     Competiciones. Descuentos. Experiencias                                                                     Predecir. Votar. Ganar                                 Recibiendo alertas no se perderán ni un momento de la acción Regístrese hoy para obtener las últimas noticias y contenido exclusivo dentro y fuera de la pista La Fórmula E aspira a acelerar el cambio hacia un futuro eléctrico, una carrera y una ciudad a la vez. Usando el espectáculo del deporte de clase mundial, estamos enviando un mensaje poderoso y significativo para ayudar a alterar las percepciones y a mejorar el cambio a la movilidad eléctrica. Junte-se à Fórmula E É rápido, fácil e grátis para se inscrever Você terá acesso a:                                     Notícias. Análise. Recursos exclusivos                                                                     Reserva Prioritária. Preços antecipados                                                                     Competições. Descontos. Experiências                                                                     Prever. Voto. Ganhar                                 Fica ligado às notificações para não perderes nenhum momento da corrida Inscreva-se hoje para receber as últimas notícias e conteúdo exclusivo dentro e fora da pista A Fórmula E aspira acelerar a mudança em direção a um futuro elétrico, uma corrida e uma cidade por vez. Usando o espetáculo do esporte de classe mundial, estamos enviando uma mensagem poderosa e significativa para ajudar a alterar as percepções e acelerar a mudança para a mobilidade elétrica.", "url": "https://www.fiaformulae.com/pt-br"}