{"title": "What is Formula E", "content": "Join Formula E It's quick, easy and free to sign up You'll get access to:                                     News. Analysis. Exclusive Features                                                                     Priority Booking. Early Bird Pricing                                                                     Competitions. Discounts. Experiences                                                                     Predict. Vote. Win.                                 Stay up-to-date with alerts so you don't miss a moment of the action Sign up today to get the latest news and exclusive content from on-and-off the track Formula E aspires to accelerate change towards an electric future, one race and one city at a time. Using the spectacle of world class sport, we are sending a powerful and meaningful message to help alter perceptions and speed-up the switch to electric mobility.   Hi, we noticed you’re not in United Kingdom. Would you like to switch to our global store? Hi, we noticed you’re not in United Kingdom. Would you like to switch to our global store? Hi, we noticed you’re not in United Kingdom. Would you like to switch to our global store? ALL THE OFFICIAL FORMULA E MERCHANDISE FREE UK SHIPPING WHEN YOU SPEND £70 Formula E Team collection available nowSHOP NOW Formula E Team collection available nowSHOP NOW Introducing the brand new official Formula E Season 9 collection SHOP NOW Introducing the brand new official Formula E Season 9 collection SHOP NOW Camo Cap£27.00 Wordmark Trucker Cap£27.00 Change Accelerated Hoodie£76.50 Packable Backpack£27.00 Tonal Hoodie£72.00 Gradient Water Bottle£20.00 Title PartnerGlobal PartnerTechnical PartnerPrincipal Partner  Unbeatable tech, global city circuits, top teams and drivers, unpredictable competition, world's greenest sport. Get into the action. Inspired by a fighter jet, every aspect of the Gen3 has been rethought, redesigned and rebuilt to become the most advanced electric car on the track. Setting the benchmark for high-performance, efficient and, sustainable racing without compromise. Meet the most competitive grid in motorsport, where any driver has the chance of climbing to the top step of the podium. It's a grid made up of world class drivers with skills from all over the motorsport spectrum, driving some of the most legendary names in racing. We're talking McLaren, Jaguar and Porsche among others all vying for the big prize: world championship glory. Formula E is more than a just a racing series - it's a battle for the future. Our radical cars - all powered by electricity - pave the way for the road cars of tomorrow, with the series acting as a competitive platform to test and develop the latest in electric technology.", "url": "https://www.fiaformulae.com/en/what-is-formula-e"}