{"title": "Planetary Analogs | Planets – NASA Solar System Exploration", "content": "Dana Bolles manages the day-to-day operations of the science.nasa.gov website. Let NASA be your guide to the night sky. Dr. Nicola Fox is the new associate administrator for the agency’s Science Mission Directorate. U.S. Poet Laureate Ada Limón, known for work that explores the human connection to the natural world, is crafting a new poem dedicated to the Europa Clipper mission. Dr. Lori Glaze is NASA's director of planetary science. \"I remember looking at that picture and thinking that there is something weird going on here and that it has important implications for the whole history of the planet, its climate, its atmosphere, its geology.\" - David Grinspoon, scientist Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 Dana Bolles manages the day-to-day operations of the science.nasa.gov website. Let NASA be your guide to the night sky. Dr. Nicola Fox is the new associate administrator for the agency’s Science Mission Directorate. U.S. Poet Laureate Ada Limón, known for work that explores the human connection to the natural world, is crafting a new poem dedicated to the Europa Clipper mission. Dr. Lori Glaze is NASA's director of planetary science. \"I remember looking at that picture and thinking that there is something weird going on here and that it has important implications for the whole history of the planet, its climate, its atmosphere, its geology.\" - David Grinspoon, scientist Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 Dana Bolles manages the day-to-day operations of the science.nasa.gov website. Let NASA be your guide to the night sky. Dr. Nicola Fox is the new associate administrator for the agency’s Science Mission Directorate. U.S. Poet Laureate Ada Limón, known for work that explores the human connection to the natural world, is crafting a new poem dedicated to the Europa Clipper mission. Dr. Lori Glaze is NASA's director of planetary science. \"I remember looking at that picture and thinking that there is something weird going on here and that it has important implications for the whole history of the planet, its climate, its atmosphere, its geology.\" - David Grinspoon, scientist Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 There are more planets than stars in our galaxy. The current count orbiting our star: eight. The inner, rocky planets are Mercury, Venus, Earth, and Mars. NASA's newest rover — Perseverance — landed on Mars on Feb. 18, 2021. The outer planets are gas giants Jupiter and Saturn and ice giants Uranus and Neptune. Beyond Neptune, a newer class of smaller worlds called dwarf planets reign, including longtime favorite Pluto. Thousands more planets have been discovered beyond our solar system. Scientists call them exoplanets (exo means \"from outside\"). Everything you need to know about planets. What is a Planet?   The key difference between a planet and a dwarf planet is the kinds of objects that share its orbit around the Sun. Pluto, for example, has not cleared its orbit of similar objects while Earth or Jupiter have no similarly-sized worlds on the same path around the Sun. Like planets, dwarf planets are generally round (Haumea looks like an overinflated football) and orbit the Sun. There are likely thousands of dwarf planets waiting to be discovered beyond Neptune. The five best-known dwarf planets are Ceres, Pluto, Makemake, Haumea, and Eris. Except for Ceres, which lies in the main asteroid belt, these small worlds are located in the Kuiper Belt. They’re considered dwarfs because they are massive, round, and orbit the Sun, but haven't cleared their orbital path.  This simulated view of our solar system at the top of this page (and below) runs on real data. The position of the planets, moons, and spacecraft are shown where they are right now. This digital orrery (a model of the solar system) runs on a light, mobile-mobile friendly version of NASA's Eyes on the Solar System software. This snapshot focuses on active NASA missions and select ESA missions. Showcasing the entire operating international fleet is too much of a data wallop at the moment (but we are working on it!). Active international missions such as Japan's Akatsuki Venus Orbiter and ESA and Japan's Mercury-bound BepiColombo are not yet available. Use the HD button to upload higher-resolution imagery of the planets. It may not work properly on older mobile devices. Have fun, and keep exploring. Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 There are more planets than stars in our galaxy. The current count orbiting our star: eight. The inner, rocky planets are Mercury, Venus, Earth, and Mars. NASA's newest rover — Perseverance — landed on Mars on Feb. 18, 2021. The outer planets are gas giants Jupiter and Saturn and ice giants Uranus and Neptune. Beyond Neptune, a newer class of smaller worlds called dwarf planets reign, including longtime favorite Pluto. Thousands more planets have been discovered beyond our solar system. Scientists call them exoplanets (exo means \"from outside\"). Everything you need to know about planets. What is a Planet?   The key difference between a planet and a dwarf planet is the kinds of objects that share its orbit around the Sun. Pluto, for example, has not cleared its orbit of similar objects while Earth or Jupiter have no similarly-sized worlds on the same path around the Sun. Like planets, dwarf planets are generally round (Haumea looks like an overinflated football) and orbit the Sun. There are likely thousands of dwarf planets waiting to be discovered beyond Neptune. The five best-known dwarf planets are Ceres, Pluto, Makemake, Haumea, and Eris. Except for Ceres, which lies in the main asteroid belt, these small worlds are located in the Kuiper Belt. They’re considered dwarfs because they are massive, round, and orbit the Sun, but haven't cleared their orbital path.  This simulated view of our solar system at the top of this page (and below) runs on real data. The position of the planets, moons, and spacecraft are shown where they are right now. This digital orrery (a model of the solar system) runs on a light, mobile-mobile friendly version of NASA's Eyes on the Solar System software. This snapshot focuses on active NASA missions and select ESA missions. Showcasing the entire operating international fleet is too much of a data wallop at the moment (but we are working on it!). Active international missions such as Japan's Akatsuki Venus Orbiter and ESA and Japan's Mercury-bound BepiColombo are not yet available. Use the HD button to upload higher-resolution imagery of the planets. It may not work properly on older mobile devices. Have fun, and keep exploring. Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 There are more planets than stars in our galaxy. The current count orbiting our star: eight. The inner, rocky planets are Mercury, Venus, Earth, and Mars. NASA's newest rover — Perseverance — landed on Mars on Feb. 18, 2021. The outer planets are gas giants Jupiter and Saturn and ice giants Uranus and Neptune. Beyond Neptune, a newer class of smaller worlds called dwarf planets reign, including longtime favorite Pluto. Thousands more planets have been discovered beyond our solar system. Scientists call them exoplanets (exo means \"from outside\"). Everything you need to know about planets. What is a Planet?   The key difference between a planet and a dwarf planet is the kinds of objects that share its orbit around the Sun. Pluto, for example, has not cleared its orbit of similar objects while Earth or Jupiter have no similarly-sized worlds on the same path around the Sun. Like planets, dwarf planets are generally round (Haumea looks like an overinflated football) and orbit the Sun. There are likely thousands of dwarf planets waiting to be discovered beyond Neptune. The five best-known dwarf planets are Ceres, Pluto, Makemake, Haumea, and Eris. Except for Ceres, which lies in the main asteroid belt, these small worlds are located in the Kuiper Belt. They’re considered dwarfs because they are massive, round, and orbit the Sun, but haven't cleared their orbital path.  This simulated view of our solar system at the top of this page (and below) runs on real data. The position of the planets, moons, and spacecraft are shown where they are right now. This digital orrery (a model of the solar system) runs on a light, mobile-mobile friendly version of NASA's Eyes on the Solar System software. This snapshot focuses on active NASA missions and select ESA missions. Showcasing the entire operating international fleet is too much of a data wallop at the moment (but we are working on it!). Active international missions such as Japan's Akatsuki Venus Orbiter and ESA and Japan's Mercury-bound BepiColombo are not yet available. Use the HD button to upload higher-resolution imagery of the planets. It may not work properly on older mobile devices. Have fun, and keep exploring. Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 There are more planets than stars in our galaxy. The current count orbiting our star: eight. The inner, rocky planets are Mercury, Venus, Earth, and Mars. NASA's newest rover — Perseverance — landed on Mars on Feb. 18, 2021. The outer planets are gas giants Jupiter and Saturn and ice giants Uranus and Neptune. Beyond Neptune, a newer class of smaller worlds called dwarf planets reign, including longtime favorite Pluto. Thousands more planets have been discovered beyond our solar system. Scientists call them exoplanets (exo means \"from outside\"). Everything you need to know about planets. What is a Planet?   The key difference between a planet and a dwarf planet is the kinds of objects that share its orbit around the Sun. Pluto, for example, has not cleared its orbit of similar objects while Earth or Jupiter have no similarly-sized worlds on the same path around the Sun. Like planets, dwarf planets are generally round (Haumea looks like an overinflated football) and orbit the Sun. There are likely thousands of dwarf planets waiting to be discovered beyond Neptune. The five best-known dwarf planets are Ceres, Pluto, Makemake, Haumea, and Eris. Except for Ceres, which lies in the main asteroid belt, these small worlds are located in the Kuiper Belt. They’re considered dwarfs because they are massive, round, and orbit the Sun, but haven't cleared their orbital path.  This simulated view of our solar system at the top of this page (and below) runs on real data. The position of the planets, moons, and spacecraft are shown where they are right now. This digital orrery (a model of the solar system) runs on a light, mobile-mobile friendly version of NASA's Eyes on the Solar System software. This snapshot focuses on active NASA missions and select ESA missions. Showcasing the entire operating international fleet is too much of a data wallop at the moment (but we are working on it!). Active international missions such as Japan's Akatsuki Venus Orbiter and ESA and Japan's Mercury-bound BepiColombo are not yet available. Use the HD button to upload higher-resolution imagery of the planets. It may not work properly on older mobile devices. Have fun, and keep exploring. Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023  This seemingly simple question doesn't have a simple answer. Everyone knows that Earth, Mars and Jupiter are planets. But both Pluto and Ceres were once considered planets until new discoveries triggered scientific debate about how to best describe them—a vigorous debate that continues to this day. The most recent definition of a planet was adopted by the International Astronomical Union in 2006. It says a planet must do three things: Discussion—and debate—will continue as our view of the cosmos continues to expand.   Science is a dynamic process of questioning, hypothesizing, discovering, and changing previous ideas based on what is learned. Scientific ideas are developed through reasoning and tested against observations. Scientists assess and question each other's work in a critical process called peer review. Our understanding about the universe and our place in it has changed over time. New information can cause us to rethink what we know and reevaluate how we classify objects in order to better understand them. New ideas and perspectives can come from questioning a theory or seeing where a classification breaks down.  Defining the term planet is important, because such definitions reflect our understanding of the origins, architecture, and evolution of our solar system. Over historical time, objects categorized as planets have changed. The ancient Greeks counted the Earth's Moon and Sun as planets along with Mercury, Venus, Mars, Jupiter, and Saturn. Earth was not considered a planet, but rather was thought to be the central object around which all the other celestial objects orbited. The first known model that placed the Sun at the center of the known universe with the Earth revolving around it was presented by Aristarchus of Samos in the third century BCE, but it was not generally accepted. It wasn't until the 16th century that the idea was revived by Nicolaus Copernicus. By the 17th century, astronomers (aided by the invention of the telescope) realized that the Sun was the celestial object around which all the planets—including Earth—orbit, and that the moon is not a planet, but a satellite (moon) of Earth. Uranus was added as a planet in 1781 and Neptune was discovered in 1846. Ceres was discovered between Mars and Jupiter in 1801 and originally classified as a planet. But as many more objects were subsequently found in the same region, it was realized that Ceres was the first of a class of similar objects that were eventually termed asteroids (star-like) or minor planets. Pluto, discovered in 1930, was identified as the ninth planet. But Pluto is much smaller than Mercury and is even smaller than some of the planetary moons. It is unlike the terrestrial planets (Mercury, Venus, Earth, Mars), or the gas giants (Jupiter, Saturn), or the ice giants (Uranus, Neptune). Charon, its huge satellite, is nearly half the size of Pluto and shares Pluto's orbit. Though Pluto kept its planetary status through the 1980s, things began to change in the 1990s with some new discoveries. Technical advances in telescopes led to better observations and improved detection of very small, very distant objects. In the early 1990s, astronomers began finding numerous icy worlds orbiting the Sun in a doughnut-shaped region called the Kuiper Belt beyond the orbit of Neptune—out in Pluto's realm. With the discovery of the Kuiper Belt and its thousands of icy bodies (known as Kuiper Belt Objects, or KBOs; also called transneptunians), it was proposed that it is more useful to think of Pluto as the biggest KBO instead of a planet.   Then, in 2005, a team of astronomers announced that they had found a tenth planet—it was a KBO similar in size to Pluto. People began to wonder what planethood really means. Just what is a planet, anyway? Suddenly the answer to that question didn't seem so self-evident, and, as it turns out, there are plenty of disagreements about it. The International Astronomical Union (IAU), a worldwide organization of astronomers, took on the challenge of classifying the newly found KBO (later named Eris). In 2006, the IAU passed a resolution that defined planet and established a new category, dwarf planet. Eris, Ceres, Pluto, and two more recently discovered KBOs named Haumea and Makemake, are the dwarf planets recognized by the IAU. There may be another 100 dwarf planets in the solar system and hundreds more in and just outside the Kuiper Belt.  Here is the text of the IAU’s Resolution B5: Definition of a Planet in the Solar System: Contemporary observations are changing our understanding of planetary systems, and it is important that our nomenclature for objects reflect our current understanding. This applies, in particular, to the designation \"planets\". The word \"planet\" originally described \"wanderers\" that were known only as moving lights in the sky. Recent discoveries lead us to create a new definition, which we can make using currently available scientific information.  The IAU therefore resolves that planets and other bodies, except satellites, in our Solar System be defined into three distinct categories in the following way: Debate—and Discoveries—Continue Astronomers and planetary scientists did not unanimously agree with these definitions. To some it appeared that the classification scheme was designed to limit the number of planets; to others it was incomplete and the terms unclear. Some astronomers argued that location (context) is important, especially in understanding the formation and evolution of the solar system. One idea is to simply define a planet as a natural object in space that is massive enough for gravity to make it approximately spherical. But some scientists objected that this simple definition does not take into account what degree of measurable roundness is needed for an object to be considered round. In fact, it is often difficult to accurately determine the shapes of some distant objects. Others argue that where an object is located or what it is made of do matter and there should not be a concern with dynamics; that is, whether or not an object sweeps up or scatters away its immediate neighbors, or holds them in stable orbits. The lively planethood debate continues. As our knowledge deepens and expands, the more complex and intriguing the universe appears. Researchers have found hundreds of extrasolar planets, or exoplanets, that reside outside our solar system; there may be billions of exoplanets in the Milky Way Galaxy alone, and some may be habitable (have conditions favorable to life). Whether our definitions of planet can be applied to these newly found objects remains to be seen. Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 The quest to understand our solar system begins close to home. Earthquake science paves the way for the study of quakes on icy ocean worlds like Jupiter’s moon Europa. South America’s driest deserts serve as testing grounds for the robots that search for life on Mars. Volcanoes around the world help researchers interpret evidence of volcanic activity on the Moon and beyond.  Similar environments on different worlds are called planetary analogs. Comparing planetary analogs is a powerful way to make sense of our solar system. NASA teams explore three main kinds of planetary analogs. Geologic Analogs​ Astrobiology Analogs Mission Analogs  Rocks record history. They tell the stories of past volcanic eruptions, giant earthquakes, erosion processes, and meteoric impacts – if we know how to look. To make sense of what we see, we study geology from many different perspectives. Remote sensing shows us the big picture. Large features like canyons and continents are easy to see from far away. Spacecraft, aircraft, drones, and telescopes are all useful remote sensing tools. Sometimes, it helps to take a closer look. Information collected on site, in the field, is called ground truth data. Apollo astronauts have collected ground truth data on the Moon. Robotic landers and rovers can make ground truth observations, too. Ground truth science on Earth provides valuable information about our home planet. It also helps us to check our understanding of satellite imagery. When long-distance observations of Earth match with data gathered on the ground, we can be confident about using remote sensing on other worlds, too. The Moon, Mars, Mercury, and Venus all have volcanoes. Jupiter’s moon Io is so volcanically active that, at any given time, several volcanoes are erupting. Getting to know Earth’s volcanoes helps us understand how and when volcanoes erupt on other planets and moons. Different kinds of eruptions create a variety of volcanoes. Explosive eruptions make ash. More gentle eruptions generate lava flows. Some lava flows also form caves, called lava tubes. Explorers are curious about lava tubes because they can harbor interesting resources, like water and sulfur. Future visitors to the Moon might use lava tubes for shelter from the hazards of outer space.  Researchers visit lava tubes on Earth to test new ways to identify them from the surface. They use special science instruments to \"see through\" the rock and detect caves below. One day, astronauts could use tools like these to study lava flows on the Moon and Mars.  The movement of materials like dust, sand, and rocks around the surface of a planet is called erosion. Wind, storms, landslides, glaciers, and flowing water all cause this kind of movement. To find out what kind of erosion has happened, scientists study the patterns left behind. On Mars, for example, ancient shorelines and dry riverbeds hint at a watery past.  Many patterns are common throughout our solar system – like sand dunes, found on Earth, Mars, Venus, and Saturn’s moon Titan. Impacts batter planetary surfaces throughout our solar system. Often, when an object traveling through space crashes into a planet or moon, it forms a crater. In very large impacts, surface material can be excavated, or thrown from the impact site. This leaves a window for scientists to see what lies beneath. Earth has relatively few impact craters. Many objects collide with the Moon or burn up in the atmosphere before hitting the ground. When impactors do reach Earth’s surface, our active planet slowly erases the evidence. Erosion, tectonic movement, and volcanic activity make ancient craters difficult to see.  Despite these factors, a few impact sites remain visible and accessible on Earth's surface. These examples help geologists interpret craters on the Moon, Mars, and beyond. Terrestrial planets begin as molten bodies and cool over time. As a planet loses heat, its surface changes shape. Hot material continues to move around in the planet’s interior, causing surface deformation. This is called tectonism. Tectonic activity is all around us. Mountains, faults, folds, fractures, and earthquakes teach us about Earth's past and present. Lunar experiments set up by Apollo astronauts show that the Moon is not only quaking, but shrinking. Marsquakes reveal the Red Planet’s internal structure to NASA's InSight lander. Each world provides clues about how objects in our solar system formed, how they cooled, and what might be happening inside.  Astrobiologists explore the forms that biology might take on other worlds. Our planet’s most extreme habitats are full of surprising examples to study. Deep in Earth's oceans, for instance, microbes thrive in very salty, high-pressure environments. These tough and tiny creatures show us what life could be like in salt-watery alien terrain. The search for extraterrestrial life requires both evidence and imagination. It’s difficult to predict what an encounter with life beyond Earth will be like. There is no guarantee that it will resemble anything humans have ever experienced. Will we know it when we see it? Will we find biosignatures in rocks, in an atmosphere if there is one, in liquid form? Could a close-up image provide proof? Will we need to examine the area in other ways? Is it possible to study alien biology while keeping it, and our own world, safe from harm? Earth's strangest ecosystems prepare us to ask the right questions when searching for life in other places. To learn more about astrobiology analogs, visit: https://astrobiology.nasa.gov/research-locations/   Before Apollo astronauts collected samples on the Moon, they practiced here on Earth. Today, teams test their plans and equipment in environments ranging from volcanic fields to the ocean floor. Future crews, too, will train on Earth for the challenges of space travel. This kind of preparation is called mission analog research. Analog missions allow us to try out equipment and procedures in rough, remote places without ever leaving our planet. Some teams spend up to three weeks at a time living and working deep undersea. Others take to the desert to try out new rovers and geological tools. These trials reveal strengths and weaknesses so that we can improve our systems. They also teach us how to manage human challenges like prolonged isolation. To learn more about mission analogs, visit: https://www.nasa.gov/analogs  In the field, everyone works together to achieve mission goals. Astronauts may try new exploration tools while geologists search for hints about our planet's past. Engineers can test their rovers against rough terrain and time delays. At the same time, astrobiologists might scour the rocks nearby for evidence of past and present life. By working as a team, we advance our knowledge of Earth and beyond. Analog studies have already changed the way we understand our place in space, and there are many discoveries left to make. Future scientists, engineers, and astronauts will have exciting questions to answer. To succeed, they'll need to learn all they can from each other and our home planet. Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023", "url": "https://solarsystem.nasa.gov/planets/planetary-analogs"}