{"title": "Touchdown! NASA's Mars Perseverance Rover Safely Lands on Red Planet | NASA", "content": "Dana Bolles manages the day-to-day operations of the science.nasa.gov website. Let NASA be your guide to the night sky. Dr. Nicola Fox is the new associate administrator for the agency’s Science Mission Directorate. U.S. Poet Laureate Ada Limón, known for work that explores the human connection to the natural world, is crafting a new poem dedicated to the Europa Clipper mission. Dr. Lori Glaze is NASA's director of planetary science. \"I remember looking at that picture and thinking that there is something weird going on here and that it has important implications for the whole history of the planet, its climate, its atmosphere, its geology.\" - David Grinspoon, scientist Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 Dana Bolles manages the day-to-day operations of the science.nasa.gov website. Let NASA be your guide to the night sky. Dr. Nicola Fox is the new associate administrator for the agency’s Science Mission Directorate. U.S. Poet Laureate Ada Limón, known for work that explores the human connection to the natural world, is crafting a new poem dedicated to the Europa Clipper mission. Dr. Lori Glaze is NASA's director of planetary science. \"I remember looking at that picture and thinking that there is something weird going on here and that it has important implications for the whole history of the planet, its climate, its atmosphere, its geology.\" - David Grinspoon, scientist Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 Dana Bolles manages the day-to-day operations of the science.nasa.gov website. Let NASA be your guide to the night sky. Dr. Nicola Fox is the new associate administrator for the agency’s Science Mission Directorate. U.S. Poet Laureate Ada Limón, known for work that explores the human connection to the natural world, is crafting a new poem dedicated to the Europa Clipper mission. Dr. Lori Glaze is NASA's director of planetary science. \"I remember looking at that picture and thinking that there is something weird going on here and that it has important implications for the whole history of the planet, its climate, its atmosphere, its geology.\" - David Grinspoon, scientist Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 There are more planets than stars in our galaxy. The current count orbiting our star: eight. The inner, rocky planets are Mercury, Venus, Earth, and Mars. NASA's newest rover — Perseverance — landed on Mars on Feb. 18, 2021. The outer planets are gas giants Jupiter and Saturn and ice giants Uranus and Neptune. Beyond Neptune, a newer class of smaller worlds called dwarf planets reign, including longtime favorite Pluto. Thousands more planets have been discovered beyond our solar system. Scientists call them exoplanets (exo means \"from outside\"). Everything you need to know about planets. What is a Planet?   The key difference between a planet and a dwarf planet is the kinds of objects that share its orbit around the Sun. Pluto, for example, has not cleared its orbit of similar objects while Earth or Jupiter have no similarly-sized worlds on the same path around the Sun. Like planets, dwarf planets are generally round (Haumea looks like an overinflated football) and orbit the Sun. There are likely thousands of dwarf planets waiting to be discovered beyond Neptune. The five best-known dwarf planets are Ceres, Pluto, Makemake, Haumea, and Eris. Except for Ceres, which lies in the main asteroid belt, these small worlds are located in the Kuiper Belt. They’re considered dwarfs because they are massive, round, and orbit the Sun, but haven't cleared their orbital path.  This simulated view of our solar system at the top of this page (and below) runs on real data. The position of the planets, moons, and spacecraft are shown where they are right now. This digital orrery (a model of the solar system) runs on a light, mobile-mobile friendly version of NASA's Eyes on the Solar System software. This snapshot focuses on active NASA missions and select ESA missions. Showcasing the entire operating international fleet is too much of a data wallop at the moment (but we are working on it!). Active international missions such as Japan's Akatsuki Venus Orbiter and ESA and Japan's Mercury-bound BepiColombo are not yet available. Use the HD button to upload higher-resolution imagery of the planets. It may not work properly on older mobile devices. Have fun, and keep exploring. Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 There are more planets than stars in our galaxy. The current count orbiting our star: eight. The inner, rocky planets are Mercury, Venus, Earth, and Mars. NASA's newest rover — Perseverance — landed on Mars on Feb. 18, 2021. The outer planets are gas giants Jupiter and Saturn and ice giants Uranus and Neptune. Beyond Neptune, a newer class of smaller worlds called dwarf planets reign, including longtime favorite Pluto. Thousands more planets have been discovered beyond our solar system. Scientists call them exoplanets (exo means \"from outside\"). Everything you need to know about planets. What is a Planet?   The key difference between a planet and a dwarf planet is the kinds of objects that share its orbit around the Sun. Pluto, for example, has not cleared its orbit of similar objects while Earth or Jupiter have no similarly-sized worlds on the same path around the Sun. Like planets, dwarf planets are generally round (Haumea looks like an overinflated football) and orbit the Sun. There are likely thousands of dwarf planets waiting to be discovered beyond Neptune. The five best-known dwarf planets are Ceres, Pluto, Makemake, Haumea, and Eris. Except for Ceres, which lies in the main asteroid belt, these small worlds are located in the Kuiper Belt. They’re considered dwarfs because they are massive, round, and orbit the Sun, but haven't cleared their orbital path.  This simulated view of our solar system at the top of this page (and below) runs on real data. The position of the planets, moons, and spacecraft are shown where they are right now. This digital orrery (a model of the solar system) runs on a light, mobile-mobile friendly version of NASA's Eyes on the Solar System software. This snapshot focuses on active NASA missions and select ESA missions. Showcasing the entire operating international fleet is too much of a data wallop at the moment (but we are working on it!). Active international missions such as Japan's Akatsuki Venus Orbiter and ESA and Japan's Mercury-bound BepiColombo are not yet available. Use the HD button to upload higher-resolution imagery of the planets. It may not work properly on older mobile devices. Have fun, and keep exploring. Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 There are more planets than stars in our galaxy. The current count orbiting our star: eight. The inner, rocky planets are Mercury, Venus, Earth, and Mars. NASA's newest rover — Perseverance — landed on Mars on Feb. 18, 2021. The outer planets are gas giants Jupiter and Saturn and ice giants Uranus and Neptune. Beyond Neptune, a newer class of smaller worlds called dwarf planets reign, including longtime favorite Pluto. Thousands more planets have been discovered beyond our solar system. Scientists call them exoplanets (exo means \"from outside\"). Everything you need to know about planets. What is a Planet?   The key difference between a planet and a dwarf planet is the kinds of objects that share its orbit around the Sun. Pluto, for example, has not cleared its orbit of similar objects while Earth or Jupiter have no similarly-sized worlds on the same path around the Sun. Like planets, dwarf planets are generally round (Haumea looks like an overinflated football) and orbit the Sun. There are likely thousands of dwarf planets waiting to be discovered beyond Neptune. The five best-known dwarf planets are Ceres, Pluto, Makemake, Haumea, and Eris. Except for Ceres, which lies in the main asteroid belt, these small worlds are located in the Kuiper Belt. They’re considered dwarfs because they are massive, round, and orbit the Sun, but haven't cleared their orbital path.  This simulated view of our solar system at the top of this page (and below) runs on real data. The position of the planets, moons, and spacecraft are shown where they are right now. This digital orrery (a model of the solar system) runs on a light, mobile-mobile friendly version of NASA's Eyes on the Solar System software. This snapshot focuses on active NASA missions and select ESA missions. Showcasing the entire operating international fleet is too much of a data wallop at the moment (but we are working on it!). Active international missions such as Japan's Akatsuki Venus Orbiter and ESA and Japan's Mercury-bound BepiColombo are not yet available. Use the HD button to upload higher-resolution imagery of the planets. It may not work properly on older mobile devices. Have fun, and keep exploring. Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 There are more planets than stars in our galaxy. The current count orbiting our star: eight. The inner, rocky planets are Mercury, Venus, Earth, and Mars. NASA's newest rover — Perseverance — landed on Mars on Feb. 18, 2021. The outer planets are gas giants Jupiter and Saturn and ice giants Uranus and Neptune. Beyond Neptune, a newer class of smaller worlds called dwarf planets reign, including longtime favorite Pluto. Thousands more planets have been discovered beyond our solar system. Scientists call them exoplanets (exo means \"from outside\"). Everything you need to know about planets. What is a Planet?   The key difference between a planet and a dwarf planet is the kinds of objects that share its orbit around the Sun. Pluto, for example, has not cleared its orbit of similar objects while Earth or Jupiter have no similarly-sized worlds on the same path around the Sun. Like planets, dwarf planets are generally round (Haumea looks like an overinflated football) and orbit the Sun. There are likely thousands of dwarf planets waiting to be discovered beyond Neptune. The five best-known dwarf planets are Ceres, Pluto, Makemake, Haumea, and Eris. Except for Ceres, which lies in the main asteroid belt, these small worlds are located in the Kuiper Belt. They’re considered dwarfs because they are massive, round, and orbit the Sun, but haven't cleared their orbital path.  This simulated view of our solar system at the top of this page (and below) runs on real data. The position of the planets, moons, and spacecraft are shown where they are right now. This digital orrery (a model of the solar system) runs on a light, mobile-mobile friendly version of NASA's Eyes on the Solar System software. This snapshot focuses on active NASA missions and select ESA missions. Showcasing the entire operating international fleet is too much of a data wallop at the moment (but we are working on it!). Active international missions such as Japan's Akatsuki Venus Orbiter and ESA and Japan's Mercury-bound BepiColombo are not yet available. Use the HD button to upload higher-resolution imagery of the planets. It may not work properly on older mobile devices. Have fun, and keep exploring. Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023  This seemingly simple question doesn't have a simple answer. Everyone knows that Earth, Mars and Jupiter are planets. But both Pluto and Ceres were once considered planets until new discoveries triggered scientific debate about how to best describe them—a vigorous debate that continues to this day. The most recent definition of a planet was adopted by the International Astronomical Union in 2006. It says a planet must do three things: Discussion—and debate—will continue as our view of the cosmos continues to expand.   Science is a dynamic process of questioning, hypothesizing, discovering, and changing previous ideas based on what is learned. Scientific ideas are developed through reasoning and tested against observations. Scientists assess and question each other's work in a critical process called peer review. Our understanding about the universe and our place in it has changed over time. New information can cause us to rethink what we know and reevaluate how we classify objects in order to better understand them. New ideas and perspectives can come from questioning a theory or seeing where a classification breaks down.  Defining the term planet is important, because such definitions reflect our understanding of the origins, architecture, and evolution of our solar system. Over historical time, objects categorized as planets have changed. The ancient Greeks counted the Earth's Moon and Sun as planets along with Mercury, Venus, Mars, Jupiter, and Saturn. Earth was not considered a planet, but rather was thought to be the central object around which all the other celestial objects orbited. The first known model that placed the Sun at the center of the known universe with the Earth revolving around it was presented by Aristarchus of Samos in the third century BCE, but it was not generally accepted. It wasn't until the 16th century that the idea was revived by Nicolaus Copernicus. By the 17th century, astronomers (aided by the invention of the telescope) realized that the Sun was the celestial object around which all the planets—including Earth—orbit, and that the moon is not a planet, but a satellite (moon) of Earth. Uranus was added as a planet in 1781 and Neptune was discovered in 1846. Ceres was discovered between Mars and Jupiter in 1801 and originally classified as a planet. But as many more objects were subsequently found in the same region, it was realized that Ceres was the first of a class of similar objects that were eventually termed asteroids (star-like) or minor planets. Pluto, discovered in 1930, was identified as the ninth planet. But Pluto is much smaller than Mercury and is even smaller than some of the planetary moons. It is unlike the terrestrial planets (Mercury, Venus, Earth, Mars), or the gas giants (Jupiter, Saturn), or the ice giants (Uranus, Neptune). Charon, its huge satellite, is nearly half the size of Pluto and shares Pluto's orbit. Though Pluto kept its planetary status through the 1980s, things began to change in the 1990s with some new discoveries. Technical advances in telescopes led to better observations and improved detection of very small, very distant objects. In the early 1990s, astronomers began finding numerous icy worlds orbiting the Sun in a doughnut-shaped region called the Kuiper Belt beyond the orbit of Neptune—out in Pluto's realm. With the discovery of the Kuiper Belt and its thousands of icy bodies (known as Kuiper Belt Objects, or KBOs; also called transneptunians), it was proposed that it is more useful to think of Pluto as the biggest KBO instead of a planet.   Then, in 2005, a team of astronomers announced that they had found a tenth planet—it was a KBO similar in size to Pluto. People began to wonder what planethood really means. Just what is a planet, anyway? Suddenly the answer to that question didn't seem so self-evident, and, as it turns out, there are plenty of disagreements about it. The International Astronomical Union (IAU), a worldwide organization of astronomers, took on the challenge of classifying the newly found KBO (later named Eris). In 2006, the IAU passed a resolution that defined planet and established a new category, dwarf planet. Eris, Ceres, Pluto, and two more recently discovered KBOs named Haumea and Makemake, are the dwarf planets recognized by the IAU. There may be another 100 dwarf planets in the solar system and hundreds more in and just outside the Kuiper Belt.  Here is the text of the IAU’s Resolution B5: Definition of a Planet in the Solar System: Contemporary observations are changing our understanding of planetary systems, and it is important that our nomenclature for objects reflect our current understanding. This applies, in particular, to the designation \"planets\". The word \"planet\" originally described \"wanderers\" that were known only as moving lights in the sky. Recent discoveries lead us to create a new definition, which we can make using currently available scientific information.  The IAU therefore resolves that planets and other bodies, except satellites, in our Solar System be defined into three distinct categories in the following way: Debate—and Discoveries—Continue Astronomers and planetary scientists did not unanimously agree with these definitions. To some it appeared that the classification scheme was designed to limit the number of planets; to others it was incomplete and the terms unclear. Some astronomers argued that location (context) is important, especially in understanding the formation and evolution of the solar system. One idea is to simply define a planet as a natural object in space that is massive enough for gravity to make it approximately spherical. But some scientists objected that this simple definition does not take into account what degree of measurable roundness is needed for an object to be considered round. In fact, it is often difficult to accurately determine the shapes of some distant objects. Others argue that where an object is located or what it is made of do matter and there should not be a concern with dynamics; that is, whether or not an object sweeps up or scatters away its immediate neighbors, or holds them in stable orbits. The lively planethood debate continues. As our knowledge deepens and expands, the more complex and intriguing the universe appears. Researchers have found hundreds of extrasolar planets, or exoplanets, that reside outside our solar system; there may be billions of exoplanets in the Milky Way Galaxy alone, and some may be habitable (have conditions favorable to life). Whether our definitions of planet can be applied to these newly found objects remains to be seen. Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 The quest to understand our solar system begins close to home. Earthquake science paves the way for the study of quakes on icy ocean worlds like Jupiter’s moon Europa. South America’s driest deserts serve as testing grounds for the robots that search for life on Mars. Volcanoes around the world help researchers interpret evidence of volcanic activity on the Moon and beyond.  Similar environments on different worlds are called planetary analogs. Comparing planetary analogs is a powerful way to make sense of our solar system. NASA teams explore three main kinds of planetary analogs. Geologic Analogs​ Astrobiology Analogs Mission Analogs  Rocks record history. They tell the stories of past volcanic eruptions, giant earthquakes, erosion processes, and meteoric impacts – if we know how to look. To make sense of what we see, we study geology from many different perspectives. Remote sensing shows us the big picture. Large features like canyons and continents are easy to see from far away. Spacecraft, aircraft, drones, and telescopes are all useful remote sensing tools. Sometimes, it helps to take a closer look. Information collected on site, in the field, is called ground truth data. Apollo astronauts have collected ground truth data on the Moon. Robotic landers and rovers can make ground truth observations, too. Ground truth science on Earth provides valuable information about our home planet. It also helps us to check our understanding of satellite imagery. When long-distance observations of Earth match with data gathered on the ground, we can be confident about using remote sensing on other worlds, too. The Moon, Mars, Mercury, and Venus all have volcanoes. Jupiter’s moon Io is so volcanically active that, at any given time, several volcanoes are erupting. Getting to know Earth’s volcanoes helps us understand how and when volcanoes erupt on other planets and moons. Different kinds of eruptions create a variety of volcanoes. Explosive eruptions make ash. More gentle eruptions generate lava flows. Some lava flows also form caves, called lava tubes. Explorers are curious about lava tubes because they can harbor interesting resources, like water and sulfur. Future visitors to the Moon might use lava tubes for shelter from the hazards of outer space.  Researchers visit lava tubes on Earth to test new ways to identify them from the surface. They use special science instruments to \"see through\" the rock and detect caves below. One day, astronauts could use tools like these to study lava flows on the Moon and Mars.  The movement of materials like dust, sand, and rocks around the surface of a planet is called erosion. Wind, storms, landslides, glaciers, and flowing water all cause this kind of movement. To find out what kind of erosion has happened, scientists study the patterns left behind. On Mars, for example, ancient shorelines and dry riverbeds hint at a watery past.  Many patterns are common throughout our solar system – like sand dunes, found on Earth, Mars, Venus, and Saturn’s moon Titan. Impacts batter planetary surfaces throughout our solar system. Often, when an object traveling through space crashes into a planet or moon, it forms a crater. In very large impacts, surface material can be excavated, or thrown from the impact site. This leaves a window for scientists to see what lies beneath. Earth has relatively few impact craters. Many objects collide with the Moon or burn up in the atmosphere before hitting the ground. When impactors do reach Earth’s surface, our active planet slowly erases the evidence. Erosion, tectonic movement, and volcanic activity make ancient craters difficult to see.  Despite these factors, a few impact sites remain visible and accessible on Earth's surface. These examples help geologists interpret craters on the Moon, Mars, and beyond. Terrestrial planets begin as molten bodies and cool over time. As a planet loses heat, its surface changes shape. Hot material continues to move around in the planet’s interior, causing surface deformation. This is called tectonism. Tectonic activity is all around us. Mountains, faults, folds, fractures, and earthquakes teach us about Earth's past and present. Lunar experiments set up by Apollo astronauts show that the Moon is not only quaking, but shrinking. Marsquakes reveal the Red Planet’s internal structure to NASA's InSight lander. Each world provides clues about how objects in our solar system formed, how they cooled, and what might be happening inside.  Astrobiologists explore the forms that biology might take on other worlds. Our planet’s most extreme habitats are full of surprising examples to study. Deep in Earth's oceans, for instance, microbes thrive in very salty, high-pressure environments. These tough and tiny creatures show us what life could be like in salt-watery alien terrain. The search for extraterrestrial life requires both evidence and imagination. It’s difficult to predict what an encounter with life beyond Earth will be like. There is no guarantee that it will resemble anything humans have ever experienced. Will we know it when we see it? Will we find biosignatures in rocks, in an atmosphere if there is one, in liquid form? Could a close-up image provide proof? Will we need to examine the area in other ways? Is it possible to study alien biology while keeping it, and our own world, safe from harm? Earth's strangest ecosystems prepare us to ask the right questions when searching for life in other places. To learn more about astrobiology analogs, visit: https://astrobiology.nasa.gov/research-locations/   Before Apollo astronauts collected samples on the Moon, they practiced here on Earth. Today, teams test their plans and equipment in environments ranging from volcanic fields to the ocean floor. Future crews, too, will train on Earth for the challenges of space travel. This kind of preparation is called mission analog research. Analog missions allow us to try out equipment and procedures in rough, remote places without ever leaving our planet. Some teams spend up to three weeks at a time living and working deep undersea. Others take to the desert to try out new rovers and geological tools. These trials reveal strengths and weaknesses so that we can improve our systems. They also teach us how to manage human challenges like prolonged isolation. To learn more about mission analogs, visit: https://www.nasa.gov/analogs  In the field, everyone works together to achieve mission goals. Astronauts may try new exploration tools while geologists search for hints about our planet's past. Engineers can test their rovers against rough terrain and time delays. At the same time, astrobiologists might scour the rocks nearby for evidence of past and present life. By working as a team, we advance our knowledge of Earth and beyond. Analog studies have already changed the way we understand our place in space, and there are many discoveries left to make. Future scientists, engineers, and astronauts will have exciting questions to answer. To succeed, they'll need to learn all they can from each other and our home planet. Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 The Analog Explorer gallery shows field research sites on Earth side-by-side with similar environments on other worlds. Pairs like these are called planetary analogs. Research at analog locations on Earth helps scientists to make sense of our solar system. Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 Our Sun is a 4.5 billion-year-old star – a hot glowing ball of hydrogen and helium at the center of our solar system. The Sun is about 93 million miles (150 million kilometers) from Earth, and without its energy, life as we know it could not exist here on our home planet.  The Sun is the largest object in our solar system. The Sun’s volume would need 1.3 million Earths to fill it. Its gravity holds the solar system together, keeping everything from the biggest planets to the smallest bits of debris in orbit around it. The hottest part of the Sun is its core, where temperatures top 27 million degrees Fahrenheit (15 million degrees Celsius). The Sun’s activity, from its powerful eruptions to the steady stream of charged particles it sends out, influences the nature of space throughout the solar system. The Helioviewer Project allows everyone to explore the Sun using intuitive interfaces and novel technology. Explore the Sun NASA and other international space agencies monitor the Sun 24/7 with a fleet of spacecraft, studying everything from its atmosphere to its surface, and even peering inside the Sun using special instruments. Sun-exploring spacecraft include Parker Solar Probe, Solar Orbiter, SOHO,  ACE, IRIS, WIND, Hinode, Solar Dynamics Observatory, and STEREO.  Everything you need to know about your star. Sun In Depth  The Sun is about 100 times wider than Earth and about 10 times wider than Jupiter, the biggest planet. If the Sun were as tall as a typical front door, Earth would be about the size of a nickel. The Sun is the only star in our solar system. It is the center of our solar system, and its gravity holds the solar system together. Everything in our solar system revolves around it – the planets, asteroids, comets, and tiny bits of space debris. Measuring a “day” on the Sun is complicated because of the way it rotates. It doesn't spin as a single, solid ball. This is because the Sun’s surface isn't solid like Earth's. Instead, the Sun is made of super-hot, electrically charged gas called plasma. This plasma rotates at different speeds on different parts of the Sun. At its equator, the Sun completes one rotation in 25 Earth days. At its poles, the Sun rotates once on its axis every 36 Earth days. SUN SHINING IN EXTREME ULTRAVIOLET The part of the Sun we see from Earth – the part we call the surface – is the photosphere. The Sun doesn’t actually have a solid surface because it’s a ball of plasma. Above the Sun’s surface are its thin chromosphere and the huge corona (crown). This is where we see features such as solar prominences, flares, and coronal mass ejections. The latter two are giant explosions of energy and particles that can reach Earth. The Sun doesn’t have moons, but it’s orbited by eight planets, at least five dwarf planets, tens of thousands of asteroids, and perhaps three trillion comets and icy bodies. Several spacecraft are currently investigating the Sun including Parker Solar Probe, STEREO, Solar Orbiter, SOHO, Solar Dynamics Observatory, Hinode, IRIS, and Wind. The Sun would have been surrounded by a disk of gas and dust early in its history when the solar system was first forming 4.6 billion years ago. Some of that dust is still around today, in several dust rings that circle the Sun. They trace the orbits of planets, whose gravity tugs dust into place around the Sun.  Nothing could live on the Sun, but its energy is vital for most life on Earth. The temperature in the Sun's core is about 27 million degrees Fahrenheit (15 million degrees Celsius) – hot enough to sustain nuclear fusion. This creates outward pressure that supports the star's gigantic mass, keeping it from collapsing. ​   The Sun has inspired us since ancient times. It’s central to mythology and religion in cultures around the world, including the ancient Egyptians, the Aztecs of Mexico, Native American tribes of North and South America, the Chinese, and many others. Countless musicians have written songs about the Sun. The Beatles had a hit in 1969 with “Here Comes the Sun.” Other popular songs that reference the Sun include: “Walkin’ on the Sun” by Smashmouth; “Ain’t No Sunshine” by Bill Withers; “Walking on Sunshine” by Katrina and the Waves; “Pocketful of Sunshine” by Natasha Bedingfield; and “Let the Sunshine In” by the Fifth Dimension. If you're Superman or a fellow Kryptonian, your powers are heightened by the yellow glow of our Sun, and you can even dispose of dangerous materials, as Superman and Superboy did, by hurling them into the Sun. In the 1990 science fiction film “Solar Crisis,” a huge solar flare is about to scorch Earth. Astronauts are supposed to use a bomb to divert the flare. In the 2007 film “Sunshine,” the Sun is dying, plummeting Earth into a deep freeze. To save humanity, astronauts try to reignite the Sun with a bomb, though things don't quite go as planned. In the 2019 film “The Wandering Earth,” once again the Sun is dying, but there’s no bomb this time. Instead, people build giant rocket thrusters to move the Earth to a new star system. (Like all stars, the Sun will eventually run out of energy – but scientists don’t expect this to happen for another 5 billion years or so.)  The Sun is a star. There are lots of stars in the universe, but the Sun is the closest one to Earth, and it’s the only one in our solar system. It is the center of our solar system. The Sun is a hot ball of glowing gases. It keeps our planet warm enough for living things to grow.  It gives us light so we can see. The planets orbit the Sun: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, and Neptune. The dwarf planets Pluto, Ceres, Makemake, Haumea, and Eris also orbit the Sun. Visit NASA Space Place for more kid-friendly facts.  Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 The smallest planet in our solar system and nearest to the Sun, Mercury is only slightly larger than Earth's Moon. From the surface of Mercury, the Sun would appear more than three times as large as it does when viewed from Earth, and the sunlight would be as much as seven times brighter. Despite its proximity to the Sun, Mercury is not the hottest planet in our solar system – that title belongs to nearby Venus, thanks to its dense atmosphere. Because of Mercury's elliptical – egg-shaped – orbit, and sluggish rotation, the Sun appears to rise briefly, set, and rise again from some parts of the planet's surface. The same thing happens in reverse at sunset. Everything you need to know about Mercury. mercury in depth  Mercury is the smallest planet in our solar system – only slightly larger than Earth's Moon.  Mercury is the planet that orbits the closest to the Sun. Mercury is the fastest planet in our solar system – traveling through space at nearly 29 miles (47 kilometers) per second. The closer a planet is to the Sun, the faster it travels. Since Mercury is the fastest planet and has the shortest distance to travel around the Sun, it has the shortest year of all the planets in our solar system – 88 days. Mercury is a rocky planet, also known as a terrestrial planet. Mercury has a solid, cratered surface, much like the Earth's moon. Mercury's thin atmosphere, or exosphere, is composed mostly of oxygen (O2), sodium (Na), hydrogen (H2), helium (He), and potassium (K).  Mercury has no moons.  There are no rings around Mercury.  It is unlikely that life as we know it could survive on Mercury due to solar radiation, and extreme temperatures. Standing on Mercury's surface at its closest approach to the Sun, our star would appear more than three times larger than it does on Earth. Two NASA missions have explored Mercury: Mariner 10 was the first to fly by Mercury, and MESSENGER was the first to orbit. ESA's BepiColombo is on its way to Mercury.  The smallest planet in our solar system has a big presence in our collective imagination. Scores of science fiction writers have been inspired by Mercury, including Isaac Asimov, C. S. Lewis, Ray Bradbury, Arthur C. Clarke, and H. P. Lovecraft. Television and film writers, too, have found the planet an ideal location for storytelling. In the animated television show \"Invader Zim,\" Mercury is turned into a prototype giant spaceship by the extinct Martians. And in the 2007 film \"Sunshine,\" the Icarus II spacecraft goes into orbit around Mercury to rendezvous with the Icarus I. In the comic strip \"Calvin and Hobbes,\" Calvin and his classmate Susie give a presentation about Mercury, in which Calvin's contribution is full of questionable information: \"The planet Mercury was named after a Roman god with winged feet,\" says Calvin. \"Mercury was the god of flowers and bouquets, which is why today he is a registered trademark of FTD florists. Why they named a planet after this guy, I can't imagine.\"  Mercury is the smallest planet in our solar system. It’s a little bigger than Earth’s Moon. It is the closest planet to the Sun, but it’s actually not the hottest. Venus is hotter. Along with Venus, Earth, and Mars, Mercury is one of the rocky planets. It has a solid surface that is covered with craters like our Moon. It has a thin atmosphere, and it doesn’t have any moons. Mercury likes to keep things simple. Mercury spins slowly compared to Earth, so one day lasts a long time. Mercury takes 59 Earth days to make one full rotation. But a year on Mercury goes fast. Because it’s the closest planet to the sun, it goes around the Sun in just 88 Earth days. Visit NASA Space Place for more kid-friendly facts.  Planetary Photojournal: Mercury Johns Hopkins University MESSENGER Mission Site For Kids: About Mercury Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 Venus is the second planet from the Sun and is Earth’s closest planetary neighbor. It’s one of the four inner, terrestrial (or rocky) planets, and it’s often called Earth’s twin because it’s similar in size and density. These are not identical twins, however – there are radical differences between the two worlds. Venus has a thick, toxic atmosphere filled with carbon dioxide and it’s perpetually shrouded in thick, yellowish clouds of sulfuric acid that trap heat, causing a runaway greenhouse effect. It’s the hottest planet in our solar system, even though Mercury is closer to the Sun. Surface temperatures on Venus are about 900 degrees Fahrenheit (475 degrees Celsius) – hot enough to melt lead. The surface is a rusty color and it’s peppered with intensely crunched mountains and thousands of large volcanoes. Scientists think it’s possible some volcanoes are still active. Venus has crushing air pressure at its surface – more than 90 times that of Earth – similar to the pressure you'd encounter a mile below the ocean on Earth. Another big difference from Earth – Venus rotates on its axis backward, compared to most of the other planets in the solar system. This means that, on Venus, the Sun rises in the west and sets in the east, opposite to what we experience on Earth. (It’s not the only planet in our solar system with such an oddball rotation – Uranus spins on its side.) Venus was the first planet to be explored by a spacecraft – NASA’s Mariner 2 successfully flew by and scanned the cloud-covered world on Dec. 14, 1962. Since then, numerous spacecraft from the U.S. and other space agencies have explored Venus, including NASA’s Magellan, which mapped the planet's surface with radar. Soviet spacecraft made the most successful landings on the surface of Venus to date, but they didn’t survive long due to the extreme heat and crushing pressure. An American probe, one of NASA's Pioneer Venus Multiprobes, survived for about an hour after impacting the surface in 1978. More recent Venus missions include ESA’s Venus Express (which orbited from 2006 until 2016) and Japan’s Akatsuki Venus Climate Orbiter (orbiting since 2016). NASA’s Parker Solar Probe has made multiple flybys of Venus. On Feb. 9, 2022, NASA announced the spacecraft had captured its first visible light images of the surface of Venus from space during its February 2021 flyby. In June 2021, three new missions to Venus were announced. NASA announced two new missions, and ESA announced one: Everything you need to know about Venus. Venus In Depth  Venus is often called \"Earth’s twin\" because they’re similar in size and structure, but Venus has extreme surface heat and a dense, toxic atmosphere. If the Sun were as tall as a typical front door, Earth and Venus would each be about the size of a nickel. Venus is the second closest planet to the Sun, orbiting at a distance of about 67 million miles (108 million kilometers) Venus rotates very slowly on its axis – one day on Venus lasts 243 Earth days. The planet orbits the Sun faster than Earth, however, so one year on Venus takes only about 225 Earth days, making a Venusian day longer than its year! Venus has a solid surface covered in dome-like volcanoes, rifts, and mountains, with expansive volcanic plains and vast, ridged plateaus. The average surface of Venus is less than a billion years old, and possibly as young as 150 million years old – which is relatively young from a geological perspective. This is a major conundrum for scientists – they don’t know exactly what happened that made Venus completely resurface itself. Venus’ thick atmosphere traps heat creating a runaway greenhouse effect – making it the hottest planet in our solar system with surface temperatures hot enough to melt lead. The greenhouse effect makes Venus roughly 700°F (390°C) hotter than it would be without a greenhouse effect. Venus is permanently shrouded in thick, toxic clouds of sulfuric acid that start at an altitude of 28 to 43 miles (45 to 70 kilometers). The clouds smell like rotten eggs! Venus was the first planet explored by a spacecraft and was intensely studied early in the history of space exploration. Venus was also the first planet whose surface was reached by a spacecraft from Earth. The intense heat means landers have only survived for a couple of hours. Venus is an unlikely place for life as we know it, but some scientists theorize microbes might exist high in the clouds where it’s cooler and the pressure is similar to Earth’s surface. Phosphine, a possible indicator of microbial life, has been observed in the clouds. Venus rotates backward on its axis compared to most planets in our solar system. This means the Sun rises in the west and sets in the east, opposite of what we see on Earth.  Because it’s so bright and easy to see in the sky, Venus has played a role in popular culture since ancient times, inspiring writing and song: It was called the most beautiful star in the sky by Homer, author of \"The Iliad\" and \"The Odyssey\" – two of the oldest and most important works in Greek literature. More recently, Venus became a popular venue for 20th-century science fiction writers, including Edgar Rice Burroughs (“Pirates of Venus,” 1934); Arthur C. Clarke (“Before Eden,” 1961); and C.S. Lewis (“Perelandra,” 1943). Australian author Shirley Hazzard won the 1980 National Book Critics Circle Award for fiction with her book, “The Transit of Venus,” about two orphaned sisters. American author John Gray used the planet and its masculine counterpart to explain relationships in his 1992 book “Men Are From Mars, Women Are From Venus.” A song called “Venus” was teen idol Frankie Avalon’s first No. 1 hit when it topped the Billboard Hot 100 chart in 1959. A decade later, a different song called “Venus\" by the Dutch rock band Shocking Blue topped the charts in several countries. In 1986, British pop group Bananarama had a No. 1 hit in the U.S. with their cover of the song. More recently, Venus has been a backdrop for video games such as Transhuman Space, Battlezone, and Destiny. And in the Disney animated film “The Princess and the Frog,” Ray the firefly falls in love with Venus, “the evening star,” as he has mistaken it for another firefly.  Venus is the second planet from the Sun and Earth’s closest planetary neighbor. Even though Mercury is closer to the Sun, Venus is the hottest planet in our solar system. Its thick atmosphere is full of the greenhouse gas carbon dioxide, and it has clouds of sulfuric acid. The atmosphere traps heat, making it feel like a furnace on the surface. It’s so hot on Venus, the metal lead would melt. Venus is sometimes called Earth’s twin because it’s similar in size and structure, but the planets are very different in other ways. In addition to being extremely hot, Venus is unusual because it spins in the opposite direction of Earth and most other planets. It also has a very slow rotation making its day longer than its year. Visit NASA Space Place for more kid-friendly facts.  Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 Our home planet is the third planet from the Sun, and the only place we know of so far that’s inhabited by living things. While Earth is only the fifth largest planet in the solar system, it is the only world in our solar system with liquid water on the surface. Just slightly larger than nearby Venus, Earth is the biggest of the four planets closest to the Sun, all of which are made of rock and metal. The name Earth is at least 1,000 years old. All of the planets, except for Earth, were named after Greek and Roman gods and goddesses. However, the name Earth is a Germanic word, which simply means “the ground.” Everything you need to know about your home planet. Earth In Depth  If the Sun were as tall as a typical front door, Earth would be the size of a nickel. Earth orbits our Sun, a star. Earth is the third planet from the Sun at a distance of about 93 million miles (150 million km).  A day on Earth is 24 hours. Earth makes a complete orbit around the sun (a year in Earth time) in about 365 days. Earth is a rocky planet with a solid and dynamic surface of mountains, canyons, plains and more. Most of our planet is covered in water. Earth's atmosphere is 78 percent nitrogen, 21 percent oxygen and 1 percent other ingredients—the perfect balance to breathe and live.  Earth has one moon.  Earth has no rings. Many orbiting spacecraft study the Earth from above as a whole system—observing the atmosphere, ocean, glaciers, and the solid earth. Earth is the perfect place for life as we know it. Our atmosphere protects us from incoming meteoroids, most of which break up in our atmosphere before they can strike the surface.  Storytellers explore the nature of our planet and possible alternate realities in many books, movies, and television shows. The iconic film \"Planet of the Apes\" (and its sequels) takes place in a future in which astronauts \"discover\" a planet inhabited by highly intelligent apes and primitive humans, only to realize later, much to their dismay, that – spoiler alert! – it was Earth all along. In the long-running and re-booted television series \"Battlestar Galactica\" – tired survivors of a war with highly evolved robots called Cylons are on a quest to find Earth, a long-lost colony. In other stories, Earth has been abandoned or destroyed, such as in the Joss Whedon series \"Firefly,\" or the book and its film adaptation \"The Hitchhiker's Guide to the Galaxy.\" In the animated feature \"Titan A.E.\" – Earth has been destroyed by an alien species, but a well-placed planet builder recreates it and all the species that live on it.  Our home planet Earth is a rocky, terrestrial planet. It has a solid and active surface with mountains, valleys, canyons, plains and so much more. Earth is special because it is an ocean planet. Water covers 70% of Earth's surface. Earth's atmosphere is made mostly of nitrogen and has plenty of oxygen for us to breathe. The atmosphere also protects us from incoming meteoroids, most of which break up before they can hit the surface. Visit NASA Space Place for more kid-friendly facts.  NASA Earth Science Division NASA’s Climate Portal NASA Earth Observatory For Kids: About Earth Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023 ​Mars is the fourth planet from the Sun – a dusty, cold, desert world with a very thin atmosphere. Mars is also a dynamic planet with seasons, polar ice caps, canyons, extinct volcanoes, and evidence that it was even more active in the past. Mars is one of the most explored bodies in our solar system, and it's the only planet where we've sent rovers to roam the alien landscape. NASA currently has two rovers (Curiosity and Perseverance), one lander (InSight), and one helicopter (Ingenuity) exploring the surface of Mars.   Perseverance rover – the largest, most advanced rover NASA has sent to another world – touched down on Mars on Feb. 18, 2021, after a 203-day journey traversing 293 million miles (472 million kilometers). The Ingenuity helicopter rode to Mars attached to the belly of Perseverance. Perseverance is one of three spacecraft that arrived at Mars in 2021. The Hope orbiter from the United Arab Emirates arrived on Feb. 9, 2021. China’s Tianwen-1 mission arrived on Feb. 10, 2021, and includes an orbiter, a lander, and a rover. Europe and India also have spacecraft studying Mars from orbit. In May 2021, China became the second nation to ever land successfully on Mars when its Zhurong Mars rover touched down.  An international fleet of eight orbiters is studying the Red Planet from above including three NASA orbiters: 2001 Mars Odyssey, Mars Reconnaissance Orbiter, and MAVEN. These robotic explorers have found lots of evidence that Mars was much wetter and warmer, with a thicker atmosphere, billions of years ago. Everything you need to know about Mars. Mars In Depth  If the Sun were as tall as a typical front door, Earth would be the size of a dime, and Mars would be about as big as an aspirin tablet. Mars orbits our Sun, a star. Mars is the fourth planet from the Sun at an average distance of about 228 million km (142 million miles) or 1.52 AU. One day on Mars takes a little over 24 hours. Mars makes a complete orbit around the Sun (a year in Martian time) in 687 Earth days. Mars is a rocky planet. Its solid surface has been altered by volcanoes, impacts, winds, crustal movement and chemical reactions. Mars has a thin atmosphere made up mostly of carbon dioxide (CO2), argon (Ar), nitrogen (N2), and a small amount of oxygen and water vapor. Mars has two moons named Phobos and Deimos. There are no rings around Mars. Several missions have visited this planet, from flybys and orbiters to rovers on the surface.The first true Mars mission success was the Mariner 4 flyby in 1965. At this time, Mars' surface cannot support life as we know it. Current missions are determining Mars' past and future potential for life. Mars is known as the Red Planet because iron minerals in the Martian soil oxidize, or rust, causing the soil and atmosphere to look red.  No other planet has captured our collective imagination quite like Mars. In the late 1800s when people first observed the canal-like features on Mars' surface, many speculated that an intelligent alien species resided there. This led to numerous stories about Martians, some of whom invade Earth, like in the 1938 radio drama, \"The War of the Worlds.\" According to an enduring urban legend, many listeners believed the story to be real news coverage of an invasion, causing widespread panic. Countless stories since have taken place on Mars or explored the possibilities of its Martian inhabitants. Movies like \"Total Recall\" (1990 and 2012) take us to a terraformed Mars and a struggling colony running out of air. A Martian colony and Earth have a prickly relationship in \"The Expanse\" television series and novels. And in the 2014 novel and its 2015 movie adaptation, \"The Martian,\" botanist Mark Watney is stranded alone on the planet and struggles to survive until a rescue mission can retrieve him.  Mars is a cold desert world. It is half the size of Earth. Mars is sometimes called the Red Planet. It's red because of rusty iron in the ground. Like Earth, Mars has seasons, polar ice caps, volcanoes, canyons, and weather. It has a very thin atmosphere made of carbon dioxide, nitrogen, and argon. There are signs of ancient floods on Mars, but now water mostly exists in icy dirt and thin clouds. On some Martian hillsides, there is evidence of liquid salty water in the ground. Visit NASA SpacePlace for more kid-friendly facts.  Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: March 28, 2023", "url": "https://www.nasa.gov/press-release/touchdown-nasas-mars-perseverance-rover-safely-lands-on-red-planet"}