{"title": "Biohack me, baby: I can't wait for Teemu Arina at TNW Conference", "content": "We are officially 80% SOLD OUT! Secure your ticket today 🎟️ →                                             Thomas is a senior reporter at TNW. He covers European tech, with a focus on deeptech, startups, and government policy.                                                                                                                                Thomas is a senior reporter at TNW. He covers European tech, with a focus on deeptech, startups, and government policy.                                         Teemu Arina will be speaking at TNW Conference, which takes place on June 15 & 16 in Amsterdam. If you want to experience the event (and say hi to our editorial team!), we’ve got something special for our loyal readers. Use the promo code READ-TNW-25 and get a 25% discount on your business pass for TNW Conference. See you in Amsterdam! I often fantasise about biohacking my useless brain. At TNW Conference, my dreams could finally be fulfilled. On day two of the event, biohacker Teemu Arina will immerse attendees in the fascinating realm of human enhancement. Arina is one of the world’s leading authorities on the movement. He co-authored the bestselling Biohacker’s Handbook and founded the Biohacker Summit — Europe’s leading conference for optimising human performance. He’s also the co-founder of Biohacker Center, an independent think tank that researches peak performance, health, and well-being. Naturally, Arina meticulously biohacks himself. Initially, I imagined this would involve drilling brain chips into his skull. But biohacking is closer to DIY biology. Arina’s website provides a more detailed description: “Biohacking is the art and science of optimizing your body, mind, and performance with systems thinking, technology, and biology — in other words, better living through science.” Arina entered the field after he was afflicted by a chronic illness. Biohacking provided a route to recovery. That led him to further optimise his health and performance with biological and technological tools. Some of these tools are surprisingly accessible. Arina uses activity trackers to manage stress, a headset to measure brainwaves, a muscle scanner to guide fitness training, and a blue light device to synchronise his circadian rhythm. At TNW Conference on June 16, Arina will unravel the next phase of biohacking — and how it can unlock human potential. He promises to share his pioneering techniques for enhancing physical and mental performance. To my decrepit mind and body, that sounds like an unmissable offer. And just in case Arina wants to ramp it up, I’m bringing my brain and scalpel. Teemu Arina’s biohacking tips are merely one attraction of TNW Conference. You can find more on the event agenda — and remember: for a 25% discount on business passes, use the promo code READ-TNW-25. Get the TNW newsletter Get the most important tech news in your inbox each week. Google releases Bard to the world – but leaves the EU behind Digital twins could save your life. Here’s how When will AGI arrive? Here’s what our tech lords predict Europe’s precarious path to quantum computing supremacy We’re closer than ever before to creating a real lightsaber The heart of tech                     Copyright © 2006—2023, The Next Web B.V.                    Made with <3 in Amsterdam.                    ", "url": "https://thenextweb.com/news/biohacker-teemu-arinas-will-speak-at-tnw-conference", "threshold": 0.9999779265929298}