{"title": "EU nears ban on predictive policing and facial recognition", "content": "We are officially 80% SOLD OUT! Secure your ticket today 🎟️ →                                             Thomas is a senior reporter at TNW. He covers European tech, with a focus on deeptech, startups, and government policy.                                                                                                                                Thomas is a senior reporter at TNW. He covers European tech, with a focus on deeptech, startups, and government policy.                                         The EU is edging closer to a landmark ban on predictive policing and facial recognition. At a crunch vote today on the bloc’s flagship AI Act, two committees of MEPs overwhelmingly endorsed sweeping new rules on artificial intelligence. The text now moves to a vote by the entire European Parliament in June. Once approved, the regulation will become the world’s first comprehensive AI law. At Thursday’s vote, MEPs approved a strengthened version of the rulebook. The Act now prohibits predictive policing and facial recognition in public spaces. The amendments also introduce new restrictions on generative models, such as ChatGPT, and emotion recognition. Civil liberties campaigners have welcomed the move. Fair Trials, a criminal justice watchdog, described the vote as “a landmark result” for human rights. “These systems automate injustice, exacerbating and reinforcing racism and discrimination in policing and the criminal justice system, and feeding systemic inequality in society,” said Griff Ferris, Senior Legal and Policy Officer at Fair Trials. “The EU Parliament has taken an important step in voting for a ban on these systems, and we urge them to finish the job at the final vote in June.” In the tech sector, reactions to the vote were mixed. The Software Alliance (BSA), a lobby group that represents the likes of Microsoft and IBM, has called for further clarification. “The enterprise software industry remains concerned about the allocation of responsibilities in the AI value chain and the treatment of foundation models,” said Matteo Quattrocchi, BSA’s policy director. “The rules as currently written are not tailored to reflect companies’ roles in the AI ecosystem, or differences in business models and AI uses, and likely will not address some of the concerns raised by specific applications of some foundation models.” Privacy experts, meanwhile, can expect further demand for their services. Isabelle Roccia, MD for Europe at the International Association of Privacy Professionals, anticipates a significant impact. “Organisations will have to increasingly rely on their privacy teams to operationalize AI because their data stewardship expertise is highly transferrable and extremely relevant to AI governance,” she said. Get the TNW newsletter Get the most important tech news in your inbox each week. Google releases Bard to the world – but leaves the EU behind Digital twins could save your life. Here’s how Biohack me, baby: Why I can’t wait for Teemu Arina’s talk at TNW Conference When will AGI arrive? Here’s what our tech lords predict Europe’s precarious path to quantum computing supremacy The heart of tech                     Copyright © 2006—2023, The Next Web B.V.                    Made with <3 in Amsterdam.                    ", "url": "https://thenextweb.com/news/ai-act-vote-pushes-eu-ban-on-predictive-policing-facial-recognition", "threshold": 0.9788369706591378}