{"title": "Sustainable farming on Earth and in space: A must-see at TNW Conference", "content": "We are officially 80% SOLD OUT! Secure your ticket today 🎟️ →                                             Ioanna is a writer at TNW. She covers the full spectrum of the European tech ecosystem, with a particular interest in startups, sustainabili                                                                                                                                                (show all)                                                                                            Ioanna is a writer at TNW. She covers the full spectrum of the European tech ecosystem, with a particular interest in startups, sustainability, green tech, AI, and EU policy. With a background in the humanities, she has a soft spot for social impact-enabling technologies.                                         Barbara Belvisi, award-winning innovator and entrepreneur, will be speaking at TNW Conference, which takes place on June 15 & 16 in Amsterdam. If you want to experience the event (and say hi to our editorial team!), we’ve got something special for our loyal readers. Use the promo code READ-TNW-25 and get a 25% discount on your business pass for TNW Conference. See you in Amsterdam! Picture a future where technology enables sustainable living on Earth, while preparing for life in space. That’s the exact mission of Interstellar Lab — and this future is happening now! So if you share my excitement about humankind’s prospect to become a multiplanetary species, then at TNW Conference, you’re in for a treat. On day one of the event, Barbara Belvisi, founder and CEO of the company, will tell the audience about how the startup’s BioPod is the next-generation greenhouse for the Earth and beyond. It all started in 2018, when Belvisi founded Interstellar Lab, driven by her childhood passion for nature and space. The French-American startup entered the industry with a visionary project: the development of mini extraterrestrial cities, called Experimental Bio-regenerative Stations (Ebios). The concept encompasses an array of modules, which, independently or combined, house all the infrastructure and resources needed to support and sustain human life on Mars and the Moon. The first module developed is a sustainable farming system called BioPod. But its purpose isn’t only to prepare for life in space; it can also alleviate the climate crisis we’re currently facing. We did it! First full-scale BioPod is out and operational. 🌱🚀Our first BioPod is inspired by space and designed for earth. BioPod provides sustainable farming solutions for agriculture, natural ingredient sourcing and bioconservation.Space for earth 🚀🌎 pic.twitter.com/tZ70mvvekn — Interstellar Lab (@InterstellarLA) September 29, 2022 According to Belvisi, the team first came up with the idea of a dome structure that could fulfill the nutritional needs of four astronauts on the Moon. They then turned this design into a product for the Earth. Built to withstand extreme climates, BioPod is a 55m2 bubble-shaped greenhouse made of an inflatable membrane and composite base. It’s a fully autonomous, controlled-environment module that, thanks to AI and its aeroponics system, can create any type of climate, securing the ideal conditions for plants to grow. 🏆We have won the #BOLDAward in the #SpaceFrontier category 🚀! Congratulations to all the nominees and winners of the @Bold_Awards and hope to continue boldly innovating the way we grow food and protect life on Earth and beyond! 🌏🌿➡ Read more : https://t.co/lhl7zxRFBg pic.twitter.com/lkir8XIJfm — Interstellar Lab (@InterstellarLA) April 4, 2023 The benefits of this technology are large and far-reaching. BioPod’s ability to cultivate virtually any plant and examine their hidden potential — such as producing fruits with higher nutrition concentration or cosmetic plants with specific oil concentration — render it a groundbreaking solution for a variety of purposes: from agriculture, research, and cosmetics, to medicine and bioconservation. Notably, Interstellar Lab claims that each BioPod can increase yield by approximately 300 times, reduce water consumption by 98%, lower energy consumption by about 20 times, and capture 1 tonne of CO2 annually. At the TNW Conference on June 15, Barbara Belvisi will share how Interstellar Lab is disrupting sustainable agriculture on Earth, while providing a test-bed for future life support in space. I, for one, can’t wait to hear how merging space and Earth tech can help us live a better life on this planet and beyond. Barbara Belvisi’s insights on multiplanetary life are merely one attraction of TNW Conference. You can find more on the event agenda — and remember: for a 25% discount on business passes, use the promo code READ-TNW-25. Get the TNW newsletter Get the most important tech news in your inbox each week. Dutch students unveil ‘world’s most efficient’ hydrogen car Sweden to pave world’s first permanent e-road for EV charging while driving Browning bananas under threat as Philippines approves gene-edited version Spain’s Crowmie empowers everyone to invest in green energy Hub motor vs mid-drive: Which type of ebike is best for you? The heart of tech                     Copyright © 2006—2023, The Next Web B.V.                    Made with <3 in Amsterdam.                    ", "url": "https://thenextweb.com/news/sustainable-farming-earth-and-space-a-must-see-at-tnw-conference", "threshold": 0.999978817096427}