{"title": "The 150+ Best Board Games of All Time", "content": "These are the best board games ever made, ranked by game aficionados and casual players alike. With over 400,000 votes from 49,000 board game fans, we've got the inside scoop on what games will have you and your friends laughing, strategizing, and bonding for hours on end. What are the greatest board games ever? The classic games that have entertained families of players for decades? Or innovative new table-top role-playing games pushing the boundaries between fiction and reality? This list attempts to determine, once and for all, which are the greatest and most fun board games. Whether you're a hardcore fan or just enjoy a good time with friends, this list has got the top picks for any type of game night. A board game is any game in which pieces are placed on or moved around a flat surface, such as a board. This would include popular, centuries-old board games like Go, Chess, and Checkers, more modern games like Settlers of Catan, or even some role-playing games involving game pieces or miniatures.  Some games still utilize game pieces but are built more around live interaction or conversation than traditional \"turn-based\" board games. These games – such as Scattergories or Taboo – may not meet the strict definition of a board game but resemble board game-style play and entertainment enough to warrant inclusion. This list was determined by allowing users to make suggestions for the greatest board games and then holding an open vote on which games were the best of all time. Whether you are a hardcore board game geek or just a casual player, your votes count!  Check out all the most popular board games, and don't forget to vote on the games that you think should rise to the top! Fans love the perfect balance of strategy and luck in Settlers of Catan. Players collect resources, build settlements and cities, and trade with each other to become the dominant force on the island. With a dynamic board that changes every game and endless possibilities for gameplay, it’s no wonder Settlers of Catan has become a classic. Players collect and play train cards to build routes across the United States in Ticket to Ride. With easy-to-learn rules, colorful components, and endless replayability, fans love how Ticket to Ride is both approachable for newcomers to the hobby and deep enough to keep veterans engaged. In Pandemic, players work cooperatively to stop the spread of deadly diseases across the globe. Fans love the challenge of coordinating with teammates to strategize and make the right moves in a race against time. With multiple difficulty levels and expansion sets, Pandemic is a game that keeps players coming back for more. With a classic board and tiles, Scrabble has been a favorite of word game fans for decades. Players compete to make the highest-scoring words from a random set of letters, with strategy and vocabulary knowledge playing a pivotal role in success. Scrabble has become a household name and a must-play for any lover of word games. The ultimate test of strategy and foresight, Chess has been played for centuries and has never lost its appeal. Players move pieces across the board in an effort to capture the opponent’s king, with endless possibilities for play and a rich history of famous matches and players. Chess is a timeless classic and an essential addition to any board game collection. Players build a medieval landscape by laying tiles and placing meeples in Carcassonne. With simple yet engaging gameplay and a charming design, fans love the fun of creating their own unique world each time they play. Expansion sets add even more variety to this beloved game.", "url": "http://www.ranker.com/crowdranked-list/the-best-board-games-of-all-time", "threshold": 0.9999999927923291}