{"title": "Overview | Jupiter – NASA Solar System Exploration", "content": "Jupiter has a long history of surprising scientists – all the way back to 1610 when Galileo Galilei found the first moons beyond Earth. That discovery changed the way we see the universe. Fifth in line from the Sun, Jupiter is, by far, the largest planet in the solar system – more than twice as massive as all the other planets combined. Jupiter's familiar stripes and swirls are actually cold, windy clouds of ammonia and water, floating in an atmosphere of hydrogen and helium. Jupiter’s iconic Great Red Spot is a giant storm bigger than Earth that has raged for hundreds of years. One spacecraft – NASA's Juno orbiter – is currently exploring this giant world. Everything you need to know about Jupiter. Jupiter In Depth  Eleven Earths could fit across Jupiter’s equator. If Earth were the size of a grape, Jupiter would be the size of a basketball. Jupiter orbits about 484 million miles (778 million kilometers) or 5.2 Astronomical Units (AU) from our Sun (Earth is one AU from the Sun). Jupiter rotates once about every 10 hours (a Jovian day), but takes about 12 Earth years to complete one orbit of the Sun (a Jovian year). Jupiter is a gas giant and so lacks an Earth-like surface. If it has a solid inner core at all, it’s likely only about the size of Earth. Jupiter's atmosphere is made up mostly of hydrogen (H2) and helium (He). Jupiter has more than 75 moons. In 1979 the Voyager mission discovered Jupiter’s faint ring system. All four giant planets in our solar system have ring systems. Nine spacecraft have visited Jupiter. Seven flew by and two have orbited the gas giant. Juno, the most recent, arrived at Jupiter in 2016. Jupiter cannot support life as we know it. But some of Jupiter's moons have oceans beneath their crusts that might support life. Jupiter's Great Red Spot is a gigantic storm that’s about twice the size of Earth and has raged for over a century.  The biggest planet in our solar system, Jupiter also has a large presence in pop culture, including many movies, TV shows, video games, and comics. Jupiter was a notable destination in the Wachowski siblings’ science fiction spectacle \"Jupiter Ascending,\" while various Jovian moons provide settings for \"Cloud Atlas,\" \"Futurama,\" \"Power Rangers,\" and \"Halo,\" among many others. In the movie \"Men in Black\" when Agent J – played by Will Smith – mentions he thought one of his childhood teachers was from Venus, Agent K – played by Tommy Lee Jones – replies that she is actually from one of Jupiter’s moons.   Jupiter is the biggest planet in our solar system. It's similar to a star, but it never got big enough to start burning. Jupiter is covered in swirling cloud stripes. It has big storms like the Great Red Spot, which has been going for hundreds of years. Jupiter is a gas giant and doesn't have a solid surface, but it may have a solid inner core about the size of Earth. Jupiter also has rings, but they're too faint to see very well. Visit NASA Space Place for more kid-friendly facts.  Galileo was the first spacecraft to orbit Jupiter. Pioneer 10 was first through the asteroid belt and first to Jupiter. With a few materials and a few steps, you can build your own glasses to view 3D images. You can create your own red/blue 3D images to print, or look at on a computer screen, using a normal digital camera and some image processing software.  Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: April 25, 2023", "url": "https://solarsystem.nasa.gov/planets/jupiter/overview/", "threshold": 0.07664042661437165}