{"title": "Overview | Neptune – NASA Solar System Exploration", "content": "Dark, cold, and whipped by supersonic winds, ice giant Neptune is the eighth and most distant planet in our solar system. More than 30 times as far from the Sun as Earth, Neptune is the only planet in our solar system not visible to the naked eye and the first predicted by mathematics before its discovery. In 2011 Neptune completed its first 165-year orbit since its discovery in 1846. NASA's Voyager 2 is the only spacecraft to have visited Neptune up close. It flew past in 1989 on its way out of the solar system. Everything you need to know about Neptune. Neptune In Depth  Neptune is about four times wider than Earth. If Earth were a large apple, Neptune would be the size of a basketball. Neptune orbits our Sun, a star, and is the eighth planet from the Sun at a distance of about 2.8 billion miles (4.5 billion kilometers). Neptune takes about 16 hours to rotate once (a Neptunian day), and about 165 Earth years to orbit the sun (a Neptunian year). Neptune is an ice giant. Most of its mass is a hot, dense fluid of \"icy\" materials – water, methane and ammonia – above a small rocky core. Neptune's atmosphere is made up mostly of molecular hydrogen, atomic helium and methane. Neptune has 14 known moons which are named after sea gods and nymphs in Greek mythology. Neptune has at least five main rings and four more ring arcs, which are clumps of dust and debris likely formed by the gravity of a nearby moon. Voyager 2 is the only spacecraft to have visited Neptune. No spacecraft has orbited this distant planet to study it at length and up close. Neptune cannot support life as we know it. Because of dwarf planet Pluto’s elliptical orbit, Pluto is sometimes closer to the Sun (and us) than Neptune is.  Even though Neptune is the farthest planet from our Sun, it's a frequent stop in pop culture and fiction. The planet served as the backdrop for the 1997 science fiction horror film \"Event Horizon,\" while in the cartoon series \"Futurama,\" the character Robot Santa Claus has his home base on Neptune's north pole. \"Dr. Who\" fans will remember that an episode entitled \"Sleep No More\" is set on a space station orbiting Neptune. And in the \"Star Trek: Enterprise\" pilot episode, \"Broken Bow,\" viewers learn that at warp 4.5 speed, it is possible to fly to Neptune and back to Earth in six minutes  Neptune is dark, cold, and very windy. It's the last of the planets in our solar system. It's more than 30 times as far from the Sun as Earth is. Neptune is very similar to Uranus. It's made of a thick soup of water, ammonia, and methane over an Earth-sized solid center. Its atmosphere is made of hydrogen, helium, and methane. The methane gives Neptune the same blue color as Uranus. Neptune has six rings, but they're very hard to see. Visit NASA Space Place for more kid-friendly facts.  Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: April 25, 2023", "url": "https://solarsystem.nasa.gov/planets/neptune/overview/", "threshold": 0.9440013952988073}