{"title": "Overview | Kuiper Belt – NASA Solar System Exploration", "content": " Both Arrokoth (visited by NASA's New Horizons mission) and Pluto are in the Kuiper Belt – a donut-shaped region of icy bodies beyond the orbit of Neptune. There may be millions of these icy objects, collectively referred to as Kuiper Belt objects (KBOs) or trans-Neptunian objects (TNOs), in this distant region of our solar system. Similar to the asteroid belt, the Kuiper Belt is a region of leftovers from the solar system's early history. Like the asteroid belt, it has also been shaped by a giant planet, although it's more of a thick disk (like a donut) than a thin belt. The Kuiper Belt shouldn't be confused with the Oort Cloud, which is a much more distant region of icy, comet-like bodies that surrounds the solar system, including the Kuiper Belt. Both the Oort Cloud and the Kuiper Belt are thought to be sources of comets. The Kuiper Belt is truly a frontier in space – it's a place we're still just beginning to explore and our understanding is still evolving. Go farther. Explore the Kuiper Belt In Depth ›  The Kuiper Belt is a region of space. The known icy worlds and comets in both regions are much smaller than Earth's Moon. The Kuiper Belt is a doughnut-shaped ring of icy objects around the Sun, extending just beyond the orbit of Neptune from about 30 to 55 AU. Short-period comets (which take less than 200 years to orbit the Sun) originate in the Kuiper Belt. There may be hundreds of thousands of icy bodies larger than 100 km (62 miles) and an estimated trillion or more comets within the Kuiper Belt.  Some dwarf planets within the Kuiper Belt have thin atmospheres that collapse when their orbit carries them farthest from the Sun. Several dwarf planets within the Kuiper Belt have moons. Egg-shaped Haumea has a ring around it. The first mission to explore the Kuiper Belt is New Horizons. It flew past Pluto in 2015 and is on its way to explore another Kuiper Belt world. It is not clear if worlds in this distant, cold region are capable of supporting life as we know it. Astronomers are searching for a possible planet that might explain the strange orbits of several Kuiper Belt Objects. The nickname: Planet 9.  The inner edge of the Kuiper Belt begins at the orbit of Neptune, at about 30 AU from the Sun. (1 AU, or astronomical unit, is the distance from Earth to the Sun.) The inner, main region of the Kuiper Belt ends around 50 AU from the Sun. Overlapping the outer edge of the main part of the Kuiper Belt is a second region called the scattered disk, which continues outward to nearly 1,000 AU, with some bodies on orbits that go even farther beyond. Astronomers think the icy objects of the Kuiper Belt are remnants left over from the formation of the solar system. Similar to the relationship between the main asteroid belt and Jupiter, it's a region of objects that might have come together to form a planet had Neptune not been there. Instead, Neptune's gravity stirred up this region of space so much that the small, icy objects there weren't able to coalesce into a large planet.  Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: May 15, 2023", "url": "https://solarsystem.nasa.gov/solar-system/kuiper-belt/overview/", "threshold": -0.8571278321615288}