{"title": "Overview | Saturn – NASA Solar System Exploration", "content": "Saturn is the sixth planet from the Sun and the second-largest planet in our solar system. Adorned with thousands of beautiful ringlets, Saturn is unique among the planets. It is not the only planet to have rings – made of chunks of ice and rock – but none are as spectacular or as complicated as Saturn's. Like fellow gas giant Jupiter, Saturn is a massive ball made mostly of hydrogen and helium. Everything you need to know about Saturn. Saturn In Depth  Nine Earths side by side would almost span Saturn’s diameter. That doesn’t include Saturn’s rings. Saturn is the sixth planet from our Sun (a star) and orbits at a distance of about 886 million miles (1.4 billion kilometers) from the Sun. Saturn takes about 10.7 hours (no one knows precisely) to rotate on its axis once—a Saturn “day”—and 29 Earth years to orbit the sun. Saturn is a gas-giant planet and therefore does not have a solid surface like Earth’s. But it might have a solid core somewhere in there. Saturn's atmosphere is made up mostly of hydrogen (H2) and helium (He). Saturn has 53 known moons with an additional 29 moons awaiting confirmation of their discovery—that is a total of 82 moons. Saturn has the most spectacular ring system, with seven rings and several gaps and divisions between them. Few missions have visited Saturn: Pioneer 11 and Voyagers 1 and 2 flew by; But Cassini orbited Saturn 294 times from 2004 to 2017. Saturn cannot support life as we know it, but some of Saturn's moons have conditions that might support life. About two tons of Saturn’s mass came from Earth—the Cassini spacecraft was intentionally vaporized in Saturn’s atmosphere in 2017.  Perhaps the most iconic of all the planets in our solar system, Saturn is heavily present in pop culture. It provides a backdrop for numerous science fiction stories, movies, and TV shows, comics, and video games, including the \"Cthulhu Mythos,\" \"WALL-E,\" \"2001: A Space Odyssey,\" \"Star Trek,\" \"Dead Space 2,\" and \"Final Fantasy VII.\" In Tim Burton's film \"Beetlejuice,\" a dusty, fictional Saturn is populated by giant sandworms. And in the 2014 movie \"Interstellar,\" the wormhole that enables the astronauts to travel to another galaxy appears near Saturn. Saturn is also the namesake of Saturday, arguably the best day of the week.​  Saturn isn’t the only planet to have rings, but it definitely has the most beautiful ones. The rings we see are made of groups of tiny ringlets that surround Saturn. They’re made of chunks of ice and rock. Like Jupiter, Saturn is mostly a ball of hydrogen and helium. Visit NASA Space Place for more kid-friendly facts.  Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: April 25, 2023", "url": "https://solarsystem.nasa.gov/planets/saturn/overview/", "threshold": 0.9999370168858612}