{"title": "Planetary Analogs | Planets – NASA Solar System Exploration", "content": "The quest to understand our solar system begins close to home. Earthquake science paves the way for the study of quakes on icy ocean worlds like Jupiter’s moon Europa. South America’s driest deserts serve as testing grounds for the robots that search for life on Mars. Volcanoes around the world help researchers interpret evidence of volcanic activity on the Moon and beyond.  Similar environments on different worlds are called planetary analogs. Comparing planetary analogs is a powerful way to make sense of our solar system. NASA teams explore three main kinds of planetary analogs. Geologic Analogs​ Astrobiology Analogs Mission Analogs  Rocks record history. They tell the stories of past volcanic eruptions, giant earthquakes, erosion processes, and meteoric impacts – if we know how to look. To make sense of what we see, we study geology from many different perspectives. Remote sensing shows us the big picture. Large features like canyons and continents are easy to see from far away. Spacecraft, aircraft, drones, and telescopes are all useful remote sensing tools. Sometimes, it helps to take a closer look. Information collected on site, in the field, is called ground truth data. Apollo astronauts have collected ground truth data on the Moon. Robotic landers and rovers can make ground truth observations, too. Ground truth science on Earth provides valuable information about our home planet. It also helps us to check our understanding of satellite imagery. When long-distance observations of Earth match with data gathered on the ground, we can be confident about using remote sensing on other worlds, too. The Moon, Mars, Mercury, and Venus all have volcanoes. Jupiter’s moon Io is so volcanically active that, at any given time, several volcanoes are erupting. Getting to know Earth’s volcanoes helps us understand how and when volcanoes erupt on other planets and moons. Different kinds of eruptions create a variety of volcanoes. Explosive eruptions make ash. More gentle eruptions generate lava flows. Some lava flows also form caves, called lava tubes. Explorers are curious about lava tubes because they can harbor interesting resources, like water and sulfur. Future visitors to the Moon might use lava tubes for shelter from the hazards of outer space.  Researchers visit lava tubes on Earth to test new ways to identify them from the surface. They use special science instruments to \"see through\" the rock and detect caves below. One day, astronauts could use tools like these to study lava flows on the Moon and Mars.  The movement of materials like dust, sand, and rocks around the surface of a planet is called erosion. Wind, storms, landslides, glaciers, and flowing water all cause this kind of movement. To find out what kind of erosion has happened, scientists study the patterns left behind. On Mars, for example, ancient shorelines and dry riverbeds hint at a watery past.  Many patterns are common throughout our solar system – like sand dunes, found on Earth, Mars, Venus, and Saturn’s moon Titan. Impacts batter planetary surfaces throughout our solar system. Often, when an object traveling through space crashes into a planet or moon, it forms a crater. In very large impacts, surface material can be excavated, or thrown from the impact site. This leaves a window for scientists to see what lies beneath. Earth has relatively few impact craters. Many objects collide with the Moon or burn up in the atmosphere before hitting the ground. When impactors do reach Earth’s surface, our active planet slowly erases the evidence. Erosion, tectonic movement, and volcanic activity make ancient craters difficult to see.  Despite these factors, a few impact sites remain visible and accessible on Earth's surface. These examples help geologists interpret craters on the Moon, Mars, and beyond. Terrestrial planets begin as molten bodies and cool over time. As a planet loses heat, its surface changes shape. Hot material continues to move around in the planet’s interior, causing surface deformation. This is called tectonism. Tectonic activity is all around us. Mountains, faults, folds, fractures, and earthquakes teach us about Earth's past and present. Lunar experiments set up by Apollo astronauts show that the Moon is not only quaking, but shrinking. Marsquakes reveal the Red Planet’s internal structure to NASA's InSight lander. Each world provides clues about how objects in our solar system formed, how they cooled, and what might be happening inside.  Astrobiologists explore the forms that biology might take on other worlds. Our planet’s most extreme habitats are full of surprising examples to study. Deep in Earth's oceans, for instance, microbes thrive in very salty, high-pressure environments. These tough and tiny creatures show us what life could be like in salt-watery alien terrain. The search for extraterrestrial life requires both evidence and imagination. It’s difficult to predict what an encounter with life beyond Earth will be like. There is no guarantee that it will resemble anything humans have ever experienced. Will we know it when we see it? Will we find biosignatures in rocks, in an atmosphere if there is one, in liquid form? Could a close-up image provide proof? Will we need to examine the area in other ways? Is it possible to study alien biology while keeping it, and our own world, safe from harm? Earth's strangest ecosystems prepare us to ask the right questions when searching for life in other places. To learn more about astrobiology analogs, visit: https://astrobiology.nasa.gov/research-locations/   Before Apollo astronauts collected samples on the Moon, they practiced here on Earth. Today, teams test their plans and equipment in environments ranging from volcanic fields to the ocean floor. Future crews, too, will train on Earth for the challenges of space travel. This kind of preparation is called mission analog research. Analog missions allow us to try out equipment and procedures in rough, remote places without ever leaving our planet. Some teams spend up to three weeks at a time living and working deep undersea. Others take to the desert to try out new rovers and geological tools. These trials reveal strengths and weaknesses so that we can improve our systems. They also teach us how to manage human challenges like prolonged isolation. To learn more about mission analogs, visit: https://www.nasa.gov/analogs  In the field, everyone works together to achieve mission goals. Astronauts may try new exploration tools while geologists search for hints about our planet's past. Engineers can test their rovers against rough terrain and time delays. At the same time, astrobiologists might scour the rocks nearby for evidence of past and present life. By working as a team, we advance our knowledge of Earth and beyond. Analog studies have already changed the way we understand our place in space, and there are many discoveries left to make. Future scientists, engineers, and astronauts will have exciting questions to answer. To succeed, they'll need to learn all they can from each other and our home planet. Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: April 25, 2023", "url": "https://solarsystem.nasa.gov/planets/planetary-analogs", "threshold": 0.9999996519164347}