{"title": "Accessibility - Vox Media", "content": "        This site runs on Chorus, a modern publishing platform by Vox Media. If you have any trouble browsing the site or accessing the content, please email us at accessibility@voxmedia.com.               We’re committed to building a robust, inclusive, and accessible platform for all audiences. We strive to meet level AA standards from the Web Content Accessibility Guidelines (WCAG) 2.1.               Right now, our sites meet the majority of the standards and are substantially compliant with the AA standards. We’re working to bridge any remaining gaps by updating the platform and partnering with content creators to ensure stories are accessible. There’s more for us to do, and we’ll continue updating this page as we make improvements.               While each Chorus site looks visually different, our goal is to give everyone the same levels of access and ease of use.               Along with testing in modern browsers, we use VoiceOver in Chrome and Safari to review our sites.               In the near future, we will test any changes or improvements with NVDA and VoiceOver. We’re also developing a suite of automated accessibility tests to help us flag issues with our sites.               Here are a few things we’re hoping to update in the coming months:               Along with these improvements, we’re continuing to work with content creators to ensure that new stories are accessible to people with disabilities. This includes adding:               We’ll continue updating this page as we improve the platform. You can also follow along with our progress on the Vox Product blog.               If you have any feedback or questions about accessibility, we’d love to hear from you: accessibility@voxmedia.com. Please include details about the site you’re trying to access and the kind of assistive technology you’re using (e.g., VoiceOver on iOS).               Published: December 11, 2019        Last updated: December 11, 2019      ", "url": "https://www.voxmedia.com/legal/accessibility", "threshold": 0.7869691377663104}