{"title": "Ethics Statement - The Verge", "content": "Since it launched in 2011, The Verge has operated under a strict ethics policy that ensures our editorial independence and the integrity of our journalism. All of our editorial staff are required to abide by the following guidelines, many of which exceed standards in our industry. Earning and keeping the trust of our audience is, and always will be, at the core of The Verge’s mission. In a world where information is distributed across countless platforms and formats, it’s more important than ever to promote clear ethical guidelines that allow audiences to know where that information comes from and whether it can be trusted. As a part of Vox Media, The Verge also adheres to the Vox Media Editorial Ethics & Guidelines. Our most valuable asset is the independence that allows us to publish stories without fear. The Verge is routinely critical of people and companies we cover, and we’re most proud of our work when we tell stories that people in power would prefer not see the light of day. We are able to enjoy this independence because every member of our editorial team is required to follow a strict code of conduct. Additionally, we enforce a strict wall between The Verge’s editorial team and our parent company’s advertising teams (addressed more in detail below). Here are the core guidelines in our code of conduct: Our policy against receiving anything of value from companies we cover includes, but is not limited to, things like gifts, meals, discounted services, or paid trips and junkets. Vox Media and The Verge pay for all travel expenses to all events, including transportation, food, and hotels. In addition to standards that preserve our independence, The Verge’s reporters are expected to abide by industry-standard ethical guidelines for reporting. This means that our editorial team takes great care to learn the truth and report it, protect sources, minimize risk of harm, and strive for accuracy and honesty in everything we publish. We use the Society of Professional Journalists’ code of ethics as a baseline for the professional conduct of our editorial staff. The Verge maintains high standards for sourcing. Our reporters will always carefully explain our sourcing practices to you and strive to protect your confidentiality when appropriate. If you are a communications professional, or talking to us in your official capacity, we will abide by the following definitions. ON THE RECORD “On the record” is the default for talking to reporters and editors at The Verge. You say things, we record them, we can report who you are and quote what you said. We will expect corporate communications professionals and people speaking to us in an official capacity to be on the record in almost every single case, and you will have to tell us why you want to change this default every single time. ON BACKGROUND “On background” means you can talk to us and we will not specifically identify you, instead using a descriptor like “company spokesperson.” If you are a corporate communications professional speaking to us in your official capacity, we will not in any circumstances attribute you as “a source familiar.” Going “on background” is an agreement between you and the reporters or editors you speak to at The Verge. The general rules of an agreement apply: you may offer to go on background, and we will accept or deny your request. If we do not specifically accept, there is no agreement. This means: A reminder: you have to ask, and we have to agree. Every single time. OFF THE RECORD “Off the record” is simple: you talk to us, we agree not to use anything we hear in any of our reporting unless we can source it otherwise. Like background, off the record is an agreement. If we don’t agree, you are not off the record. We do not readily agree to off-the-record conversations with corporate communications professionals or people speaking in their official capacities without specific reasons. Vox Media employs a dedicated advertising team that is responsible for selling advertising space on our properties. Any feature on a Vox Media brand sponsored by a particular company or advertiser that is developed independently by the Vox Creative and Sales teams is clearly marked as \"Advertiser Content.\" Advertisements do not necessarily reflect the views of Vox Media or our editorial teams. Vox Creative and Sales teams have their own set of guidelines and policies for developing content and do not infringe on the creative agency of editorial teams. Our editorial teams do not directly accept money or other consideration from individuals or entities as a condition or incentive to write a review or story, whether favorable or unfavorable. However, some of our editorial content is made possible through the support of sponsors. This content is clearly marked as content \"Presented\" by the applicable sponsor. Our sponsors may select which content they wish to support, however, we do not allow our Sales teams, Vox Creative, or our sponsors to control or interfere with the editorial integrity of our editorial teams and the content they create. Some of our content may contain marketing links, which means we will receive a commission for purchases made via those links. In our editorial content, these affiliate links appear automatically, and our editorial teams are not influenced by our affiliate partnerships. Vox Media does employ a commerce team to optimize certain content for affiliate revenue, and such content is marked as such by including a similar affiliate links disclosure. We work with several providers (currently Skimlinks and Rakuten Marketing) to manage our affiliate relationships. You can find out more about their services by visiting their sites. The Verge is a multimedia brand that is distributed across many platforms, including our own site on the web, Facebook, Twitter, Instagram, and others. Our editorial standards apply to all of our platforms. Vox Creative does, on occasion, distribute sponsored editorial content and paid branded content through our distributed platforms. They are clearly labeled as \"Presented by\" (for editorial sponsorships) or \"Paid Content\" (for branded content) in the post and further labeled using platform-specific tools such as the Facebook handshake. Despite making every effort to be accurate in our reporting, sometimes we get something wrong. If we discover a mistake in a story, our editors will promptly issue a correction that removes the inaccurate information and adds a notice of correction that explains the error. In some cases, like if an inaccuracy is contained in a video, we may have to remove the original piece of content and replace it with a version in which the error is omitted. Sometimes more information about a story we’ve published becomes available that either continues the narrative or clarifies the original story, but it is not a correction. In these cases, we may add and / or change elements of the original story. These updates will be clearly noted at the bottom of the story, indicating the time of the change and a note describing what was changed. Additionally, we may remove content if we believe it infringes on the intellectual property rights of a third party, otherwise violates any third-party rights, or breaches any applicable law or regulation. These decisions are made in concert with Vox Media’s legal team. Advising our audience about the best way to spend their time and money is one of our most important responsibilities. Our reviews always contain the honest, independent assessments of our editorial team. Like everything else we publish, there are no paid-for reviews of any kind written by The Verge editorial team. Companies may loan products (like laptops and smartphones) to our editors for a limited period of time so we can evaluate them and determine whether to review them. Occasionally, we will keep a review unit for an extended period of time to fully evaluate it and its software updates over time. We may also agree to an \"embargo\" with a company or PR firm that allows us to evaluate their product prior to its release. We do not invest in companies we cover, and employees are forbidden from trading or buying stock in companies we cover or companies in the general technology sector. Vox Media’s retirement savings programs may hold some of these restricted stocks, but these funds are not managed directly by employees. Additionally, our employees are forbidden from owning or trading in cryptocurrencies like bitcoin. Employees of The Verge may not be otherwise employed by or receive compensation from companies that they are likely to cover, nor are they permitted to have any advisory role (paid or unpaid) at those companies. In general, writers and editors of The Verge are not allowed to conduct journalism for other publications without the express permission of the editor-in-chief. From time to time, The Verge or Vox Media will conduct contests and giveaways for our audiences. We will post rules for each contest and giveaway, which will be binding to individuals who decide to participate. While giveaways or contests may be sponsored by an advertiser or partner, they are not and should never be considered endorsements of the entities involved or their products. Vox Media has a number of investors, including, but not limited to, Accel Partners, Khosla Ventures, General Atlantic, Comcast Ventures, and NBCUniversal. A full list of our investors can be found here. When our content touches on investor products, services our investors provide, compete with, or invest in, our content is created with total editorial independence from these investors. None of our investors have influence on the content we publish or access to our editorial and publication process unless we have an agreement with an investor that specifically contemplates a content creation partnership. If such a partnership exists, then this would be clearly disclosed to the Vox Media audience. We will also remind audiences of our relationship with major investors when we write directly about the business or other activities of such investors. From time to time, Vox Media’s Partnerships team engages with other businesses, brands, and organizations whose activities resonate with the company as a whole, or with one or more of our editorial teams. These partnerships do not impact the content that our editorial teams independently publish. Our Partnerships team, however, may create content as part of these partnerships, and we may publish this content on our editorial sites. In these cases, we will include a disclosure to describe the nature of the relationship between our editorial brand(s) and the partner(s) and the extent to which our editorial teams were involved in the creation of the content We’re always interested in hearing from you if you have a concern about our ethical standards. If you see something that doesn’t look right on The Verge, please let us know.  The Verge is a vox media network © 2023 Vox Media, LLC. All Rights Reserved", "url": "https://www.theverge.com/ethics-statement", "threshold": 0.6344030683646591}