{"title": "Whales are dying, but it’s not because of wind farms - The Verge", "content": "By  Justine Calma, a science reporter covering the environment, climate, and energy with a decade of experience. She is also the host of the Hell or High Water podcast. Beaches have become makeshift necropsy labs along the shores of New York and New Jersey. An alarming number of whales are washing up along the east coast of the US. And when they do, a team of researchers arrives at the scene to hunt for clues pointing to a cause of death.  They start by examining the outside of the body. Are there teeth marks from an attack? Or are there telltale signs of an accident with a ship: gashes from propellers, rust that has rubbed off from the vessel, broken bones or flesh that’s been pushed in from the impact? “I can certainly tell you from my experience, I’ve seen a lot of ship-struck whales,” says Joy Reidenberg, who’s typically on call for such investigations. “I’ve seen a lot of ship-struck whales” The victims have become posthumous poster children for opponents of offshore wind energy — despite a lack of any evidence that wind farms are to blame. That distracts from very real risks shipping vessels pose to whales navigating US shorelines, experts say. More than 30 dead whales have washed ashore on the east coast since December 31st, many of them in New Jersey and New York. It can be incredibly difficult to figure out a cause of death — a grim task scientists often volunteer to help out with on their own time. And while they’re not always able to find the answers they’re looking for, what they see time and again is evidence of run-ins with ships. “The data seems to be pointing overwhelmingly to ship strikes,” says Reidenberg, a comparative anatomist at the Icahn School of Medicine whose research focuses on marine mammals.  Reidenberg volunteers for New York’s Atlantic Marine Conservation Society and New Jersey’s Marine Mammal Stranding Center, organizations authorized to respond to stranded whales. When there’s been a whale death, she’ll get a call from one of the organizations asking her to join the mostly volunteer team dispatched to perform a necropsy.  “My job is usually to be a cutter, which means that I have the big knives and I cut the animal open,” she tells The Verge. “That usually goes to someone who’s had a lot of experience … and knows their way around the anatomy, which can be very disorienting when you’re basically standing in the middle of the animal trying to dissect it.”  A team of 12 or more people might spend up to 12 hours doing all this grueling work at the beach — and that’s a short day, according to Robert DiGiovanni, chief scientist at Atlantic Marine Conservation Society. Ultimately, DiGiovanni’s organization combines two assessments — one from the necropsy team at the beach and another from a pathologist studying tissue samples — to write up a report on what might have led to the animal’s death. Even after all that, it can be very difficult to determine what happened to the whale. Most whales initially sink when they die. They’ll float to the surface once they start to decompose, filling the body with gas. By the time they reach shore, they’re often in gruesome shape. Sometimes the carcass is too decomposed for a full necropsy, or it’s spotted floating but never drifts ashore for scientists to examine.  Nevertheless, the Atlantic Marine Conservation Society and similar organizations in other states send their findings to the National Oceanic and Atmospheric Administration (NOAA), which tracks what’s going on nationally. Most of those that have washed up recently are humpback whales. Their haunting songs, released on an iconic 1970 album during the same year as the very first Earth Day, became a soundtrack for the early environmental movement and “save the whales” campaigns.  Since 2016, so many humpbacks have died that NOAA declared an “unusual mortality event” (UME) along the Atlantic coast. There have been 191 humpback whale beachings since then; all but 10 of them died, and the UME still hasn’t ended.  Only 91 of the whales were able to be examined, and the cause of death for 44 of those came up as “undetermined.” But the most common threat by far is vessel strike, suspected in the deaths of 32 whales. Next on the list is suspected entanglement with fishing gear, affecting nine whales. That’s according to preliminary data NOAA shared with The Verge, with the caveat that some cases are still pending test results to determine whether the whale was struck before or after it died.  There’s been another unusual mortality event since 2017 for the North Atlantic right whale, one of the most endangered species of large whale in the world. There have been 36 right whale deaths documented since then. That’s especially alarming given how few right whales are believed to be left — fewer than 350, according to NOAA. Officials track their deaths more closely because of that endangered status.  The leading cause of death nationally for right whales has been vessel strike, accounting for 12 of 23 cases for which a necropsy was able to determine a cause of death. And of the two deaths documented so far in 2023, the causes have been vessel strike or perinatal mortality (meaning a fetus died). Zooming in on New Jersey, which has had more whale strandings or beachings than any other state since December, four of five complete necropsies performed on all whales similarly found evidence of a vessel strike. Vessel strikes and entanglement are also the leading factors contributing to whale deaths in New York, according to DiGiovanni.  A perfect storm of factors has made collisions with ships more likely. To start, more whales have been spotted close to shore. Research suggests that they’re following their food, a bony fish called menhaden that have become more prevalent in the New York Bight that stretches from New Jersey to New York City and Long Island. Conservation efforts and climate change both could have made these waters more attractive — they’re both cleaner and warmer than they’ve been in the past.  But then, in 2017, the Bayonne Bridge was raised by 64 feet to allow through modern, massive container ships. The US Army Corps of Engineers also deepened the navigational channels around the Port of New York and New Jersey to let them in.  Before then, the number of different container ships to visit the port was just 99 in total in 2016. And none of them were the super-size vessels of today that can carry more than 9,000 TEUs (standard-sized shipping containers). By 2021, the total number of container ships had grown to 550, according to the Port of New York and New Jersey. And 28 percent of those ships were large enough to carry more than 9,000 TEUs. That’s on top of the buzz of cruise ships, ferries, and other ship traffic in the area. The Port of New York and New Jersey is now the busiest in the US, handling more cargo than any other port. It’s a seismic shift that’s taken place since the pandemic simultaneously snarled supply chains and fueled a boom in online shopping.  Americans started buying more consumer goods for home improvement projects and new hobbies, and more of that stuff started making its way east instead of landing on the west coast. The amount of imported furniture the Port of New York and New Jersey brought in between 2019 and 2022 jumped from 449,266 to 598,739 TEUs (standard-sized shipping containers) — a roughly 33 percent increase. California’s Port of Los Angeles and Long Beach held the top spot in the nation for years, mostly because it’s much closer to Asia. A cargo ship could sail from China to the west coast in nine days, compared to a 30-day trip to the east coast. Then, during the covid pandemic, ships started piling up at California ports, at times waiting more than two weeks to unload their cargo. Suddenly, it became faster to bring goods into the country through the Port of New York and New Jersey.  Larger vessels can lug around more stuff and make fewer trips. So the number of visits that ships make to the Port of New York and New Jersey hasn’t grown as much as the amount of cargo flowing into the port. The biggest issue for the whales is the sheer size of the ships.  From his Staten Island apartment, Paul Sieswerda can see them from his window — although he’s hoping to spot whales. “The container ships are just amazingly large,” Sieswerda says. “It’s unfortunate, but our observations are that the whales are kind of oblivious to all this. You know, we see them feeding … the analogy of deer on the highway is kind of fitting,” he says.  Sieswerda is the executive director of Gotham Whale, a nonprofit whale research organization that keeps a database of marine mammal sightings around the New York Bight (Reidenberg is also a scientific adviser for Gotham Whale). They see a lot of whales with what look like scars from boat propellers. “Our favorite whale Jerry has a long line of propeller marks on his right flank,” Sieswerda says, which shows that Jerry has survived a run-in with a smaller vessel. “If he was ever hit by one of the bigger vessels, it would kill him,” he says. When it comes to risks posed by offshore wind, Sieswerda says, “I, as yet, have not seen the concerns backed up with evidence.” The Marine Mammal Commission, an independent government agency, also said that “there is no evidence to link these strandings to offshore wind energy development.” Even so, Republican lawmakers in New Jersey held a two-hour-long hearing last week calling for a moratorium on offshore wind construction because of the whale strandings. “One thing our side of the aisle gets accused of is not following the science,” Republican state Senator Michael Testa said. “So what is the harm of waiting 30 or 60 days?” Seismic surveys have just begun to map out future wind farm sites, which is what offshore wind opponents say poses a risk to whales. Marine mammals that use echolocation to navigate might be disoriented by unnatural sounds. But Reidenberg, the comparative anatomist, doesn’t expect that to be a problem for humpback or right whales for one simple reason.  “The whales that are washing in are not echolocators. So that’s where a half-truth really unfairly biases the public against something,” she says. A seismic survey for offshore wind development is much quieter than surveys for offshore oil and gas drilling since the sonar doesn’t have to travel as deep into the seafloor. The US has no commercial-scale offshore wind farms yet, something the Biden administration wants to change as part of its transition to clean energy. It set a goal of generating 30 GW of electricity from offshore wind by 2030, about as much capacity as Europe already has today. NOAA says on its website that “there is no evidence that noise resulting from wind development-related site characterization surveys could potentially cause mortality of whales, and no specific links between recent large whale mortalities and currently ongoing surveys.” To protect whales, action needs to be based on data, researchers tell The Verge. There’s enough evidence to show that big shipping containers pose risks, but there are also measures that can minimize that risk.  The speed of a vessel can make a big difference in how much reaction time there is to avoid a collision with a whale. So NOAA proposed an updated speed limit last year to protect North Atlantic right whales. Even so, the speed restrictions primarily target areas where critically endangered right whales hang out, not humpbacks. The Port of New York and New Jersey, for its part, has a program to offer financial incentives to ships that voluntarily slow down to 10 knots or less as they get closer to shore.  Democratic lawmakers have also pressed NOAA to share data on necropsy results more quickly and to determine what kinds of resources it needs to take more action on the unusual mortality events. DiGiovanni, whose organization responds to strandings in New York state, says he’d ideally want to have the resources to send teams twice as big as he has in the past to perform necropsies.  Of course, he says, “I would like to not have to go through this at all.”  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2023 Vox Media, LLC. All Rights Reserved", "url": "https://www.theverge.com/2023/5/11/23718523/whale-beachings-east-coast-offshore-wind-shipping", "threshold": 0.9998379861810667}