{"title": "What two-thirds of car dealerships are missing in the US - The Verge", "content": "By  Justine Calma, a science reporter covering the environment, climate, and energy with a decade of experience. She is also the host of the Hell or High Water podcast. Electric vehicles just aren’t easy to find in American car dealerships, a survey by the environmental group Sierra Club confirms. Two-thirds of car dealerships surveyed across the US didn’t have a single battery electric vehicle or plug-in hybrid for sale. That doesn’t line up with the Biden administration’s climate goals, which depend on consumers switching from gas-guzzling cars to electric vehicles to slash tailpipe emissions. The Environmental Protection Agency (EPA) proposed aggressive new emissions standards last month that are supposed to boost electric vehicle sales to more than two-thirds of all car sales by 2032.  The survey exposes the challenges that might keep more customers in the US from making the switch to electric The survey exposes the challenges that might keep more customers in the US from making the switch to electric the next time they find themselves at a dealership — from supply chain problems to limited options when it comes to the types of cars on the market. Staff and volunteers with the Sierra Club called or visited 801 randomly selected dealerships across the US in 2022 to complete the survey. It excludes companies like Tesla that sell vehicles directly to customers without its own network of independent dealerships. Sierra Club asked dealerships whether they had any EVs or hybrids for sale. And if not, would they want to sell them, barring any inventory issues? Turns out, just 34 percent of dealerships had at least one EV for sale. The other two-thirds of dealerships did not. “We have big plans to sell EVs, but we just can’t get any,” a Chevrolet, Buick, and Cadillac dealership in Maryland responded. Inventory issues were the biggest stumbling block across the nation, the survey found. Surprisingly, only 27 percent of dealerships on the West Coast of the US had EVs available — less than any other region. But since more electric vehicles are sold on the West Coast than anywhere else, the dearth of EVs for sale in California, Washington state, and Oregon probably points to high sales turnover.  One Nissan dealer in Washington noted that it only sold around 1,700 of the automaker’s electric Leaf hatchbacks over the past 10 years — but now, they struggle to keep them in stock. “Right now they cannot get more than one at a time and it is sold immediately,” the dealer said. Nissan is reportedly planning to discontinue production of the Leaf, one of the first mid-price options available that introduced early adopters to EVs, while also rolling out a new lineup of next-generation EVs.  While overall EV inventory was low, the survey found some luxury vehicles were in greater supply than more affordable alternatives. Mercedes-Benz dealerships had the most electric vehicles on hand, with EVs available at 90 percent of locations surveyed. Toyota and Honda were at the other end of the spectrum, with EVs for sale at just 15 and 11 percent of dealerships, respectively. (Both automakers have been slow to roll out their next-gen EVs.) “The ultimate conclusion is that automakers must invest more in EV production to match consumer demand,” the report says. That’s easier said than done, of course, with a global semiconductor shortage and the covid pandemic absolutely mangling supply chains over the past few years. President Joe Biden signed into law an updated electric vehicle tax credit with the Inflation Reduction Act, but it’s riddled with stipulations about where the car and all its parts were made.   Of the 66 percent of dealerships nationwide without any EVs for sale, a whopping 45 percent of them reported that they “would not offer an EV for sale regardless of automaker allocation and supply chain constraints.”  Some of the reasons why go back to logistical headaches. “We need to install chargers first before the automaker can send us EVs to sell,” a Chevrolet dealership in Wyoming said in the survey. But Wyoming also happens to be one of the states where Republican lawmakers are trying to ban EV sales.  If that sentiment gains steam, it’s very bad news for the climate. Transportation makes up more than a quarter of US greenhouse gas emissions, the biggest chunk of its carbon footprint.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2023 Vox Media, LLC. All Rights Reserved", "url": "https://www.theverge.com/2023/5/12/23721484/electric-vehicles-ev-car-dealerships-united-states-sierra-club-survey", "threshold": -0.9921958870453658}