{"title": "Funding down and valuations flat in Q1 for European startups", "content": "We are officially 80% SOLD OUT! Secure your ticket today 🎟️ →                                             Thomas is a senior reporter at TNW. He covers European tech, with a focus on deeptech, startups, and government policy.                                                                                                                                Thomas is a senior reporter at TNW. He covers European tech, with a focus on deeptech, startups, and government policy.                                         It’s been a rough start to 2023 for European startups. In the first quarter of the year, dealmaking decelerated, valuations flattened, and exits remained subdued, according to new research. Analysts from PitchBook, a financial data firm, found that investor priorities have shifted from growth at all costs to profitability. After a boom in VC activity that trickled into early 2022, reports of lower growth rates, workforce reductions, and tougher funding conditions have emerged. As a result, due diligence processes have lengthened, with revenues, valuations, and runways under heightened scrutiny. Nalin Patel, the report’s author, noted that investors across the board have become more selective. “We are seeing declines across financing stages, sectors, and geographies,” Patel told TNW. Tickets are officially 80% sold out Don't miss your chance to be part of Europe's leading tech event Rays of hope were hard to find in the report, but a few shone through the gloom. Angel valuations were robust, with the median pacing at €3.7 million—above the €3m figure registered in 2022. Early adoption may be tougher for startups in the current climate, but Pitchbook expects less mature companies to be protected from the turbulence affecting companies with high costs. Indeed, current market conditions could force investors to focus on ideas with the potential for long-term success. Consequently, Patel believes that seed and early-stage companies in long-term industries such as clean energy could remain appealing investments. Overall, however, the financial landscape remains treacherous. “Companies are not growing at the same rate during the past few years, and valuations are cooling across the market,” said Patel. “We expect more colour on valuations to emerge as funding needs persist this year.” Get the TNW newsletter Get the most important tech news in your inbox each week. When will AGI arrive? Here’s what our tech lords predict What app developers actually think about the EU vs Apple debate on third-party app stores We’re closer than ever before to creating a real lightsaber From Michelangelo to robots: This startup is carving a new era of sculpture German chip plant breaks ground in ‘major step forward’ for EU’s semiconductor industry The heart of tech                     Copyright © 2006—2023, The Next Web B.V.                    Made with <3 in Amsterdam.                    ", "url": "https://thenextweb.com/news/european-startups-funding-down-exits-muted-valuations-flat", "threshold": 0.7440483170845051}