{"title": "Data Catalog", "content": "With 189 member countries, staff from more than 170 countries, and offices in over 130 locations, the World Bank Group is a unique global partnership: five institutions working for sustainable solutions that reduce poverty and build shared prosperity in developing countries.   The World Bank Group works in every major area of development.  We provide a wide array of financial products and technical assistance, and we help countries share and apply innovative knowledge and solutions to the challenges they face. We face big challenges to help the world’s poorest people and ensure that everyone sees benefits from economic growth. Data and research help us understand these challenges and set priorities, share knowledge of what works, and measure progress. As the world’s largest multilateral source of financing for water in developing countries, the World Bank Group is committed to innovative, inclusive, and sustainable water action as we work together with our partners towards a water-secure world. In his speech, “Growth and Stability During Crises,” World Bank Group President David Malpass will discuss the challenges facing development policy, including the need for macroeconomic stability, the importance of private capital to international integration, and the increasing need to support global public goods. The live-streamed speech, taking place Thursday, March 30th at 9:30am EDT, will be hosted by the Abdou Moumouni University of Niamey, Niger. Our latest update from March 23 shows that domestic food price inflation remains high in almost all low-, middle-, and high-income countries. Since the last update on March 9, 2023, the agricultural, cereal, and export price indices closed 3 percent, 2 percent, and 2 percent lower, respectively. The global economy’s “speed limit”—the maximum long-term rate at which it can grow without sparking inflation—is set to slump to a three-decade low by 2030. A World Bank report—Falling Long-Term Growth Prospects: Trends, Expectations, and Policies—shows that an ambitious policy push can boost productivity, ramp up investment, and harness the potential of the services sector. The World Bank has two goals: end extreme poverty and promote shared prosperity in a sustainable way.                                 Food security is defined when all people, at all times, have physical and economic access to sufficient safe and nutritious food that meets their dietary needs and food preferences for an active and healthy life.                                                              Climate change, poverty, and inequality are the defining issues of our age. The World Bank Group is the biggest multilateral funder of climate investments in developing countries.                                                             IDA is the part of the World Bank that helps the world’s poorest countries.                                                             The Open Data site is designed to make World Bank data easy to find, download, and use. All of the data found here can be used free of charge with minimal restrictions.                             In 2022, the global average score on the World Bank’s Women, Business and the Law index rose just half a point to 77.1—indicating women, on average, enjoy barely 77 percent of the legal rights that men do. At the current pace of reform, in many countries a woman entering the workforce today will retire before she will be able to gain the same rights as men, the report notes. This year, 18 countries enacted 34 reforms, the lowest number of reforms in 20 years. But more than half of all reforms captured were implemented in the Sub-Saharan Africa region by seven economies. Learn More. Globally, roughly half of working age women participate in the labor force, which is significantly lower than the male labor force participation rate of around 80%.  This gap is virtually unchanged from what it was three decades ago. And there are sizeable differences in the level of female labor force participation across regions. Moreover, women tend to face inferior income opportunities and on average earn less than men. Explore more aspects of female labor force participation through this data story.   According to the latest statistics (see below), more than one in five women were first married before the age of 18, with the practice of child marriage being most prevalent in Sub-Saharan Africa and South Asia. Beyond being a human rights violation, child marriage also greatly undermines women’s and girls’ economic opportunities. It limits child brides’ access to education, reduces their future earnings, jeopardizes their health, and puts them at a heightened risk of domestic violence. Data on the economic impacts of child marriage provide the foundation for advocacy campaigns to end the practice. Learn more. Access the World Bank's portfolio of more than 12,000 development projects, including current and historical data since 1947. Access more than 200,000 publicly-available documents and reports. Seismic Risk Ending Learning Poverty and Building Skills Ending Learning Poverty: What Will It Take? What the Future Has in Store : A New Paradigm for Water Storage We help developing countries find solutions to the toughest global and local development challenges—from adapting to climate change to boosting food security to increasing access to energy. This site uses cookies to optimize functionality and give you the best possible experience. If you continue to navigate this website beyond this page, cookies will be placed on your browser. To learn more about cookies, click here.  Browse byCountryorIndicator WHAT YOU CAN LEARN WITH OPEN DATA The proportion of the world’s population living in extreme poverty has dropped significantly Over 3 billion people cannot afford a healthy diet and most live in lower-middle-income countries. Feb 15, 2022 Provides a listing of available World Bank datasets, including databases, pre-formatted tables, reports, and other resources. An analysis and visualisation tool that contains collections of time series data on a variety of topics. Provides access to data collected through sample surveys of households, business establishments or other facilities. Guides readers through the Sustainable Development Goals using interactive storytelling and innovative data visualizations. Provides access to comprehensive annual statistics on external debt stocks and flows for 120 developing countries. Explore purchasing power parities (PPPs), price levels, economic data and the methodology behind the world's largest statistical partnership. The primary World Bank collection of development indicators, compiled from officially-recognized international sources. Explore raw data about the World Bank Group’s finances, including disbursements and management of global funds. Provides access to basic information on all of the World Bank's lending projects from 1947 to the present. Provides an understanding of Open Data and how to get \"up to speed\" in planning and implementing an open data program. Supports countries in conducting multi-topic household surveys to generate high-quality data, improve survey methods and build capacity. A one-stop source of data on household consumption patterns in developing countries. This site uses cookies to optimize functionality and give you the best possible experience. If you continue to navigate this website beyond this page, cookies will be placed on your browser. To learn more about cookies,  click here. Browse byCountryorIndicator This site uses cookies to optimize functionality and give you the best possible experience. If you continue to navigate this website beyond this page, cookies will be placed on your browser. To learn more about cookies,  click here. Navegar porPaísoIndicador Naviguer parPaysouIndicateur تصفح حسبالدولةأوالمؤشر 浏览国家或指标 Browse byCountryorIndicator This site uses cookies to optimize functionality and give you the best possible experience. If you continue to navigate this website beyond this page, cookies will be placed on your browser. To learn more about cookies,  click here. Browse byCountryorIndicator This site uses cookies to optimize functionality and give you the best possible experience. If you continue to navigate this website beyond this page, cookies will be placed on your browser. To learn more about cookies,  click here. Browse byCountryorIndicator WHAT YOU CAN LEARN WITH OPEN DATA The proportion of the world’s population living in extreme poverty has dropped significantly Over 3 billion people cannot afford a healthy diet and most live in lower-middle-income countries. Feb 15, 2022 Provides a listing of available World Bank datasets, including databases, pre-formatted tables, reports, and other resources. An analysis and visualisation tool that contains collections of time series data on a variety of topics. Provides access to data collected through sample surveys of households, business establishments or other facilities. Guides readers through the Sustainable Development Goals using interactive storytelling and innovative data visualizations. Provides access to comprehensive annual statistics on external debt stocks and flows for 120 developing countries. Explore purchasing power parities (PPPs), price levels, economic data and the methodology behind the world's largest statistical partnership. The primary World Bank collection of development indicators, compiled from officially-recognized international sources. Explore raw data about the World Bank Group’s finances, including disbursements and management of global funds. Provides access to basic information on all of the World Bank's lending projects from 1947 to the present. Provides an understanding of Open Data and how to get \"up to speed\" in planning and implementing an open data program. Supports countries in conducting multi-topic household surveys to generate high-quality data, improve survey methods and build capacity. A one-stop source of data on household consumption patterns in developing countries. This site uses cookies to optimize functionality and give you the best possible experience. If you continue to navigate this website beyond this page, cookies will be placed on your browser. To learn more about cookies,  click here. Help us improve this section of the site. Can we get your feedback?                                 Click here  DataBank is an analysis and visualisation tool that contains collections of time series data on a variety of topics. You can create your own queries; generate tables, charts, and maps; and easily save, embed, and share them. Enjoy using DataBank and let us know what you think! World Development Indicators (WDI) is the primary World Bank collection of development indicators, compiled from officially recognized international sources. It presents the most current and accurate global development data available, and includes national, regional and global estimates. [Note: Even though Global Development Finance (GDF) is no longer listed in the WDI database name, all external debt and financial flows data continue to be included in WDI. The GDF publication has been renamed International Debt Statistics (IDS), and has its own separate database, as well.                                      ,External Debt and Financial Flows statistics, Heath statistics, Gender, Economy, Social Data,  ,External Debt and Financial Flows statistics, Heath statistics, Gender, Economy, Social Data, Statistical Capacity Indicators provides information on various aspects of national statistical systems of developing countries, including an overall country-level statistical capacity indicator.                                      ,  , The World Bank EdStats Query holds around 2,500 internationally comparable education indicators for access, progression, completion, literacy, teachers, population, and expenditures. The indicators cover the education cycle from pre-primary to tertiary education. The query also holds learning outcome data from international learning assessments (PISA, TIMSS, etc.), equity data from household surveys, and projection data to 2050.                                      ,Education,  ,Education, Data on key gender topics. Themes included are demographics, education, health, labor force, and political participation.                                      ,Education, Demographics, Health, Labor Force, Political Participation,  ,Education, Demographics, Health, Labor Force, Political Participation, Key health, nutrition and population statistics gathered from a variety of international sources.                                      ,Population dynamics, Nutrition, Health financing, Medical resource and usage, Immunization, Infectious diseases, HIV/AIDS, DALY, Population Projection and lending, Health financing, Medical resource and usage, Reproductive Health,  ,Population dynamics, Nutrition, Health financing, Medical resource and usage, Immunization, Infectious diseases, HIV/AIDS, DALY, Population Projection and lending, Health financing, Medical resource and usage, Reproductive Health, Search, browse and export metadata using our API Find answers to common questions Find out how you can use microdata View more » Formulation of microdata dissemination policies and protocols Formulation of microdata dissemination policies and protocols Principles and standards of good practice as applied to data preservation.                                         ©                                         The World Bank Group, All Rights Reserved.                                     This site uses cookies to optimize functionality and give you the best possible experience. If you continue to navigate this website beyond this page, cookies will be placed on your browser. To learn more about cookies, click here. The Data Catalog is designed to make World Bank's development data easy to find, download, use, and share. It includes data from the World Bank's microdata, finances and energy data platforms, as well as datasets from the open data catalog… Read more The World Development Report 2022: Finance for an Equitable Recovery examines the central role of finance in the economic recovery from the COVID-19 pandemic. In doing so, it looks into the consequences of the crisis most likely... National statistical systems are facing significant challenges. These challenges arise from increasing demands for high quality and trustworthy data to guide decision making, coupled with the rapidly changing landscape of the data revolution. The primary World Bank collection of development indicators, compiled from officially-recognized international sources. It presents the most current and accurate global development data available, and includes national, regional and global estimat. Data relevant to the coronavirus pandemic, drawn from the World Bank’s data catalog and other authoritative sources. World Bank-approved administrative boundaries (Admin 0) (and polygons) including international boundaries, disputed areas, coastlines, lakes and a guide to help with their usage. Catalogue lists all the data produced under the partnership contracts between the World Bank Group and the European Space Agency Browse byCountryorIndicator This site uses cookies to optimize functionality and give you the best possible experience. If you continue to navigate this website beyond this page, cookies will be placed on your browser. To learn more about cookies,  click here. Navegar porPaísoIndicador Naviguer parPaysouIndicateur تصفح حسبالدولةأوالمؤشر 浏览国家或指标 Search, browse and export metadata using our API Find answers to common questions Find out how you can use microdata View more » Formulation of microdata dissemination policies and protocols Formulation of microdata dissemination policies and protocols Principles and standards of good practice as applied to data preservation.                                         ©                                         The World Bank Group, All Rights Reserved.                                     This site uses cookies to optimize functionality and give you the best possible experience. If you continue to navigate this website beyond this page, cookies will be placed on your browser. To learn more about cookies, click here. The Data Catalog is designed to make World Bank's development data easy to find, download, use, and share. It includes data from the World Bank's microdata, finances and energy data platforms, as well as datasets from the open data catalog… Read more The World Development Report 2022: Finance for an Equitable Recovery examines the central role of finance in the economic recovery from the COVID-19 pandemic. In doing so, it looks into the consequences of the crisis most likely... National statistical systems are facing significant challenges. These challenges arise from increasing demands for high quality and trustworthy data to guide decision making, coupled with the rapidly changing landscape of the data revolution. The primary World Bank collection of development indicators, compiled from officially-recognized international sources. It presents the most current and accurate global development data available, and includes national, regional and global estimat. Data relevant to the coronavirus pandemic, drawn from the World Bank’s data catalog and other authoritative sources. World Bank-approved administrative boundaries (Admin 0) (and polygons) including international boundaries, disputed areas, coastlines, lakes and a guide to help with their usage. Catalogue lists all the data produced under the partnership contracts between the World Bank Group and the European Space Agency", "url": "http://datacatalog.worldbank.org"}