{"title": "BigQuery Enterprise Data Warehouse  |  Google Cloud", "content": "BigQuery is a serverless and cost-effective enterprise                      data warehouse that works across clouds and scales with                      your data. Use built-in ML/AI and BI for insights at                      scale.  New customers get                      $300 in free credits                      to spend on BigQuery. All customers get 10 GB storage and up to 1 TB queries                      free per month. Access and analyze data across clouds Built-in machine learning for all data types using simple SQL Real-time analytics with streaming and built-in BI Learn BigQuery in a minute 1-minute video Features VIDEO 15:10 VIDEO 1:40 VIDEO 15:53 VIDEO 7:54 VIDEO 14:40 How It Works  Demo:                            Solving business challenges with an end-to-end                            analysis in BigQuery  Common Uses  Make analytics easier by                              bringing together data from multiple sources into                              BigQuery. You can upload data files from local                              sources, Google Drive, or Cloud Storage buckets,                              use BigQuery Data Transfer Service (DTS), Cloud                              Data Fusion plugins, replicate data from                              relational databases with Datastream for BigQuery,                              or leverage Google's industry-leading data                              integration partnerships.   Solve for today’s analytics                              demands and seamlessly scale your business by                              moving to Google Cloud’s enterprise data                              warehouse. Streamline your migration path from                              Netezza, Oracle, Redshift, Teradata, or Snowflake                              to BigQuery using the free and fully managed                              BigQuery Migration Service.   Gain a competitive advantage by                              responding to business events in real time with                              event-driven analysis. Built-in streaming                              capabilities automatically ingest streaming data                              and make it immediately available to query. This                              allows you to stay agile and make business                              decisions based on the freshest data. Or use                              Dataflow to enable fast, simplified streaming data                              pipelines for a comprehensive solution.   Predictive analytics can be                              used to streamline operations, boost revenue, and                              mitigate risk. BigQuery ML democratizes the use of                              ML by empowering data analysts users to build and                              run models using existing business intelligence                              tools and spreadsheets. Predictive analytics can                              guide business decision-making across the                              organization.   Analyze and gain deeper insights                          into your logging data with BigQuery. You can store,                          explore, and run queries on generated data from                          servers, sensors, and other devices simply using                          GoogleSQL. Additionally, you can analyze log data                          alongside the rest of your business data for broader                          analysis all natively within BigQuery.   Marketing data warehouses let                              you deliver timely, targeted, and tailored                              advertising experiences that increase marketing                              performance. BigQuery offers seamless data                              connectors into Google Ads, Campaign Manager, and                              other marketing platforms for a holistic view of                              your business. Build advanced marketing audiences                              with Google Analytics and BigQuery's built-in ML                              to drive higher ROI.  Pricing How                      BigQuery pricing works BigQuery pricing is                      based on compute (analysis), storage, additional services,                      and data ingestion and extraction. Loading and exporting                      data are free. The                        BigQuery free tier                        gives customers 10 GB storage, up to 1 TB queries free                        per month, and other resources. Free On-demand Generally gives you access to up to 2,000 concurrent                        slots, shared among all queries in a single                        project.  Starting at $5.00 First 1TB per month is free Standard edition Low-cost option for standard SQL analysis  $0.04  per slot hour Enterprise edition Supports advanced enterprise analytics $0.06 per slot hour Enterprise Plus edition Supports mission-critical enterprise analytics $0.10 per slot hour Flex short-term commitment Pay for slots for 60 seconds, and each second                        thereafter until you delete or change your commitment.                       Starting at $0.04 per slot hour Monthly flat-rate commitment Best for customers who prefer a stable cost for queries                        rather than paying on-demand. Starting at $2,000 for 100 slots per month Annual flat-rate commitment Best for stable cost for queries rather than paying                        on-demand. Save more with an annual commitment. Starting at $1,700 for 100 slots per month Active local storage Based on the uncompressed bytes used in tables or table                        partitions modified in the last 90 days.  Starting at $0.02 Per GB. The first 10 GB is free                      each month. Long-term logical storage Based on the uncompressed bytes used in tables or table                        partitions modified for 90 consecutive days.  Starting at $0.01 Per GB. The first 10 GB is free                      each month. Active physical storage Based on the compressed bytes used in tables or table                        partitions modified for 90 consecutive days. Starting at $0.04  Per GB. The first 10 GB is free                      each month. Long-term physical storage Based on compressed bytes in tables or partitions that                        have not been modified for 90 consecutive                        days. Starting at $0.02 Per GB. The first 10 GB is free                      each month. Batch loading  Export table data to Cloud Storage. Free When using the shared slot pool                     Streaming inserts You are charged for rows that are successfully                        inserted. Individual rows are calculated using a 1 KB                        minimum. $0.01 per 200 MB BigQuery Storage Write API Data loaded into BigQuery, is subject to                        BigQuery storage pricing                        or                        Cloud Storage pricing.                       $0.025 per 1 GB. The first 2 TB per month                      are free. Batch export Export table data to Cloud Storage. Free When using the shared slot pool                     Streaming reads Use the storage Read API to perform streaming reads of                        table data. Starting at $1.10 per TB read The                        BigQuery free tier                        gives customers 10 GB storage, up to 1 TB queries free                        per month, and other resources. Free On-demand Generally gives you access to up to 2,000 concurrent                        slots, shared among all queries in a single                        project.  Starting at $5.00 First 1TB per month is free Standard edition Low-cost option for standard SQL analysis  $0.04  per slot hour Enterprise edition Supports advanced enterprise analytics $0.06 per slot hour Enterprise Plus edition Supports mission-critical enterprise analytics $0.10 per slot hour Flex short-term commitment Pay for slots for 60 seconds, and each second                        thereafter until you delete or change your commitment.                       Starting at $0.04 per slot hour Monthly flat-rate commitment Best for customers who prefer a stable cost for queries                        rather than paying on-demand. Starting at $2,000 for 100 slots per month Annual flat-rate commitment Best for stable cost for queries rather than paying                        on-demand. Save more with an annual commitment. Starting at $1,700 for 100 slots per month Active local storage Based on the uncompressed bytes used in tables or table                        partitions modified in the last 90 days.  Starting at $0.02 Per GB. The first 10 GB is free                      each month. Long-term logical storage Based on the uncompressed bytes used in tables or table                        partitions modified for 90 consecutive days.  Starting at $0.01 Per GB. The first 10 GB is free                      each month. Active physical storage Based on the compressed bytes used in tables or table                        partitions modified for 90 consecutive days. Starting at $0.04  Per GB. The first 10 GB is free                      each month. Long-term physical storage Based on compressed bytes in tables or partitions that                        have not been modified for 90 consecutive                        days. Starting at $0.02 Per GB. The first 10 GB is free                      each month. Batch loading  Export table data to Cloud Storage. Free When using the shared slot pool                     Streaming inserts You are charged for rows that are successfully                        inserted. Individual rows are calculated using a 1 KB                        minimum. $0.01 per 200 MB BigQuery Storage Write API Data loaded into BigQuery, is subject to                        BigQuery storage pricing                        or                        Cloud Storage pricing.                       $0.025 per 1 GB. The first 2 TB per month                      are free. Batch export Export table data to Cloud Storage. Free When using the shared slot pool                     Streaming reads Use the storage Read API to perform streaming reads of                        table data. Starting at $1.10 per TB read Learn more about BigQuery pricing.                    View all pricing details Partners &            Integration From data ingestion to visualization, many partners have                    integrated their data solutions with BigQuery. Listed above                    are partner integrations through                    Google Cloud Ready - BigQuery.                   Visit our                    partner directory                    to learn about these BigQuery partners. FAQ BigQuery is Google Cloud’s fully managed and                              completely serverless enterprise data                              warehouse.  BigQuery supports all data types,                              works across clouds, and has built-in machine                              learning and business intelligence, all within a                              unified platform.  An enterprise data warehouse is a system used for                              the analysis and reporting of structured and                              semi-structured data from multiple sources. Many                              organizations are moving from traditional data                              warehouses that are on-premises to cloud data                              warehouses, which provide more cost savings,                              scalability, and flexibility. BigQuery offers robust security, governance, and                              reliability controls that offer high availability                              and a 99.99% uptime SLA. Your data is protected                              with encryption by default and customer-managed                              encryption keys. There are a few ways to get started with                              BigQuery. New customers get $300 in free credits                              to spend on BigQuery. All customers get 10 GB                              storage and up to 1 TB queries free per month, not                              charged against their credits. You can get these                              credits by signing up for the BigQuery free trial.                              Not ready yet? You can use the                              BigQuery sandbox                              without a credit card to see how it works.                              The                              BigQuery sandbox                              lets you try out BigQuery without a credit card.                              You stay within BigQuery’s free tier                              automatically, and you can use the sandbox to run                              queries and analysis on public datasets to see how                              it works. You can also bring your own data into                              the BigQuery sandbox for analysis. There is an                              option to upgrade to the free trial where new                              customers get a $300 credit to try BigQuery. Companies of all sizes use BigQuery to                              consolidate siloed data into one location so you                              can perform data analysis and get insights from                              all of your business data. This allows companies                              to make decisions in real time, streamline                              business reporting, and incorporate machine                              learning into data analysis to predict future                              business opportunities.", "url": "https://cloud.google.com/bigquery/", "threshold": 0.998545946690492}