{"title": "Outreach – Google Research", "content": "Google was born in Stanford's Computer Science department, so strong relationships with universities and research institutions are in our DNA. To cultivate these collaborations, we administer a variety of programs that provide resources and support to the academic and external research communities. Google supports and participates in the academic research community through meaningful engagement with university faculty. Our ongoing programs provide funding for academic research, as well as enable faculty to collaborate with Google researchers. Google Visiting Researcher Program We have the opportunity to build collaborations with global faculty through several different programs. This page highlights current collaborations that are important to us and awards that we granted beyond our Faculty Engagement programs. The Award for Inclusion Research Program recognizes and supports academic research in computing and technology that addresses the needs of underrepresented populations globally. Google's exploreCSR awards support institutions to host computer science research (CSR) initiatives in order to increase the number of students from historically marginalized groups pursuing graduate studies and research careers in computing. The Research Scholar program aims to support early-career faculty who are pursuing research in fields relevant to Google. Each year, academic researchers visit Google in order to collaborate with our research and engineering teams. Google provides a unique combination of interesting research problems, a wealth of data, world-class computing infrastructure, and the chance to deploy research in a form that will be used by millions. We have a history of funding faculty through our various University Relations programs. Find our former programs & recipients here. In order to support and deepen our relationship with the next generation of researchers, Google offers fellowships, scholarships, internships and other student opportunities. Google PhD Fellowship Program The PhD Fellowship recognizes outstanding graduate students doing exceptional work in computer science, related disciplines, or promising research areas. We currently offer Fellowships in Africa, Australia, Canada, East Asia, Europe, India, Latin America, New Zealand, Southeast Asia and the United States. The CS Research Mentorship Program matches undergraduate and graduate students from historically marginalized groups with their peers and a Google mentor in order to support their pursuit of computing research pathways. As part of our ongoing commitment to advancing computing and technology, we provide scholarships to encourage students to excel in their studies and become role models and leaders. The Internship Program aims to develop student talent in preparation for a full-time role at Google by providing opportunities across our various research areas. We welcome applications throughout the year from students in the final year of their PhD Program. The Student Researcher Program seeks to build and support partnerships with early career researchers through research projects at Google. We welcome applications from BS/MS/PhD students, or pre-academic researchers intending to join a MS or PhD program. Our conference scholarships aim to support students and professionals to attend selected conferences in the tech industry and related fields. Learn more about our programs and outreach efforts on our FAQ page.", "url": "https://research.google/outreach/", "threshold": -0.7313297214070604}