{"title": "Create Your Azure Free Account Today | Microsoft Azure", "content": "This browser is no longer supported. Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support. Discover secure, future-ready cloud solutions—on-premises, hybrid, multicloud, or at the edge Learn about sustainable, trusted cloud infrastructure with more regions than any other provider Build your business case for the cloud with key financial and technical guidance from Azure Plan a clear path forward for your cloud journey with proven tools, guidance, and resources See examples of innovation from successful companies of all sizes and from all industries Explore some of the most popular Azure products Provision Windows and Linux VMs in seconds Enable a secure, remote desktop experience from anywhere Migrate, modernize, and innovate on the modern SQL family of cloud databases Build or modernize scalable, high-performance apps Deploy and scale containers on managed Kubernetes Add cognitive capabilities to apps with APIs and AI services Quickly create powerful cloud apps for web and mobile Everything you need to build and operate a live game on one platform Execute event-driven serverless code functions with an end-to-end development experience Jump in and explore a diverse selection of today's quantum hardware, software, and solutions Secure, develop, and operate infrastructure, apps, and Azure services anywhere Remove data silos and deliver business insights from massive datasets Create the next generation of applications using artificial intelligence capabilities for any developer and any scenario Specialized services that enable organizations to accelerate time to value in applying AI to solve common scenarios Add cognitive capabilities to apps with APIs and AI services Accelerate information extraction from documents Build, train, and deploy models from the cloud to the edge Enterprise scale search for app development Create bots and connect them across channels Design AI with Apache Spark™-based analytics  Build for mixed reality using AI sensors Apply advanced coding and language models to a variety of use cases Gather, store, process, analyze, and visualize data of any variety, volume, or velocity Limitless analytics with unmatched time to insight Design AI with Apache Spark™-based analytics  Govern, protect, and manage your data estate Hybrid data integration at enterprise scale, made easy Provision cloud Hadoop, Spark, R Server, HBase, and Storm clusters Real-time analytics on fast-moving streaming data Build, train, and deploy models from the cloud to the edge Enterprise-grade analytics engine as a service Scalable, secure data lake for high-performance analytics Fast and highly scalable data exploration service Access cloud compute capacity and scale on demand—and only pay for the resources you use Provision Windows and Linux VMs in seconds Manage and scale up to thousands of Linux and Windows VMs Deploy and scale containers on managed Kubernetes Build and deploy Spring Boot applications with a fully managed service from Microsoft and VMware Quickly create powerful cloud apps for web and mobile Execute event-driven serverless code functions with an end-to-end development experience A dedicated physical server to host your Azure VMs for Windows and Linux Cloud-scale job scheduling and compute management Migrate SQL Server workloads to the cloud at lower total cost of ownership (TCO) Provision unused compute capacity at deep discounts to run interruptible workloads Build and deploy modern apps and microservices using serverless containers Develop and manage your containerized applications faster with integrated tools Deploy and scale containers on managed Kubernetes Deploy and scale containers on managed Red Hat OpenShift Build and deploy modern apps and microservices using serverless containers Execute event-driven serverless code functions with an end-to-end development experience Run containerized web apps on Windows and Linux Launch containers with hypervisor isolation Deploy and operate always-on, scalable, distributed apps Build, store, secure, and replicate container images and artifacts Seamlessly manage Kubernetes clusters at scale Azure Kubernetes Service Edge Essentials is an on-premises Kubernetes implementation of Azure Kubernetes Service (AKS) that automates running containerized applications at scale. Support rapid growth and innovate faster with secure, enterprise-grade, and fully managed database services Migrate, modernize, and innovate on the modern SQL family of cloud databases Build or modernize scalable, high-performance apps Build apps that scale with managed and intelligent SQL database in the cloud Fully managed, intelligent, and scalable PostgreSQL Modernize SQL Server applications with a managed, always-up-to-date SQL instance in the cloud Fully managed, scalable MySQL Database Migrate SQL Server workloads to the cloud at lower total cost of ownership (TCO) Accelerate apps with high-throughput, low-latency data caching Accelerate your data migration to Azure Modernize Cassandra data clusters with a managed instance in the cloud Deploy applications to the cloud with enterprise-ready, fully managed community MariaDB Deliver innovation faster with simple, reliable tools for continuous delivery Services for teams to share code, track work, and ship software Continuously build, test, and deploy to any platform and cloud Plan, track, and discuss work across your teams Get unlimited, cloud-hosted private Git repos for your project Create, host, and share packages with your team Test and ship confidently with an exploratory test toolkit Quickly create environments using reusable templates and artifacts Use your favorite DevOps tools with Azure Full observability into your applications, infrastructure, and network Optimize app performance with high-scale load testing Streamline development with secure, ready-to-code workstations in the cloud Build, manage, and continuously deliver cloud applications—using any platform or language Powerful and flexible environment to develop apps in the cloud A powerful, lightweight code editor for cloud development World’s leading developer platform, seamlessly integrated with Azure Comprehensive set of resources to create, deploy, and manage apps A powerful, low-code platform for building apps quickly Get the SDKs and command-line tools you need Build, test, release, and monitor your mobile and desktop apps Full observability into your applications, infrastructure, and network Optimize app performance with high-scale load testing Streamline development with secure, ready-to-code workstations in the cloud Quickly spin up app infrastructure environments with project-based templates Get Azure innovation everywhere—bring the agility and innovation of cloud computing to your on-premises workloads Secure, develop, and operate infrastructure, apps, and Azure services anywhere Cloud-native SIEM and intelligent security analytics Build and run innovative hybrid apps across cloud boundaries Experience a fast, reliable, and private connection to Azure Synchronize on-premises directories and enable single sign-on Migrate, modernize, and innovate on the modern SQL family of cloud databases Services for teams to share code, track work, and ship software Fully managed, intelligent, and scalable PostgreSQL Extend cloud intelligence and analytics to edge devices Manage user identities and access to protect against advanced threats across devices, data, apps, and infrastructure Synchronize on-premises directories and enable single sign-on Consumer identity and access management in the cloud Manage your domain controllers in the cloud Seamlessly integrate on-premises and cloud-based applications, data, and processes across your enterprise Automate the access and use of data across clouds Connect across private and public cloud environments Publish APIs to developers, partners, and employees securely and at scale Reliable event delivery at massive scale Fully managed enterprise-grade OSDU™ Data Platform Azure Data Manager for Agriculture extends the Microsoft Intelligent Data Platform with industry-specific data connectors and capabilities to bring together farm data from disparate sources, enabling organizations to leverage high quality datasets and accelerate the development of digital agriculture solutions Connect assets or environments, discover insights, and drive informed actions to transform your business Connect, monitor, and manage billions of IoT assets Use IoT spatial intelligence to create models of physical environments Extend cloud intelligence and analytics to edge devices Go from proof of concept to proof of value Create, connect, and maintain secured intelligent IoT devices from the edge to the cloud Unified threat protection for all your IoT/OT devices Build intelligent edge solutions with world-class developer tools, long-term support, and enterprise-grade security. Making embedded IoT development and connectivity easy Use an enterprise-grade service for the end-to-end machine learning lifecycle Add location data and mapping visuals to business applications and solutions Simplify, automate, and optimize the management and compliance of your cloud resources Build, manage, and monitor all Azure products in a single, unified console Govern, protect, and manage your data estate Stay connected to your Azure resources—anytime, anywhere Streamline Azure administration with a browser-based shell Your personalized Azure best practices recommendation engine Simplify data protection with built-in backup management at scale Monitor, allocate, and optimize cloud costs with transparency, accuracy, and efficiency Implement corporate governance and standards at scale Keep your business running with built-in disaster recovery service Improve application resilience by introducing faults and simulating outages Full observability into your applications, infrastructure, and network Deploy Grafana dashboards as a fully managed Azure service Deliver high-quality video content anywhere, any time, and on any device Encode, store, and stream video and audio at scale Studio grade encoding at cloud scale A single player for all your playback needs Deliver content to virtually all devices with ability to scale Securely deliver content using AES, PlayReady, Widevine, and Fairplay Fast, reliable content delivery network with global reach Simplify and accelerate your migration to the cloud with guidance, tools, and resources Simplify migration and modernization with a unified platform Keep your business running with built-in disaster recovery service Accelerate your data migration to Azure Appliances and solutions for data transfer to Azure and edge compute Monitor, allocate, and optimize cloud costs with transparency, accuracy, and efficiency Blend your physical and digital worlds to create immersive, collaborative experiences Create multi-user, spatially aware mixed reality experiences Render high-quality, interactive 3D content with real-time streaming Use IoT spatial intelligence to create models of physical environments Build for mixed reality using AI sensors Automatically align and anchor 3D content to objects in the physical world Build and deploy cross-platform and native apps for any mobile device Send push notifications to any platform from any back end Build, test, release, and monitor your mobile and desktop apps Create cloud-powered mobile apps faster Add location data and mapping visuals to business applications and solutions Publish APIs to developers, partners, and employees securely and at scale Enterprise scale search for app development Add cognitive capabilities to apps with APIs and AI services Create multi-user, spatially aware mixed reality experiences Quickly create powerful cloud apps for web and mobile Build multichannel communication experiences Connect cloud and on-premises infrastructure and services to provide your customers and users the best possible experience Create your own private network infrastructure in the cloud Deliver high availability and network performance to your apps Build secure, scalable, highly available web front ends in Azure Establish secure, cross-premises connectivity Host your Domain Name System (DNS) domain in Azure Fast, reliable content delivery network with global reach Protect your Azure resources from distributed denial-of-service (DDoS) attacks Rapidly ingest data from space into the cloud with a satellite ground station service Experience a fast, reliable, and private connection to Azure Extend Azure management for deploying 5G and SD-WAN network functions on edge devices Centrally manage virtual networks in Azure from a single pane of glass Private access to services hosted on the Azure platform, keeping your data on the Microsoft network Protect your enterprise from advanced threats across hybrid cloud workloads Cloud-native SIEM and intelligent security analytics Build secure, scalable, highly available web front ends in Azure Safeguard and maintain control of keys and other secrets Establish secure, cross-premises connectivity Protect your Azure resources from distributed denial-of-service (DDoS) attacks Fully managed service that helps secure remote access to your virtual machines A cloud-native web application firewall (WAF) service that provides powerful protection for web apps Protect your Azure Virtual Network resources with cloud-native network security Central network security policy and route management for globally distributed, software-defined perimeters Get secure, massively scalable cloud storage for your data, apps, and workloads High-performance, highly durable block storage Scalable, secure data lake for high-performance analytics Simple, secure and serverless enterprise-grade cloud file shares Enterprise-grade Azure file shares, powered by NetApp Simplify data protection with built-in backup management at scale Massively scalable and secure object storage Appliances and solutions for data transfer to Azure and edge compute Industry leading price point for storing rarely accessed data Elastic SAN is a cloud-native storage area network (SAN) service built on Azure. Gain access to an end-to-end experience like your on-premises SAN Manage persistent volumes for stateful container applications Build, deploy, and scale powerful web applications quickly and efficiently Quickly create and deploy mission-critical web apps at scale Publish APIs to developers, partners, and employees securely and at scale Fast, reliable content delivery network with global reach Enterprise scale search for app development Add real-time web functionalities easily Easily build real-time messaging web applications using WebSockets and the publish-subscribe pattern Add location data and mapping visuals to business applications and solutions Streamlined full-stack development from source code to global high availability Build multichannel communication experiences Optimize app performance with high-scale load testing Easily add real-time collaborative experiences to your apps with Fluid Framework Build and deploy modern apps and microservices using serverless containers Empower employees to work securely from anywhere with a cloud-based virtual desktop infrastructure Enable a secure, remote desktop experience from anywhere Provision Windows desktops and apps with VMware and Azure Virtual Desktop Provision Windows desktops and apps on Azure with Citrix and Azure Virtual Desktop Set up virtual labs for classes, training, hackathons, and other related scenarios Streamline development with secure, ready-to-code workstations in the cloud Build, manage, and continuously deliver cloud apps—with any platform or language Analyze images, comprehend speech, and make predictions using data Simplify and accelerate your migration and modernization with guidance, tools, and resources Gather, store, process, analyze, and visualize data of any variety, volume, or velocity Bring the agility and innovation of the cloud to your on-premises workloads Connect, monitor, and control devices with secure, scalable, and open edge-to-cloud solutions Help protect data, apps, and infrastructure with trusted security services Simplify and accelerate development and testing (dev/test) across any platform. Bring together people, processes, and products to continuously deliver value to customers and coworkers. Build secure apps on a trusted platform. Embed security in your developer workflow and foster collaboration between developers, security practitioners, and IT operators. Give customers what they want with a personalized, scalable, and secure shopping experience. Turn your ideas into applications faster using the right tools for the job. Create reliable apps and functionalities at scale and bring them to market faster. Reach your customers everywhere, on any device, with a single mobile app build. Respond to changes faster, optimize costs, and ship confidently. Build apps faster by not having to manage infrastructure. Connect modern applications with a comprehensive set of messaging services on Azure. Accelerate time to market, deliver innovative experiences, and improve security with Azure application and data modernization. Use business insights and intelligence from Azure to build software as a service (SaaS) apps Move to a SaaS model faster with a kit of prebuilt code, templates, and modular resources. Explore services to help you develop and run Web3 applications. Build mission-critical solutions to analyze images, comprehend speech, and make predictions using data. Uncover latent insights from across all of your business data with AI. Protect your data and code while the data is in use in the cloud. Build machine learning models faster with Hugging Face on Azure. Save money and improve efficiency by migrating and modernizing your workloads to Azure with proven tools and guidance. Optimize costs, operate confidently, and ship features faster by migrating your ASP.NET web apps to Azure. Simplify and accelerate development and testing (dev/test) across any platform. Enhanced security and hybrid capabilities for your mission-critical Linux workloads. Reduce infrastructure costs by moving your mainframe and midrange apps to Azure. Bring the intelligence, security, and reliability of Azure to your SAP applications. Move your SQL Server databases to Azure with few or no application code changes. Run your Windows workloads on the trusted cloud for Windows Server. Protect your data and code while the data is in use in the cloud. Accelerate time to market, deliver innovative experiences, and improve security with Azure application and data modernization. Seamlessly integrate applications, systems, and data for your enterprise. Run your Oracle® database and enterprise applications on Azure and Oracle Cloud. Drive faster, more efficient decision making by drawing deeper insights from your analytics. Accelerate time to insights with an end-to-end cloud analytics solution. Minimize disruption to your business with cost-effective backup and disaster recovery solutions. Get fully managed, single tenancy supercomputers with high-performance storage and no data movement. Bring innovation anywhere to your hybrid environment across on-premises, multicloud, and the edge. Deliver ultra-low-latency networking, applications and services at the enterprise edge. Run your mission-critical applications on Azure for increased operational agility and security. Experience quantum impact today with the world's first full-stack, quantum computing cloud ecosystem. Deliver ultra-low-latency networking, applications, and services at the mobile operator edge. Explore services to help you develop and run Web3 applications. Bring Azure to the edge with seamless network integration and connectivity to deploy modern connected apps. Connect devices, analyze data, and automate processes with secure, scalable, and open edge-to-cloud solutions. Build open, interoperable IoT solutions that secure and modernize industrial systems. Help safeguard physical work environments with scalable IoT solutions designed for rapid deployment. Strengthen your security posture with end-to-end security for your IoT solutions. Meet environmental sustainability goals and accelerate conservation projects with IoT technologies. Ensure compliance using built-in cloud governance capabilities. Minimize disruption to your business with cost-effective backup and disaster recovery solutions. Protect your data and code while the data is in use in the cloud. Cloud-native network security for protecting your applications, network, and workloads. Explore services to help you develop and run Web3 applications. Modernize operations to speed response rates, boost efficiency, and reduce costs Transform customer experience, build trust, and optimize risk management Build, quickly launch, and reliably scale your games across platforms Implement remote government access, empower collaboration, and deliver secure services Boost patient engagement, empower provider collaboration, and improve operations Improve operational efficiencies, reduce costs, and generate new revenue opportunities Create content nimbly, collaborate remotely, and deliver seamless customer experiences Personalize customer experiences, empower your employees, and optimize supply chains Get started easily, run lean, stay agile, and grow fast with Azure for startups Accelerate mission impact, increase innovation, and optimize efficiency—with world-class security Find reference architectures, example scenarios, and solutions for common workloads on Azure Do more with less—explore resources for increasing efficiency, reducing costs, and driving innovation Search from a rich catalog of more than 17,000 certified apps and services Plan a clear path forward for your cloud journey with proven tools, guidance, and resources Get the best value at every stage of your cloud journey See which services offer free monthly amounts Only pay for what you use, plus get free services Find the options that work best for you Explore special offers, benefits, and incentives Estimate the costs for Azure products and services Estimate your total cost of ownership and cost savings Learn how to manage and optimize your cloud spend Understand the value and economics of moving to Azure Find, try, and buy trusted apps and services Get up and running in the cloud with help from an experienced partner Find the latest content, news, and guidance to lead customers to the cloud Build, extend, and scale your apps on a trusted cloud platform Reach more customers—sell directly to over 4M users a month in the commercial marketplace Create, deploy, and manage applications across multiple clouds, on-premises, and at the edge Create, deploy, and manage applications across multiple clouds, on-premises, and at the edge Build cloud-connected mobile experiences based on customer interests and behaviors using AI and cognitive services. Deploy Windows and Linux virtual machines, modernize applications, and develop apps across cloud and hybrid environments. Create workloads in Azure that scale with your business, host domains, and deploy faster with DevOps tools. Move to pay as you go for free monthly amounts of popular services for 12 months and 55+ other services always. 750 hours B1s burstable virtual machines                                         250 GB S0 instance with 10 database transaction units                                         5 GB locally redundant storage (LRS) hot block with 20,000 read and 10,000 write operations                                         1,000 request units per-second provisioned throughput with 25 GB storage                                         10 web, mobile, or API apps with 1 GB storage 1 hour per day                                         1 million requests                                         100,000 operations per month                                         After your credit, keep getting free services Move to pay as you go for free monthly amounts of popular services for 12 months and 55+ other services always. Azure Files and Azure Media Services, Live and on-demand streaming are now free for 12 months when you create your Azure free account.                 After your $200 credit, only pay for what you use beyond the free amounts of services. With pay as you go, there’s no fee to maintain your Azure free account, and no upfront commitment. Cancel anytime.             Get started with confidence by watching a series of brief videos on Azure fundamentals. See how to get free services, architect solutions, manage resources, deploy apps and databases, and save money. Then, get answers to your questions in real time from Azure experts. Watch the Azure demo at your convenience. You'll get access to the demo when you register. You also have the option to register for a live, online Q&A session.             Choose the option that works best for you         Watch the demo on demand, no Q&A session I will receive information, tips, and offers about Solutions for Businesses and Organizations and other Microsoft products and services. Participation requires transferring your personal data to other countries in which Microsoft operates, including the United States. By submitting this form, you agree to the transfer of your data outside of China. BY SUBMITTING this page, I confirm that I have read the policy of processing personal data of Microsoft Rus LLC and provide consent to the operator of Microsoft Rus LLC, located at the address 121,614, the Russian Federation, Moscow, UL. Krylatskaya St, 17 to 1. for in order to implement interaction with potential and existing customers and partners. My personal data in respect of which the consent is given, include: name, surname, patronomic, gender, position, data on employment, official position, contact details (phone numbers and e-mail address, foreign language skills. I acknowledge that Microsoft Rus LLC will only process the data as long as necessary for the particular purpose involved and might ask me to renew my consent for the processing after 5 years to ensure it follows my intent. Please read the Microsoft Privacy Statement. *Depending on the country in which you sign up for your Azure free account, you may receive this credit in a specified local currency.", "url": "https://azure.microsoft.com/en-us/free/", "threshold": -0.9999980678742889}