{"title": "Internet Explorer Downloads - Microsoft Support", "content": "Support for Internet Explorer ended on June 15, 2022. Internet Explorer 11 has been permanently disabled through a Microsoft Edge update on certain versions of Windows 10. If any site you visit needs Internet Explorer 11, you can reload it with Internet Explorer mode in Microsoft Edge. Get started with Microsoft Edge Internet Explorer 11 is no longer supported on Windows 8.1. Instead, we recommend you switch to Microsoft Edge. Microsoft Edge was built to bring you the best of the web, with more control and more privacy as you browse. If any site you visit needs Internet Explorer 11, you can reload it with Internet Explorer mode in Microsoft Edge. Get started with Microsoft Edge Find out what version of Internet Explorer you’re using or which operating system you're running. Internet Explorer 11 is no longer supported on Windows 7. Instead, we recommend you switch to Microsoft Edge. Microsoft Edge was built to bring you the best of the web, with more control and more privacy as you browse. If any site you visit needs Internet Explorer 11, you can reload it with Internet Explorer mode in Microsoft Edge. Get started with Microsoft Edge Though it's no longer supported, you can download and install Internet Explorer 11. Internet Explorer Download Center Find out what version of Internet Explorer you’re using or which operating system you're running. Explore subscription benefits, browse training courses, learn how to secure your device, and more.  Microsoft 365 subscription benefits  Microsoft 365 training  Microsoft security  Accessibility center                 Communities help you ask and answer questions, give feedback, and hear from experts with rich knowledge.              Ask the Microsoft Community  Microsoft Tech Community  Windows Insiders  Microsoft 365 Insiders Find solutions to common problems or get help from a support agent.  Online support      ", "url": "https://go.microsoft.com/fwlink/?LinkId=2092881&clcid=0x409", "threshold": 0.9819219903097243}