{"title": "Lifecycle FAQ - Internet Explorer and Microsoft Edge | Microsoft Learn", "content": "This browser is no longer supported. Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support. Please go here to search for your product's lifecycle. Microsoft Edge follows the Modern Policy. Go here for Microsoft Edge Lifecycle Policy details. Support for the legacy version of the Microsoft Edge desktop app ended on March 9, 2021. The Microsoft Edge Legacy applicationwill no longer receive security updates after that date. Go here to learn more. For additional lifecycle information, see servicing guidelines by channelalong with a list of supported operating systems. Microsoft recommends using Microsoft Edge as your default browser. Go here todownload. Internet Explorer is a component of the Windows operating system (OS) and follows the Lifecycle Policy for the product on which it isinstalled and supported. Please note that the Internet Explorer (IE) 11 desktop application ended support for certain operating systems on June 15, 2022. Customers are encouraged to move to Microsoft Edge with IE mode. IE mode enables backward compatibility and will be supported through at least 2029. Additionally, Microsoft will provide notice one year prior to retiring IE mode. Please go here to learn more. Some versions of Internet Explorer may be supported past the latest Windows OS end date when Extended Security Updates (ESUs) are available. Go here for a list of products offering ESUs. For help migrating from IE 11 to Edge, go here. For information about Teams and Office 365/Microsoft 365 support on IE11, go here. For information on Azure DevOps support on IE11, go here. The tables below show the supported version of Internet Explorer for each operating system. Windows Desktop operating systems *The Internet Explorer 11 (IE11) desktop application will be permanently disabled through a Microsoft Edge update on certain versions of Windows 10 on February 14, 2023. Go hereto learn more. Windows Server operating systems Windows Embedded operating systems Yes, Internet Explorer 11 is the last major version of Internet Explorer. The Internet Explorer 11 desktop application went out of support for certain operating systems starting June 15, 2022*. Customers are encouraged to move to Microsoft Edge with Internet Explorer (IE) mode. IE mode provides built-in legacy browser support for sites requiring Internet Explorer. For supported operating systems, Internet Explorer 11 will continue receiving security updatesand technical support for the lifecycle of the Windows version on which it is installed. See above for a list of supported operating systems for Internet Explorer by version. Additionally, certain Microsoft apps and services have ended support for IE11. Go here to learn more. *The retired, out-of-support Internet Explorer 11 (IE11) desktop application will be permanently disabled on certain versions of Windows 10 as part of the February 2023 Windows security update (\"B\") release scheduled for February 14, 2023. We highly recommend setting up IE mode in Microsoft Edge and disabling IE11 prior to this date to ensure your organization does not experience business disruption. Go here to learn more. Microsoft is committed to supporting Internet Explorer mode in Microsoft Edge through at least 2029, on supported operating systems. Additionally, Microsoft will provide a minimum of one year notice prior to end of support for IE mode. Windows support dates are documented on the Product Lifecycle page and may require an Extended Security Update (ESU) license, if available, to receive operating system security updates beyond its End of Support date. Microsoft will release security updates only for the latest version of Internet Explorer for each Windows operating system. Customers must installthe latest version of Internet Explorer to update the Internet Explorer runtime DLLs, receive updates, and remain in a supported configuration. If customers need an update to the Internet Explorer runtime DLLs, they must install the latest version of Internet Explorer (IE11) to update theruntime DLLs. After doing so they will continue to receive security updates.", "url": "https://docs.microsoft.com/en-us/lifecycle/faq/internet-explorer-microsoft-edge", "threshold": 0.9942512638164214}