{"title": "Machine Learning is Fun!", "content": "Your Custom Text Here Machine Learning Is Fun! The Book Second Edition just released! I’ve written the book that I wished existed when I was getting started with machine learning and AI. Stop wasting time and get started learning! You can totally learn cutting-edge techniques like image segmentation with Deep Learning. It's not magic! Thanks to machine learning, there's never been a more exciting time in the history of computer science. Every day, new breakthroughs are changing what's possible with computers. You might be intimidated by machine learning or think it's something that only the top companies and research institutions can use, but that's not true. Machine Learning is for everyone—and it's fun! De-mystify the latest breakthroughs in Machine Learning with these fun tutorials. Have you heard people talking about machine learning but only have a fuzzy idea of what that means? Are you tired of nodding your way through conversations with co-workers? Let’s change that!This guide is for anyone who is curious about machine learning but has no idea where to start. Learn how about neural networks and how recurrent neural networks can be used to general new data based on existing data. Learn how Convolutional Neural Networks work and how they are used to recognize objects in photographs. Let’s learn how modern face recognition works! But just recognizing your friends would be too easy. We can push this tech to the limit to solve a more challenging problem — telling Will Ferrell (famous actor) apart from Chad Smith (famous rock musician)! Sequence-to-sequence learning is a very powerful technique that revolutionizing language translation. After we see how it is used for translation, we’ll also learn how the exact same algorithm can be used to write AI chat bots and describe pictures. But speech recognition has been around for decades, so why is it just now hitting the mainstream? The reason is that deep learning finally made speech recognition accurate enough to be useful outside of carefully controlled environments. Let’s learn how to do speech recognition with deep learning! Deep Convolutional Generative Adversarial Networks (or DCGANs for short) are one of the most exciting new areas of machine learning research. DCGANs are able to hallucinate original photo-realistic pictures by using a clever combination of two deep neural networks that compete with each other. Let’s use generative models to do something a bit more silly — make artwork for 8-bit video games! Almost as long as programmers have been writing computer programs, computer hackers have been figuring out ways to exploit those programs. Malicious hackers take advantage of the tiniest bugs in programs to break into systems, steal data and generally wreak havoc. Everyone hates CAPTCHAs — those annoying images that contain text you have to type in before you can access a website. Let’s hack the world’s most popular Wordpress CAPTCHA Plug-in with machine learning! Build a high-accuracy parking space notification system with Python and Deep Learning! Let's walk through setting up a Jetson Nano and using it to build a doorbell camera that can track everyone who walks up to your house using face recognition. Learn how to write your own programs that understand written language. Need to extract data from plain text? Learn how to build an NLP Pipeline in Python! Sometimes the most complicated solution isn’t the best. Learn the tricks that real companies used to quickly parse messy text from social media posts and user-contributed content. Sometimes having a model that works but not knowing how it works isn’t good enough. But thanks to new techniques like LIME, we now have ways to see inside the black box. Let’s learn how to understand what our models are thinking! How easy it is for an average person to generate fake news that could trick a real person and how good are the results? Let’s explore how a system like this could work and how much of a threat it is. Let’s try to build a newspaper populated with fake, computer generated news! Python is one of the most popular programming language for Machine Learning. So the more you know about Python, the better! Automatically scrape data out of web pages with one line of code! To make it simple for anyone to play around with machine learning, I’ve put together a simple virtual machine image that you can download and run without any complicated installation steps. One common complaint about the Python language is that variables are Dynamically Typed. That means you declare variables without giving them a specific data type. But with Python 3.6, you now have the choice of using Static Type Checking which can automatically catch many common errors while coding! If you have a computer made in the last decade, there’s a good chance it has 4 (or more) CPU cores. That means that 75% or more of your computer’s power is sitting there nearly idle while you are waiting for your program to finish running! Let’s learn how to take advantage of the full processing power of your computer by running Python functions in parallel. One of programming’s little annoyances is that Microsoft Windows uses a backslash character between folder names while almost every other computer uses a forward slash. But pathlib makes it easy to deal with this. In my experience, there is one technical problem that trips people up more often than any other. No, it’s not a complicated theoretical issue or an issue with expensive GPUs. It’s the fact that almost everyone is loading their images into memory sideways without even knowing it. In each of my courses, you will get your hands dirty and code a real Machine Learning project from start to finish. And best of all, you can take all these courses for free when you sign up using this special free 30-day trial offer! In this project-based course, discover how to use machine learning to build a value estimation system that can deduce the value of a home. Follow Adam Geitgey as he walks through how to use sample data to build a machine learning model, and then use that model in your own programs. Recommendation systems are a key part of almost every modern consumer website. The systems help drive customer interaction and sales by helping customers discover products and services they might not ever find themselves. By the end of the course, you'll be equipped to use machine learning yourself to solve recommendation problems. TensorFlow is one of the most popular deep learning frameworks available. It's used for everything from cutting-edge machine learning research to building new features for start-ups in Silicon Valley. Discover how to install and use TensorFlow to create, train, and deploy machine learning models. Keras is a popular programming framework for deep learning that simplifies the process of building deep learning applications. In this course, learn how to install and use Keras to build and deploy deep learning models.  Thanks to deep learning, image recognition systems have improved and are now used for everything from searching photo libraries to generating text-based descriptions of photographs. In this course, learn how to build a deep neural network that can recognize objects in photographs. Find out how to adjust state-of-the-art deep neural networks to recognize new objects, without the need to retrain the network. Explore cloud-based image recognition APIs that you can use as an alternative to building your own systems. Learn the steps involved to start building and deploying your own image recognition system. Face recognition is used for everything from automatically tagging pictures to unlocking cell phones. And with recent advancements in deep learning, the accuracy of face recognition has improved. In this course, learn how to develop a face recognition system that can detect faces in images, identify the faces, and even modify faces with \"digital makeup\" like you've experienced in popular mobile apps. Find out how to set up a development environment. Discover tools you can leverage for face recognition. See how a machine learning model can be trained to analyze images and identify facial landmarks. Learn the steps involved in coding facial feature detection, representing a face as a set of measurements, and encoding faces. Additionally, learn how to repurpose and adjust pre-existing systems.", "url": "https://www.machinelearningisfun.com/", "threshold": 0.22782262501989958}