{"title": "The MLIF Book (2nd Ed) — Machine Learning is Fun!", "content": "Your Custom Text Here Machine Learning is Fun! The Book Second Edition: After five years of blogging for millions of readers, I’ve taken everything that I’ve learned and created the exact book that I wish existed when I got started. This book is for anyone who is curious about machine learning and artificial intelligence. Whether you are an experienced software developer who wants to learn something new, a product manager who wants to learn how to apply machine learning to your applications, or someone just interested in how things work, you've come to the right place! This book includes everything you need: Easy-to-understand guides explaining how machine learning works. Explorations of cutting-edge techniques like image recognition, speech recognition, face recognition, and natural language processing. Hands-on projects where you’ll build your own machine learning systems using cutting-edge techniques. Advice on how to use machine learning effectively in your own company. Fully up-to-date! The Second Edition has been updated for the latest developments in machine learning, including the release of TensorFlow 2.0. No! This book is for absolutely anyone who wants to know how machine learning works. We’ll start from the very beginning and go one step at a time until we’ve covered some of the latest concepts in machine learning and AI research!  But to make it easy for anyone to get the most value out of this book, I’ve split it up into three bundles. You can pick what’s best for you: Basic Bundle - Designed for CEOs, Product Managers and anyone else curious about machine learning but not in writing the code themselves. Developer Bundle - Designed for programmers and future programmers who want to learn with hands-on projects. Team Bundle - Designed for software development teams who want to learn together. Not a programmer? Get the Basic Bundle. Do you just want to understand how machine learning works so that you know what your co-workers are talking about? The basic bundle covers how machine learning works, from the very basics all the way through deep learning, image segmentation, natural language processing, chatbots, and even strategies for applying machine learning to your business. But it doesn’t include any of the code examples, hands-on projects or Python tips. Here’s what is covered in Basic Bundle’s 21 chapters: What is machine learning and how does it work? Deep Learning and how it’s used to implement Image Recognition, Image Segmentation, Face Recognition, Speech Recognition, and more. Natural Language Processing and how it’s used to extract information from text, build chatbots and digital assistants, and implement automatic language translation systems.  How hackers take advantage of machine learning to break into systems and even trick other machine learning systems. How to use machine learning in your own business while avoiding the common mistakes that cost companies a lot of money. Want more details? Check out the Basic Edition’s Table of Contents. Go from theory to action with the Developer Bundle! The Developer Bundle includes all the content in the Basic Bundle, plus 20 hands-on projects where you get to apply the techniques you’ve learned in real programs. I’m also including a pre-configured virtual machine with all the projects ready-to-run and an extra Python Machine Learning Pro Tips mini-book with some of my favorite tips and tricks for using Python to its fullest for machine learning. Here are all the hands-on projects included in the Developer Bundle: How to train your very first machine learning model. Code and train a basic neural network to predict house prices. Build an image classifier with convolutional neural networks. How to use transfer learning to build image classification systems with smaller datasets and faster training times. Use image segmentation to count people waiting in a line. Train your own image segmentation system to detect any custom object. Detect available parking spaces in a video feed. Build a face recognition system that identifies people in an image. Use face recognition to build a ‘doorbell camera’ that tracks multiple visitors in a video feed. Learn how to deploy your deep-learning-powered doorbell camera on an Nvidia Jetson Nano embedded computer. Note: Completing this optional project requires an Jetson Nano development board and camera (~$150 from most vendors). Hardware not included. Use DeepSpeech to recognize the words spoken in audio. Use natural language processing to automatically extract information from Wikipedia articles. Put natural language processing ideas into practice to extract all the people who have appeared on every episode of a podcast. Train an industrial-strength text classifier that can automatically assign star ratings to a user’s written review. Build text classifiers that can explain why they assigned one classification instead of an other. Build a chatbot that can parse and answer real questions. Use a recurrent neural network to code your own text generator. Use the latest NLP models like GPT-2 and Grover to write realistic-sounding news stories completely automatically. Use deep learning to outsmart CAPTCHAs. Use deep learning against itself to create adversarial images that will trick other deep learning systems. Want to see more? Here’s the Developer Edition’s Table of Contents. You can also check out the Table of Contents for the Python Machine Learning Pro Tips mini-book that’s also included. Want to train your whole team? Get the Team Bundle! Machine learning is something that almost everyone is interested in. Why not help your whole development team get up to speed with the Team Bundle? You get five copies of everything in the Developer Bundle at a discounted price. And if you need more than five copies, just email and let me know! All credit card charges are processed securely by Stripe and your purchase is delivered instantly via email. Best of all, your purchase is backed by a 100% Money Back Guarantee. $79 Basic edition ebook in PDF, Kindle (mobi) and iBooks / Google Play Books (epub) formats. 250+ pages of content plus free access to future updates. Guides to image recognition, transfer learning, image segmentation, natural language processing, chatbots, and a lot more! Note: Hands-on projects not included! This edition is not intended for software developers. $119 Developer edition ebook in PDF, Kindle (mobi) and iBooks / Google Play Books (epub) formats. 600+ pages of content plus free access to future updates. Guides to image recognition, transfer learning, image segmentation, natural language processing, chatbots, and a lot more! Full source code for the 20 hands-on projects VMware Virtual Machine image with all tools and project source code pre-installed and ready to go. Includes the extra Python Machine Learning Pro-Tips mini-book in PDF, mobi and epub format. $449 5 x Developer edition ebook PDF, Kindle (mobi) and iBooks / Google Play Books (epub) formats. 600+ pages of content plus free access to future updates. Guides to image recognition, transfer learning, image segmentation, natural language processing, chatbots, and a lot more! Full source code for the 20 hands-on projects VMware Virtual Machine image will all tools and project source code pre-installed and ready to go. Five copies of the extra Python Machine Learning Pro-Tips mini-book in PDF, mobi and epub format. I wrote the book that I wish existed when I was getting started and I hope that you will love it as much as I do. If you aren’t completely happy with it, I don’t want to keep your money. Just send me an email, up to 30 days after purchase, and ask for a full refund. That’s how much I want you to be happy! Your purchase will be delivered securely by DPD, the fulfillment company I’m using. You’ll be able to download the book and any extras (VMs, etc) within minutes. I’ve designed this book to be useful to as wide an audience as possible, so you don’t need any special qualifications to read it. If you don’t even know what machine learning is, don’t worry – I explain it in the first chapter. From there, the concepts build on top of each other. By the end of the book, you’ll know how all kinds of machine learning algorithms work and how to apply them to your own projects. But if you are a software developer and you want to try everything out yourself, make sure you get the Developer Bundle. It comes with 20 hands-on projects where you’ll try out the things you’ve learned and build your own machine learning systems. This book is designed to help you understand machine learning and get you to build real things as quickly as possible using Python. I’ll cover why things work they way the do and show you best practices. You’ll be able to build real software for use in real projects. As such, this book focuses on the application of machine learning and is not intended as a theory textbook. If you are looking for a textbook that focuses on the mathematics and theory of machine learning, I can recommend Deep Learning by Ian Goodfellow, Yoshua Bengio and Aaron Courville from MIT Press. It is available to read for free online. It’s a great book for those who learn best by starting from the mathematical fundamentals and building up from there. On the other hand, if you learn best by getting the big picture of how things fit together and then applying what you’ve learned, I think you’ll have a lot of fun with my book. The Basic Bundle is designed for non-programmers like CEOs, Product Managers, and anyone else who wants to know the ideas behind machine learning and how they might use it in their products. If you are interested how things work in more detail, get the Developer Bundle. It has all the chapters in the Basic Bundle, but you can dig deeper into any of the programming examples at your own pace. Of course! Here’s the TOC for the Basic Edition of the book.  And here’s the TOC for the Developer Edition of the book. You can also check out the TOC for the Python Machine Learning Pro Tips mini-book that’s included with the Developer Edition. In the projects included with the Developer Bundle, we’ll use the following software: Python 3, numpy, Pandas, Matplotlib,  scikit-learn, Tensorflow 2, Keras, dlib, OpenCV, spaCy, fastText, Rasa NLU, face_recognition, DeepSpeech, and several other common Python support libraries like pathlib. I’m not currently offering a hardcopy edition. I’ve been updating the book as things change and things in machine learning change constantly. You get future updates to the electronic edition for free! < Back to the homepage", "url": "https://www.machinelearningisfun.com/get-the-book", "threshold": -0.9996831596019098}