{"title": "Travel Archives • In Sight: Full Life", "content": "Disney+ was rightly praised by the visually impaired and blind communities with their announcement that all of the movies and series created for the platform would arrive with audio description. But one thing that has gone under the radar is how many of their older films and animated shorts have had audio description added as well! This isn’t only new titles that they’re adding to Disney+; they’ve quietly been adding it to their existing list of movies and series each week.  This includes many titles from the 30s-70s. which generally are rarely audio described.  As a companion to my alphabetical list of Disney+ Titles with Audio Description, I wanted to also provide a list of the films, series, and shorts available on Disney+ with audio description by year in case you want to find out which older films you can now enjoy with audio description! As a huge fan of Disney theme parks, I am always looking for ways to bring the Disney magic home.  One of my favorite ways to do that… Big news, y’all!  It’s no secret that I’m a major Disney fangirl. You probably realized that the moment you got here.  So when my friend Patty from No-Guilt… Avengers: Assemble!  Sorry, you know I had to get that out of the way. The Disney+ streaming service has been a huge gift to Marvel fans who now have an easy way to catch up on the Marvel Cinematic Universe before the launch of Phase 4 in 2020, or those who want to take a deep dive into some of the X-Men or Spider-Woman cartoons of the 70s, 80s, and 90s.  But if you’re here, you’re probably wondering about which Marvel movies have audio description on Disney+?  Good news: the answer is “most of them”! Time to talk more Disney+!  After sharing my post detailing the Disney+ Accessibility Features, a lot of the discussion I saw on my social media feeds was about… Today I’ve got some news that hits the ultimate trifecta of my interests: Disney, Entertainment, and Accessibility!  In advance of their launch on November 12,  Disney has been… Theresa is a Maryland native who is grateful to only be a 2-hour flight from Walt Disney World.  She loves exploring new locations & cuisines, and can beat anybody in a game of “Oh! You know what else that actor was in?” Despite being diagnosed with myopic macular degeneration, her spirit and sense of humor hasn't been dampened; she likes to tell people this simply makes her a “temporary visionary.” Read more About Me  or send an email to insightfulllife@gmail.com! Enter your email below to sign up for my mailing list!   Theresa is a Maryland native who was diagnosed in 2014 with myopic macular degeneration. Being a “temporary visionary” doesn’t keep her from the things she loves: Disney, the Orioles and playing “You know what else that actor was in?” Learn more about Theresa. Enter your email address below to sign up for my mailing list!   © 2020 In Sight: Full Life    Privacy Policy and Disclosures  Disney+ was rightly praised by the visually impaired and blind communities with their announcement that all of the movies and series created for the platform would arrive with audio description. But one thing that has gone under the radar is how many of their older films and animated shorts have had audio description added as well! This isn’t only new titles that they’re adding to Disney+; they’ve quietly been adding it to their existing list of movies and series each week.  This includes many titles from the 30s-70s. which generally are rarely audio described.  As a companion to my alphabetical list of Disney+ Titles with Audio Description, I wanted to also provide a list of the films, series, and shorts available on Disney+ with audio description by year in case you want to find out which older films you can now enjoy with audio description! As a huge fan of Disney theme parks, I am always looking for ways to bring the Disney magic home.  One of my favorite ways to do that… Big news, y’all!  It’s no secret that I’m a major Disney fangirl. You probably realized that the moment you got here.  So when my friend Patty from No-Guilt… Avengers: Assemble!  Sorry, you know I had to get that out of the way. The Disney+ streaming service has been a huge gift to Marvel fans who now have an easy way to catch up on the Marvel Cinematic Universe before the launch of Phase 4 in 2020, or those who want to take a deep dive into some of the X-Men or Spider-Woman cartoons of the 70s, 80s, and 90s.  But if you’re here, you’re probably wondering about which Marvel movies have audio description on Disney+?  Good news: the answer is “most of them”! Time to talk more Disney+!  After sharing my post detailing the Disney+ Accessibility Features, a lot of the discussion I saw on my social media feeds was about… Today I’ve got some news that hits the ultimate trifecta of my interests: Disney, Entertainment, and Accessibility!  In advance of their launch on November 12,  Disney has been… Theresa is a Maryland native who is grateful to only be a 2-hour flight from Walt Disney World.  She loves exploring new locations & cuisines, and can beat anybody in a game of “Oh! You know what else that actor was in?” Despite being diagnosed with myopic macular degeneration, her spirit and sense of humor hasn't been dampened; she likes to tell people this simply makes her a “temporary visionary.” Read more About Me  or send an email to insightfulllife@gmail.com! Enter your email below to sign up for my mailing list!   Theresa is a Maryland native who was diagnosed in 2014 with myopic macular degeneration. Being a “temporary visionary” doesn’t keep her from the things she loves: Disney, the Orioles and playing “You know what else that actor was in?” Learn more about Theresa. Enter your email address below to sign up for my mailing list!   © 2020 In Sight: Full Life    Privacy Policy and Disclosures  Hey, y’all! I’m Theresa Mabe, a visually impaired, digital accessibility advocate with a passion for travel, entertainment, and style.  Central Maryland has always been home, but I jump at any opportunity to hope on a plane and visit new or familiar destinations – especially if Disney, food, or baseball is involved. I’m a DisneyBounder at heart, a marketing data analyst by trade, and I’ll challenge anybody to a game of “You know what else that actor was in?” In additional to creating accessible content and sharing digital accessibility tips online, I’m also available for social media and web accessibility auditing, on site training, and speaking engagements. Want to know more about me, how we can work together, or looking to request a media kit?  Send me an email at InSightFullLife@gmail.com! In Sight: Full Life began as a way to be a voice and resource for others diagnosed with myopic macular degeneration and other visual impairments, and sharing how losing my vision wasn’t going to stop me from living my life.  While that is still the overwhelming theme and purpose of the content I create, I now place heavier emphasis on my blog and social media accounts in sharing news, stories, and tips centered around making travel, style, and entertainment more accessible. While earning my degree in digital media and web technology, I was diagnosed with a condition that has caused me to have progression vision loss. Rather than dwell on the uncertainty of my future, I looked at this as an opportunity: to use my personal experience and educational background to become a digital accessibility advocate, educating organizations, content creators, and anybody who shares information on the internet how they can amplify their message by reducing digital barriers. Popular Post:  Creating an Accessible Instagram Account Growing up, my dad always had Turner Classic Movies on in our house (usually on more than one tv at a time), so it’s no surprise that the majority of my top 10 favorite films were made in the 1960s or earlier. But that doesn’t mean I’m stuck in the past!  I love a variety of entertainment genres and exploring what goes into making the content we all enjoy.  In addition to reviewing television and film, I’m always on the lookout to highlight stories within entertainment that promote representation and inclusion, whether it’s on the screen, behind the camera, or in the studio. I feel like this is also the place to brag that Jessie Maltin has listed me as one of her favorite “film/movie buff/cinephile nerd accounts” to follow on Twitter, so be sure to check me out there as well, @GertieTheDino. Popular Post: Disney+ Titles with Audio Description  With the Disney Parks being some of the most photographed places in the world, it’s not surprise that in recent years people have taken to showing off their “Disney Style” – and I’m no exception! I love creating fun (and affordable) character-inspired DisneyBounds.  I try to exclusively use items from my closet, and only resort to buying something if I know I’ll wear it regularly or can use it to represent multiple characters.  You can see all of my Disney outfits on my Instagram, @in.sight.full.life! Outside of clothing, most visually impaired people will tell you that given some of our sight limitations, there are specific tools, tips, and products we gravitate towards.  If you haven’t heard: automatic curling wands are one of the greatest inventions of our time. Popular Post: Dapper Day DisneyBound: Clarice the Chipmunk Although Disney Parks are my most frequent vacation spot, I’m always mentally planning my next excursion to a new location.  Day trips or week-long adventures; solo, girls’ trips or family travel; all I need is a destination and I’m ready to start exploring.  Hiking, animal excursions (especially if sloths are involved!), theme parks, MLB stadiums, national parks, quirky museums. I want to see, do and eat it all. Popular Post: Walt Disney World Planning Tips for Large Families In February 2014, I was diagnosed with myopic macular degeneration, caused by pathological myopia. A lot of words that essentially mean I severely near-sighted and the strain on my retina is resulting in deterioration of my central vision. Although this has prompted me to make a lot of adjustments in my life, it’s also made me recognize how few resources exist for those with myopic macular degeneration.  One of my primary goals with starting this website is to provide guidance and encouragement for anyone else who has ever felt overwhelmed or isolated after receiving a similar diagnosis, and sharing what I’ve learned about myself and this condition from my own personal experiences. Popular Post:  Key Terms for Understanding Vision Loss Want to know more about me, how we can work together, or looking to request a media kit?  Send me an email at InSightFullLife@gmail.com! Theresa is a Maryland native who was diagnosed in 2014 with myopic macular degeneration. Being a “temporary visionary” doesn’t keep her from the things she loves: Disney, the Orioles and playing “You know what else that actor was in?” Learn more about Theresa. Enter your email address below to sign up for my mailing list!   © 2020 In Sight: Full Life    Privacy Policy and Disclosures  Disney+ was rightly praised by the visually impaired and blind communities with their announcement that all of the movies and series created for the platform would arrive with… Avengers: Assemble!  Sorry, you know I had to get that out of the way. The Disney+ streaming service has been a huge gift to Marvel fans who now have… Time to talk more Disney+!  After sharing my post detailing the Disney+ Accessibility Features, a lot of the discussion I saw on my social media feeds was about… Today I’ve got some news that hits the ultimate trifecta of my interests: Disney, Entertainment, and Accessibility!  In advance of their launch on November 12,  Disney has been… First look at the new Doctor! SHAZAM! Trailer! NEW CLONE WARS EPISODES!!!! The 2018 San Diego Comic-Con has come and gone, but people are going to be talking… I absolutely adore award shows, and I get so excited every year waiting to see who is going to receive nominations.  This morning the 2018 Emmy Nominations were… Guys. I love the Baltimore Orioles. Despite never having seen them in the World Series in my lifetime, I will forever be a permanent resident of Birdland. They actually… During the month of June, Turner Classic Movies is celebrating being “Mad About Musicals.” From June 3 to 30, they will be partnering with Ball State University to… Theresa is a Maryland native who is grateful to only be a 2-hour flight from Walt Disney World.  She loves exploring new locations & cuisines, and can beat anybody in a game of “Oh! You know what else that actor was in?” Despite being diagnosed with myopic macular degeneration, her spirit and sense of humor hasn't been dampened; she likes to tell people this simply makes her a “temporary visionary.” Read more About Me  or send an email to insightfulllife@gmail.com! Enter your email below to sign up for my mailing list!   Theresa is a Maryland native who was diagnosed in 2014 with myopic macular degeneration. Being a “temporary visionary” doesn’t keep her from the things she loves: Disney, the Orioles and playing “You know what else that actor was in?” Learn more about Theresa. Enter your email address below to sign up for my mailing list!   © 2020 In Sight: Full Life    Privacy Policy and Disclosures  Big news, y’all!  It’s no secret that I’m a major Disney fangirl. You probably realized that the moment you got here.  So when my friend Patty from No-Guilt… Theresa is a Maryland native who is grateful to only be a 2-hour flight from Walt Disney World.  She loves exploring new locations & cuisines, and can beat anybody in a game of “Oh! You know what else that actor was in?” Despite being diagnosed with myopic macular degeneration, her spirit and sense of humor hasn't been dampened; she likes to tell people this simply makes her a “temporary visionary.” Read more About Me  or send an email to insightfulllife@gmail.com! Enter your email below to sign up for my mailing list!   Theresa is a Maryland native who was diagnosed in 2014 with myopic macular degeneration. Being a “temporary visionary” doesn’t keep her from the things she loves: Disney, the Orioles and playing “You know what else that actor was in?” Learn more about Theresa. Enter your email address below to sign up for my mailing list!   © 2020 In Sight: Full Life    Privacy Policy and Disclosures  We know one of the reasons you love listening to the No-Guilt Disney podcast is for the listener stories – and we want you to share yours!  If you have a Memorable Moment, Cast Compliment, Unpopular Opinion, or any other topic you want us to discuss, fill out the No-Guilt Disney Podcast Submission Form and you may hear it in an upcoming episode!  Curious about the types of stories we’re looking for to share during upcoming episodes? Here’s what we want from you! ﻿ Not a fan of filling out forms? That’s okay! You can also email your story to NoGuiltDisneyPod@gmail.com and in the subject line write which category you’re submitting a story for.   Theresa is a Maryland native who is grateful to only be a 2-hour flight from Walt Disney World.  She loves exploring new locations & cuisines, and can beat anybody in a game of “Oh! You know what else that actor was in?” Despite being diagnosed with myopic macular degeneration, her spirit and sense of humor hasn't been dampened; she likes to tell people this simply makes her a “temporary visionary.” Read more About Me  or send an email to insightfulllife@gmail.com! Enter your email below to sign up for my mailing list!   Theresa is a Maryland native who was diagnosed in 2014 with myopic macular degeneration. Being a “temporary visionary” doesn’t keep her from the things she loves: Disney, the Orioles and playing “You know what else that actor was in?” Learn more about Theresa. Enter your email address below to sign up for my mailing list!   © 2020 In Sight: Full Life    Privacy Policy and Disclosures  After years of enviously scrolling through pictures online of friends attending Dapper Day at Walt Disney World and Disneyland, I was so excited to finally participate this year!… Theresa is a Maryland native who is grateful to only be a 2-hour flight from Walt Disney World.  She loves exploring new locations & cuisines, and can beat anybody in a game of “Oh! You know what else that actor was in?” Despite being diagnosed with myopic macular degeneration, her spirit and sense of humor hasn't been dampened; she likes to tell people this simply makes her a “temporary visionary.” Read more About Me  or send an email to insightfulllife@gmail.com! Enter your email below to sign up for my mailing list!   Theresa is a Maryland native who was diagnosed in 2014 with myopic macular degeneration. Being a “temporary visionary” doesn’t keep her from the things she loves: Disney, the Orioles and playing “You know what else that actor was in?” Learn more about Theresa. Enter your email address below to sign up for my mailing list!   © 2020 In Sight: Full Life    Privacy Policy and Disclosures  Throughout the year, the Disney Vacation Club hosts special events for it’s members – one of the most popular being the Moonlight Magic after hours events. Exclusive access… If you are planning your first Walt Disney World vacation or visiting Orlando for the 20th time, it’s not easy to choose which resort to book your… If there’s one vacation most kids dream about, it’s a trip to Disney. Turning that dream into a reality can feel overwhelming, especially if you are travelling as… One of my absolute favorite aspects of planning a Disney vacation is figuring out where I’m going to eat. Seriously, some people get excited watching ride videos or… Planning a Walt Disney World vacation for one family can feel overwhelming. Planning one for a large family with wide-ranging ages? I can sense your anxiety from here. … Theresa is a Maryland native who is grateful to only be a 2-hour flight from Walt Disney World.  She loves exploring new locations & cuisines, and can beat anybody in a game of “Oh! You know what else that actor was in?” Despite being diagnosed with myopic macular degeneration, her spirit and sense of humor hasn't been dampened; she likes to tell people this simply makes her a “temporary visionary.” Read more About Me  or send an email to insightfulllife@gmail.com! Enter your email below to sign up for my mailing list!   Theresa is a Maryland native who was diagnosed in 2014 with myopic macular degeneration. Being a “temporary visionary” doesn’t keep her from the things she loves: Disney, the Orioles and playing “You know what else that actor was in?” Learn more about Theresa. Enter your email address below to sign up for my mailing list!   © 2020 In Sight: Full Life    Privacy Policy and Disclosures ", "url": "https://www.insightfulllife.com/category/travel/"}