{"title": "AWS Marketplace: Homepage", "content": "                    What is AWS Marketplace?                                     Find, test, buy, and deploy software that runs on AWS.                 Teams at Vonage needed observability into all service data to easily detect problems and resolve them quickly. The company procured Epsagon from AWS Marketplace to gain insight into all its microservice workloads, go to market faster, and reduce troubleshooting time. To see more examples of how we have helped businesses with their software needs, please visit the customer success stories page. “AWS Marketplace helps us quickly subscribe to new SaaS solutions like Qubole. Payment is easy because we reuse our existing AWS payment terms.” “The AWS Marketplace makes it easy for customers to discover and procure our digital experience platform to help solve B2B, B2C, and B2E use cases.” “SaaS Subscriptions makes it easy to purchase and provision AWS-integrated services. We were up and running with Cloudyn in two clicks.” As champions of customer service, Zendesk provides the complete customer service solution that's easy to use and scales with your business. Trusted by over 160,000 businesses, Zendesk enables personalized and effortless conversational experiences across any channel and device. Setting your teams up... VMware Tanzu enables you to build, run and manage modern apps on any cloud---and continuously deliver value to your customers. With VMware Tanzu, you can simplify hybrid and multi-cloud operations and free developers to move faster with easy access to the right resources. VMware Tanzu enables development... Snowflake enables every organization to mobilize their data with the Data Cloud. Customers use the Data Cloud to unite siloed data, discover and securely share data, and execute diverse analytic workloads. Wherever data or users live, Snowflake delivers a single data experience that spans multiple clouds... Deliver higher quality and more comprehensive customer data to AWS in real time to drive better insights and engagements with Tealium. Our Customer Data Hub encompasses tag management, an API hub, a customer data platform with machine learning, and data management solutions that make customer data more... The SailPoint Identity Platform automates the management and control of a complex problem, delivering the right identity security access at exactly the right time. Harnessing the power of AI and machine learning, and a no-code extensibility framework, enterprises can easily discover, manage and secure... TiDB Cloud allows users with no training to handle complex tasks such as infrastructure management and cluster deployment. You will also get the massive scale and resiliency of TiDB databases in a fully managed Database as a Service (DBaaS), as well as:Real Time Operational Analytics: Run real-time... Ambyint SmartStream uncovers wells where production does not meet plan and shows engineers why those wells are off-plan - across the entire life cycle of the well. With too many wells and too few people, unscalable analytics tools, incomplete well histories, and changing conditions at the well site,... The Databricks Lakehouse Platform unifies your data warehousing and AI use cases on a single platform. It combines the best elements of data lakes and data warehouses to deliver the reliability, strong governance and performance of data warehouses with the openness, flexibility and machine learning... Red Hat OpenShift Service on AWS (ROSA) is a fully-managed and jointly supported Red Hat OpenShift offering that combines the power of Red Hat OpenShift, the industry's most comprehensive enterprise Kubernetes platform, and the AWS public cloud.Installation, monitoring, management, maintenance, and... Security built to fit DevOps with robust API's and automated protection. Lock down servers with Application Control, protect Docker containers, and increase malware protection with behavioral analysis, and predictive machine learning. Get proactive protection for EC2 workloads with Trend Micro Deep... Qlik Sense is a complete data analytics platform that sets the benchmark for a new generation of analytics. With its one-of-a-kind associative analytics engine, sophisticated AI, and scalable platform, you can empower everyone in your organization to make better decisions daily, creating a truly data-driven... HP Anyware (formerly known as Teradici CAS) is the enterprise software IT needs to keep people productive with secured access to their digital workspaces. It future proofs against ever-evolving infrastructure, network, and hybrid workforce demands with deployment flexibility for virtually any host environment... An encapsulated ML solution to optimise the estimate of customers' future spend or margin, giving your business a competitive edge. This solution helps in processing textual data to identify named entities present in the corpus of text. Platform for Automated Feature Engineering, Discovery and machine learning modeling at scale. Image Recognition and Classification with PyTorch Vision Resnet | Rearc Purpose-built for Kubernetes, Kasten K10 by Veeam provides enterprise operations teams an easy-to-use, scalable, and secure system for backup/restore, disaster recovery, and mobility of Kubernetes applications.LICENSING: - The version of Kasten K10 you are about to install comes with an embedded Starter... Subscribe to the hourly-metered Kpow SE-1 AWS Marketplace Container. Kpow is the all-in-one enterprise toolkit for monitoring and managing Kafka resources. Gain immediate insights into Kafka with fully integrated metrics and telemetry including Consumer Group & Kafka Streams visualizations.A breeze... NGINX Ingress Controller is a best-in-class traffic management solution for cloud-native apps in Kubernetes and containerized environments in Amazon EKS. Get your free 30-day trial today!   In a CNCF survey, nearly two-thirds of respondents reported using the NGINX Ingress Controller (more than all... Cribl Stream is a vendor neutral, purpose built streaming pipeline for logs, metrics, and observability data. Stream helps you implement what we call an observability pipeline, which allows you to route machine data from any source to any destination while transforming your data in motion to enrich... Lacework is the data-driven cloud security company, delivering end-to-end visibility and automated insight into risk across multicloud environments, so organizations can innovate with speed and safety. The Lacework Polygraph Data Platform uses data, behavioral analytics, and machine learning to automatically... CloudZero offers real-time cost anomaly and waste detection to optimize cloud costs and prevent accidental overspend.  With CloudZero, you can quickly understand your AWS bill, detect and remediate cost spikes, and measure the ROI of your cloud spend. The CloudZero Platform correlates engineering activity... The only future-proof electronic cloud-native lab notebook: Intuitive, easy to learn, fast to launch. PerkinElmer Signals Notebook spans Biology, Chemistry, Formulations, and Analysis Use Cases. It is the cloud-based electronic lab notebook (ELN) and scientific collaboration platform for today's scientists.... OnBase provides a broad spectrum of repeatable and turn-key industry and departmental solutions that are expertly tailored to meet specific business challenges. As an enterprise platform, Hyland's OnBase offers purpose-built integrations and connectors to core industry LOB systems such as Salesforce,... Clumio is a backup and recovery solution for Amazon data services such as S3, EC2/EBS, RDS, DynamoDB, and VMware Cloud on AWS. Clumio helps AWS customers protect application data, data lakes, sensitive information, and other business-critical data from- Accidental data loss such as inadvertent deletions,... As part of Cisco's Cloud connect portfolio, the DNA Advantage package for Catalyst 8000V (C8000V) delivers the maximum performance available in AWS cloud for virtual networking services. Deliver high-speed secure VPN services with High Availability, strong Firewall protection, Application Visibility... AWS Marketplace provides a new sales channel for ISVs and Consulting Partners to sell their solutions to AWS customers.  We make it easy for customers to find, buy, deploy and manage software solutions, including SaaS, in a matter of minutes. Come find out how to list your product and leverage this channel today.", "url": "https://aws.amazon.com/marketplace/?nc2=h_ql_mp", "threshold": 0.9999885896128868}