{"title": "Become an AWS Partner | AWS Partner Network", "content": "Interested in working with an AWS Partner? Connect with a partner » AWS Transforms the Partner Experience to Drive Greater Customer Value and Partner Profitability. Read the blog » The AWS Partner Network (APN) is a global community of partners that leverages programs, expertise, and resources to build, market, and sell customer offerings. This diverse network features 100,000 partners from more than 150 countries. As an AWS Partner, you are uniquely positioned to help customers take full advantage of all that AWS has to offer and accelerate their journey to the cloud. Together, partners and AWS can provide innovative solutions, solve technical challenges, win deals, and deliver value to our mutual customers.  Innovate, expand your customer reach, and grow your business with technical, marketing, and funding resources from AWS.   Leverage the latest AWS technologies to experiment, build, and deliver differentiated customer offerings.  Take advantage of the global reach, scalability, expertise, and robustness of AWS to expand your customer base and identify new opportunities.  Engage with AWS to enhance the value of your unique offerings with resources, programs, and benefits that drive greater profitability.  Engage with AWS Partner Paths, purpose-built to support and strengthen a range of customer offerings across software, hardware, services, training, or distribution. Innovate with AWS Partners » Spot.io’s revenue grew 300% after joining the AWS Global Startup Program with 40% of customers in its pipeline attributed to the program. Spot.io was shortly after acquired by NetApp and stated that the AWS Global Startup program was essential to its success   Read the story » Orca Security achieved unicorn status and $1.2 billion and amassed over $300 million in funding two years after joining the APN. Orca claims that its success would not have been possible without the APN, including its involvement in programs like ISV Accelerate and the AWS Service Delivery Program.  Read the story » Since achieving its AWS Retail Competency, Peak’s retail opportunities have grown by 113 percent. The AWS Retail Competency helped Peak land several high-value retail customers by increasing the company’s credibility, exposure, and customer trust.  Read the story » Capgemini used AWS technology and APN resources to create an AI solution that makes it easier to identify sperm whale tails and understand migration patterns over time. The solution matches whale tail images with 97.5% accuracy and gives researchers time to focus on tasks like migration tracking and habitat protection instead of manual image tagging.  Read the story » Joining the AWS Well-Architected Partner Program gave Eplexity access to new customers, boosted CSAT scores, and dropped customer remediation time from months to days. The company describes the program as a “truly a win on all fronts: for the customer, for AWS, and for us.”  Read the story » BMC Software Inc. (BMC) used the AWS SaaS Factory Program to help develop a software-as-a-service (SaaS) version its flagship Helix Control-M product. The SaaS Factory Program helped BMC reduce time to market, optimize costs, and get valuable insights into the business and technical aspects of SaaS development.   Read the story » Deepen your AWS knowledge and skills with digital and classroom trainings.  Explore AWS Training and Certification »  AWS Partner Newsletter » APN Blog » Partner Webinars » APN LinkedIn » APN Twitter »", "url": "https://aws.amazon.com/partners/?nc2=h_ql_pn", "threshold": 0.34189341283867036}