{"title": "Cloud Events, Webinars and Conferences - AWS", "content": "Event date: Nov. 27 – Dec. 1, 2023 AWS re:Invent is a learning conference for the global cloud computing community. The event features keynote announcements, training and certification opportunities, access to technical sessions, deep-dives with AWS leaders, and so much more. Subscribe for the latest updates about re:Invent 2023, or watch re:Invent 2022 content on demand.  Learn more »        Event date: Jun. 13 – 14, 2023  AWS re:Inforce is a 2-day, in-person security conference. Join us in Anaheim, CA to learn how AWS is innovating in the world of cloud security. You will find focused security, compliance, identity, and privacy content.  Register now »        AWS Global Summits are free events that bring the cloud computing community together to connect, collaborate, and learn about AWS.   View upcoming AWS Summits »    AWS Innovate Online Conference is a free online event designed to inspire and educate executives and IT professionals about AWS. Whether you are new to AWS or an experienced user, you can learn something new at AWS Innovate. AWS Innovate is designed to help you develop the right skills to design, deploy, and operate infrastructure and applications.  View upcoming AWS Innovate conferences » AWSome Day Online Conference is a free, online training event that will provide a step-by-step introduction to the core AWS services for compute, storage, databases, and networking. AWS technical experts will explain key features and use cases, share best practices, walk through technical demos, and be available to answer your questions one-on-one.  View upcoming AWSome Day conferences » AWS DevDays are free, technical events where developers will learn about some of the hottest topics in cloud computing. Join us for hands-on workshops, technical sessions, live demos, and networking with AWS technical experts and your peers.  Find an AWS DevDay near you »   AWS Training and Certification offers both online and in-person events to help you leverage the power of the AWS Cloud. These events are designed to cover various levels of technical expertise across a wide range of roles and topics—including exam readiness webinars for anyone looking to become AWS Certified. This is your opportunity to access the latest training events direct from the AWS experts!  Explore Training and Certification Events »  Join us for the AWS Financial Services Cloud Symposium, an event designed for financial services professionals seeking new strategies to drive business transformation. Find a Financial Services Cloud Symposium near you »  Come discover how organizations are transforming the energy industry and the innovations that can help you improve performance, accelerate innovation, transform the customer experience, maximize safety, and minimize your carbon footprint.  Find a Energy Symposium near you »  AWS Partner Webinars are live, virtual sessions presented by AWS experts and accredited AWS Partner Network (APN) Partners who have demonstrated technical proficiency and proven customer success in specialized solution areas such as: Artificial Intelligence/Machine Learning (AI/ML), Containers, IoT, and more. These webinars are ideal for IT Professionals, developers, and Business Leaders and feature live demonstrations, customer use cases and expert Q&A sessions.  View upcoming AWS Partner Webinars » The AWS Initiate Series is a global event series built for customers new to the cloud. Learn how similar organizations in your region are harnessing the AWS Cloud to achieve their missions. These events are ideal for IT professionals, developers, and business leaders who are interested in accelerating their cloud journey.  View upcoming AWS Initiate Events »  Presented by Amazon Web Services (AWS), the IMAGINE: Nonprofit conference is a no-cost event that brings together nonprofit leaders, technologists, and innovators to discuss how technology can drive a positive impact for both people and our planet. This in-person event combines thought leadership sessions, dynamic workshops, and networking opportunities to create an educational, collaborative, and inspirational experience you won't want to miss.  Learn more »  IMAGINE: The New World of Education online series elevates key conversations with leaders from across the global education community. Join us each month to discover how education institutions and organizations are innovating in the cloud to make sure learners of all ages have continued access to education.  View upcoming IMAGINE webinars »  AWS Public Sector Symposiums are no-cost events that bring public sector organizations together to learn about driving mission outcomes by building in the AWS Cloud.  Connect and collaborate with peers across government, education, nonprofit, healthcare, Aerospace & Satellite, and more. Attendees hear from AWS leaders, experts, partners, and customers and learn by attending technical breakout sessions and an inspirational keynote. View upcoming Symposiums »  Join the AWS Public Sector Summit Online virtually to deepen your cloud knowledge and gain new skills to design, deploy, and use the cloud for your mission.  Join the virtual experience now »  Whether you are new to the cloud or an experienced user, you will learn something new at AWS events. These events are designed to educate you about AWS products, services, and solutions and help you develop the skills to design, deploy, and operate infrastructure and applications. Event content is delivered by subject matter experts from AWS, our partners, and our customers, who share how they have successfully built solutions on AWS.", "url": "https://aws.amazon.com/events/?nc2=h_ql_ev", "threshold": 0.9950017443356485}