{"title": "Customer Enablement", "content": "AWS Customer Enablement services augment your team’s cloud skills by delivering deep AWS expertise where, when, and how you need it. You can get projects started faster, build high-performing applications more quickly, and continuously optimize costs. AWS Customer Enablement helps you move faster and achieve success with AWS. These services – AWS Support, AWS Managed Services, AWS Professional Services, AWS IQ, and AWS Training and Certification – are built and delivered by the most experienced cloud experts in the industry. No one has more experience helping customers find success in the cloud, and over the past 13 years our Customer Enablement teams have been obsessed with helping customers migrate and build faster in the cloud. The Amazon Partner Network (APN) complements and extends AWS Customer Enablement, giving you the broadest set of assistance options you need to achieve your goals in the cloud. No matter what kind of help you need and no matter how complex your challenge, AWS and our partners have a customer enablement service to help you quickly move forward.  People, programs, and tools that go beyond reactive break-fix services to optimize your AWS environment. Common use cases: issue resolution, cost and performance optimization, architectural guidance, planning and operational support for business-critical events Example: Wireless Car, owned by Volkswagon Group and Volvo Group, created Digital Vehicle services that connect cars, ecosystems, business flows, and fleets. AWS Support helped WirelessCar improve its applications and its utilization of AWS services, all while reducing the cost of services.   Infrastructure management and operation by AWS so you can reduce your operational overhead and risk and focus on your business applications. Common use cases: move to and operate faster in AWS, ensure security and compliance in the cloud Example: National Australia Bank migrated 30 applications to AWS in 50 days without needing internal cloud operations skills.  Specialized skills and experience to help you define and achieve results in the cloud. Common use cases: digital transformation, large scale migrations for datacenter closure, innovative application development. Example: Philips’ Healthcare Informatics Solutions and Services division worked with AWS Professional Services to build its HealthSuite digital platform. The platform analyzes and stores 15 PB of patient data gathered from 390 million imaging studies, medical records, and patients.  Complete your AWS projects faster with help from third-party AWS Certified experts.  Common use cases: hands-on assistance for short-term projects, learning about AWS, planning AWS projects, setting up AWS services, migrating to AWS, estimating and optimizing AWS spend Example: With more than 15 million users, Anaconda provides a popular data science platform and a foundation of modern machine learning. Anaconda used AWS IQ to work with AWS Certified third-party experts. This shaved weeks off Anaconda’s high priority project and enabled them to deliver value for their customers sooner.  Resources developed by AWS to quickly advance your team’s skills and knowledge.  Common use cases: build cloud fluency throughout organization, create a culture of innovation, develop adaptable and continuous learning mechanisms Example: MicroFocus, the 6th largest software company in the world, worked with AWS Training and Certification to get over 1,300 employees worldwide trained in AWS services. Beyond training, the certification programs accelerated MicroFocus’ business because employees got real, hands-on experience with AWS, enabling them to build faster and better.   A community-driven, knowledge-sharing service to help you quickly remove technical roadblocks in the AWS cloud.  Common use cases: Search for guidance, post questions, and propose answers about Architecture Strategy, Application Integration, Blockchain, Compute, DevOps, Internet of Things, Serverless, and many more. Example:  “Where can we find the IPs of the Amazon EKS service?” or “Is there a way to alias the Amazon Managed Grafana endpoint in Route53?\"  AWS has unmatched experience, maturity, reliability, security, and performance. AWS has been delivering cloud services for over 13 years to millions of customers around the world running a wide variety of use cases. AWS Customer Enablement, along with our tens of thousands of global systems integrators (SIs) who specialize in AWS services, have the expertise to help you speed your journey.   AWS Customer Enablement offers the broadest set of expertise-based services to help you succeed. We help you set business and technical strategies based on your desired outcomes. We give you proactive architectural guidance and ensure issues are resolved quickly. We even operate your infrastructure for you if needed.   AWS Customer Enablement helps you develop your team’s skills so you can rapidly innovate in the cloud. We help reskill your teams as necessary to migrate and operate within the cloud, and continuously upskill your teams in lockstep with the rapid pace of innovation.   - Steve Day, Executive GM, Infrastructure, Cloud, and Workplace, National Australia Bank National Australia Bank (NAB) is the largest business bank in Australia, and supports companies at every stage of the business lifecycle. NAB was slowed down by their existing capabilities and realized that a digital and technical transformation would help them move faster, be more agile, relevant, and resilient in servicing their customers’ needs. Taking advantage of AWS Customer Enablement services has smoothed the path for NAB’s digital transformation, improving internal operations and customer service. NAB customers have seen dramatic service improvements as a result of its digital transformation. The bank has migrated over 400 services to the cloud and achieved 100 percent availability for the cloud services supporting these applications.  Watch the video » Read the case study » - Mike Bandy, VP of Infrastructure and Operations, Sallie Mae Sallie Mae is a US-based bank that provides financing and know-how for college-bound students, and it offers products and resources to help customers make new goals and experiences possible beyond college. Sallie Mae leveraged the AWS Customer Enablement services of AWS Managed Services (AMS) and AWS Professional Services to meet their deadline for an accelerated data center migration to go all-in on cloud services so they could start innovating. With AMS and AWS Professional Services, Sallie Mae achieved measurable operational efficiencies including a 30% reduction in planned maintenance through automating software patching as well as a 30% decrease in overall costs, which allowed them to meet their savings objective in the first year. Read the case study »  - Aaron Lake, VP of Cloud, Verizon Media With brands including Yahoo, HuffPost, and TechCrunch, Verizon Media transforms the way people stay informed and get entertained. Verizon Media’s IT department must support each of its brands and their customers in a seamless manner across multiple touchpoints. AWS Support helps Verizon Media build trust with its brand divisions, and its customers, by proactively making sure issues are avoided through features such as Infrastructure Event Management (IEM). IEM provides guidance, planning, and operational support for large-scale events such as product or application launches and migrations. It is one of several proactive planning programs offered by AWS Support as a way to avoid downstream issues. - Manish Govil, Global AWS Business Head, Wipro Wipro Technologies is among the largest global IT services, BPO & Product Engineering companies. Wipro makes an ideal partner for organizations looking at transformational IT solutions because of its ability to deliver a wide range of technology & business consulting solutions and services.  Siemens Healthcare Diagnostics helps advance human health through innovation. Siemens has built an analytics platform to help caretakers personalize patient treatment plans through companion diagnostics testing. AWS provides Siemens with tools like AWS CloudTrail, Amazon CloudWatch, Auto Scaling, AWS CloudFormation, and AWS Identity and Access Management (IAM) to become more agile and achieve their mission. AWS Professional Services helped Siemens define the business outcome of personalized patient treatment plans as well as how to use AWS services to quickly build a secure, HIPAA-compliant, and scalable platform on AWS. ", "url": "https://aws.amazon.com/customer-enablement/?nc2=h_ql_ce", "threshold": 0.9735389826660894}