{"title": "Wikipedia:File upload wizard - Wikipedia", "content": " Outer space, commonly referred to simply as space, is the expanse that exists beyond Earth and its atmosphere and between celestial bodies. Outer space is not completely empty; it is a near-perfect vacuum[1] containing a low density of particles, predominantly a plasma of hydrogen and helium, as well as electromagnetic radiation, magnetic fields, neutrinos, dust, and cosmic rays. The baseline temperature of outer space, as set by the background radiation from the Big Bang, is 2.7 kelvins (−270 °C; −455 °F).[2] The plasma between galaxies is thought to account for about half of the baryonic (ordinary) matter in the universe, having a number density of less than one hydrogen atom per cubic metre and a kinetic temperature of millions of kelvins.[3] Local concentrations of matter have condensed into stars and galaxies. Intergalactic space takes up most of the volume of the universe, but even galaxies and star systems consist almost entirely of empty space. Most of the remaining mass-energy in the observable universe is made up of an unknown form, dubbed dark matter and dark energy.[4][5][6][7] Outer space does not begin at a definite altitude above Earth's surface. The Kármán line, an altitude of 100 km (62 mi) above sea level,[8][9] is conventionally used as the start of outer space in space treaties and for aerospace records keeping. Certain portions of the upper stratosphere and the mesosphere are sometimes referred to as \"near space\". The framework for international space law was established by the Outer Space Treaty, which entered into force on 10 October 1967. This treaty precludes any claims of national sovereignty and permits all states to freely explore outer space. Despite the drafting of UN resolutions for the peaceful uses of outer space, anti-satellite weapons have been tested in Earth orbit. Humans began the physical exploration of space during the 20th century with the advent of high-altitude balloon flights. This was followed by crewed rocket flights and, then, crewed Earth orbit, first achieved by Yuri Gagarin of the Soviet Union in 1961. The economic cost of putting objects, including humans, into space is very high, limiting human spaceflight to low Earth orbit and the Moon. On the other hand, uncrewed spacecraft have reached all of the known planets in the Solar System. Outer space represents a challenging environment for human exploration because of the hazards of vacuum and radiation. Microgravity has a negative effect on human physiology that causes both muscle atrophy and bone loss. The size of the whole universe is unknown, and it might be infinite in extent.[10] According to the Big Bang theory, the very early Universe was an extremely hot and dense state about 13.8 billion years ago[11] which rapidly expanded. About 380,000 years later the Universe had cooled sufficiently to allow protons and electrons to combine and form hydrogen—the so-called recombination epoch. When this happened, matter and energy became decoupled, allowing photons to travel freely through the continually expanding space.[12] Matter that remained following the initial expansion has since undergone gravitational collapse to create stars, galaxies and other astronomical objects, leaving behind a deep vacuum that forms what is now called outer space.[13] As light has a finite velocity, this theory constrains the size of the directly observable universe.[12] The present day shape of the universe has been determined from measurements of the cosmic microwave background using satellites like the Wilkinson Microwave Anisotropy Probe. These observations indicate that the spatial geometry of the observable universe is \"flat\", meaning that photons on parallel paths at one point remain parallel as they travel through space to the limit of the observable universe, except for local gravity.[14] The flat Universe, combined with the measured mass density of the Universe and the accelerating expansion of the Universe, indicates that space has a non-zero vacuum energy, which is called dark energy.[15] Estimates put the average energy density of the present day Universe at the equivalent of 5.9 protons per cubic meter, including dark energy, dark matter, and baryonic matter (ordinary matter composed of atoms). The atoms account for only 4.6% of the total energy density, or a density of one proton per four cubic meters.[16] The density of the Universe is clearly not uniform; it ranges from relatively high density in galaxies—including very high density in structures within galaxies, such as planets, stars, and black holes—to conditions in vast voids that have much lower density, at least in terms of visible matter.[17] Unlike matter and dark matter, dark energy seems not to be concentrated in galaxies: although dark energy may account for a majority of the mass-energy in the Universe, dark energy's influence is 5 orders of magnitude smaller than the influence of gravity from matter and dark matter within the Milky Way.[18] Outer space is the closest known approximation to a perfect vacuum. It has effectively no friction, allowing stars, planets, and moons to move freely along their ideal orbits, following the initial formation stage. The deep vacuum of intergalactic space is not devoid of matter, as it contains a few hydrogen atoms per cubic meter.[20] By comparison, the air humans breathe contains about 1025 molecules per cubic meter.[21][22] The low density of matter in outer space means that electromagnetic radiation can travel great distances without being scattered: the mean free path of a photon in intergalactic space is about 1023 km, or 10 billion light years.[23] In spite of this, extinction, which is the absorption and scattering of photons by dust and gas, is an important factor in galactic and intergalactic astronomy.[24] Stars, planets, and moons retain their atmospheres by gravitational attraction. Atmospheres have no clearly delineated upper boundary: the density of atmospheric gas gradually decreases with distance from the object until it becomes indistinguishable from outer space.[25] The Earth's atmospheric pressure drops to about 0.032 Pa at 100 kilometres (62 miles) of altitude,[26] compared to 100,000 Pa for the International Union of Pure and Applied Chemistry (IUPAC) definition of standard pressure. Above this altitude, isotropic gas pressure rapidly becomes insignificant when compared to radiation pressure from the Sun and the dynamic pressure of the solar wind. The thermosphere in this range has large gradients of pressure, temperature and composition, and varies greatly due to space weather.[27] The temperature of outer space is measured in terms of the kinetic activity of the gas,[28] as it is on Earth. The radiation of outer space has a different temperature than the kinetic temperature of the gas, meaning that the gas and radiation are not in thermodynamic equilibrium.[29][30] All of the observable universe is filled with photons that were created during the Big Bang, which is known as the cosmic microwave background radiation (CMB). (There is quite likely a correspondingly large number of neutrinos called the cosmic neutrino background.[31]) The current black body temperature of the background radiation is about 3 K (−270 °C; −454 °F).[32] The gas temperatures in outer space can vary widely. For example, the temperature in the Boomerang Nebula is 1 K,[33] while the solar corona reaches temperatures over 1.2–2.6 million K.[34] Magnetic fields have been detected in the space around just about every class of celestial object. Star formation in spiral galaxies can generate small-scale dynamos, creating turbulent magnetic field strengths of around 5–10 μG. The Davis–Greenstein effect causes elongated dust grains to align themselves with a galaxy's magnetic field, resulting in weak optical polarization. This has been used to show ordered magnetic fields exist in several nearby galaxies. Magneto-hydrodynamic processes in active elliptical galaxies produce their characteristic jets and radio lobes. Non-thermal radio sources have been detected even among the most distant, high-z sources, indicating the presence of magnetic fields.[35] Outside a protective atmosphere and magnetic field, there are few obstacles to the passage through space of energetic subatomic particles known as cosmic rays. These particles have energies ranging from about 106 eV up to an extreme 1020 eV of ultra-high-energy cosmic rays.[36] The peak flux of cosmic rays occurs at energies of about 109 eV, with approximately 87% protons, 12% helium nuclei and 1% heavier nuclei. In the high energy range, the flux of electrons is only about 1% of that of protons.[37] Cosmic rays can damage electronic components and pose a health threat to space travelers.[38] According to astronauts, like Don Pettit, space has a burned/metallic odor that clings to their suits and equipment, similar to the scent of an arc welding torch.[39][40] Despite the harsh environment, several life forms have been found that can withstand extreme space conditions for extended periods. Species of lichen carried on the ESA BIOPAN facility survived exposure for ten days in 2007.[41] Seeds of Arabidopsis thaliana and Nicotiana tabacum germinated after being exposed to space for 1.5 years.[42] A strain of Bacillus subtilis has survived 559 days when exposed to low Earth orbit or a simulated martian environment.[43] The lithopanspermia hypothesis suggests that rocks ejected into outer space from life-harboring planets may successfully transport life forms to another habitable world. A conjecture is that just such a scenario occurred early in the history of the Solar System, with potentially microorganism-bearing rocks being exchanged between Venus, Earth, and Mars.[44] Even at relatively low altitudes in the Earth's atmosphere, conditions are hostile to the human body. The altitude where atmospheric pressure matches the vapor pressure of water at the temperature of the human body is called the Armstrong line, named after American physician Harry G. Armstrong. It is located at an altitude of around 19.14 km (11.89 mi). At or above the Armstrong line, fluids in the throat and lungs boil away. More specifically, exposed bodily liquids such as saliva, tears, and liquids in the lungs boil away. Hence, at this altitude, human survival requires a pressure suit, or a pressurized capsule.[45] Out in space, sudden exposure of an unprotected human to very low pressure, such as during a rapid decompression, can cause pulmonary barotrauma—a rupture of the lungs, due to the large pressure differential between inside and outside the chest.[46] Even if the subject's airway is fully open, the flow of air through the windpipe may be too slow to prevent the rupture.[47] Rapid decompression can rupture eardrums and sinuses, bruising and blood seep can occur in soft tissues, and shock can cause an increase in oxygen consumption that leads to hypoxia.[48] As a consequence of rapid decompression, oxygen dissolved in the blood empties into the lungs to try to equalize the partial pressure gradient. Once the deoxygenated blood arrives at the brain, humans lose consciousness after a few seconds and die of hypoxia within minutes.[49] Blood and other body fluids boil when the pressure drops below 6.3 kPa, and this condition is called ebullism.[50] The steam may bloat the body to twice its normal size and slow circulation, but tissues are elastic and porous enough to prevent rupture. Ebullism is slowed by the pressure containment of blood vessels, so some blood remains liquid.[51][52] Swelling and ebullism can be reduced by containment in a pressure suit. The Crew Altitude Protection Suit (CAPS), a fitted elastic garment designed in the 1960s for astronauts, prevents ebullism at pressures as low as 2 kPa.[53] Supplemental oxygen is needed at 8 km (5 mi) to provide enough oxygen for breathing and to prevent water loss, while above 20 km (12 mi) pressure suits are essential to prevent ebullism.[54] Most space suits use around 30–39 kPa of pure oxygen, about the same as on the Earth's surface. This pressure is high enough to prevent ebullism, but evaporation of nitrogen dissolved in the blood could still cause decompression sickness and gas embolisms if not managed.[55] Humans evolved for life in Earth gravity, and exposure to weightlessness has been shown to have deleterious effects on human health. Initially, more than 50% of astronauts experience space motion sickness. This can cause nausea and vomiting, vertigo, headaches, lethargy, and overall malaise. The duration of space sickness varies, but it typically lasts for 1–3 days, after which the body adjusts to the new environment. Longer-term exposure to weightlessness results in muscle atrophy and deterioration of the skeleton, or spaceflight osteopenia. These effects can be minimized through a regimen of exercise.[56] Other effects include fluid redistribution, slowing of the cardiovascular system, decreased production of red blood cells, balance disorders, and a weakening of the immune system. Lesser symptoms include loss of body mass, nasal congestion, sleep disturbance, and puffiness of the face.[57] During long-duration space travel, radiation can pose an acute health hazard. Exposure to high-energy, ionizing cosmic rays can result in fatigue, nausea, vomiting, as well as damage to the immune system and changes to the white blood cell count. Over longer durations, symptoms include an increased risk of cancer, plus damage to the eyes, nervous system, lungs and the gastrointestinal tract.[58] On a round-trip Mars mission lasting three years, a large fraction of the cells in an astronaut's body would be traversed and potentially damaged by high energy nuclei.[59] The energy of such particles is significantly diminished by the shielding provided by the walls of a spacecraft and can be further diminished by water containers and other barriers. The impact of the cosmic rays upon the shielding produces additional radiation that can affect the crew. Further research is needed to assess the radiation hazards and determine suitable countermeasures.[60] There is no clear boundary between Earth's atmosphere and space, as the density of the atmosphere gradually decreases as the altitude increases. There are several standard boundary designations, namely: In 2009, scientists reported detailed measurements with a Supra-Thermal Ion Imager (an instrument that measures the direction and speed of ions), which allowed them to establish a boundary at 118 km (73.3 mi) above Earth. The boundary represents the midpoint of a gradual transition over tens of kilometers from the relatively gentle winds of the Earth's atmosphere to the more violent flows of charged particles in space, which can reach speeds well over 268 m/s (880 ft/s).[65][66] The Outer Space Treaty provides the basic framework for international space law. It covers the legal use of outer space by nation states, and includes in its definition of outer space, the Moon, and other celestial bodies. The treaty states that outer space is free for all nation states to explore and is not subject to claims of national sovereignty, calling outer space the \"province of all mankind\". This status as a common heritage of mankind has been used, though not without opposition, to enforce the right to access and shared use of outer space for all nations equally, particularly non-spacefaring nations.[67] It prohibits the development of nuclear weapons in outer space. The treaty was passed by the United Nations General Assembly in 1963 and signed in 1967 by the USSR, the United States of America and the United Kingdom. As of 2017, 105 state parties have either ratified or acceded to the treaty. An additional 25 states signed the treaty, without ratifying it.[68][69] Since 1958, outer space has been the subject of multiple United Nations resolutions. Of these, more than 50 have been concerning the international co-operation in the peaceful uses of outer space and preventing an arms race in space.[70] Four additional space law treaties have been negotiated and drafted by the UN's Committee on the Peaceful Uses of Outer Space. Still, there remains no legal prohibition against deploying conventional weapons in space, and anti-satellite weapons have been successfully tested by the US, USSR, China,[71] and in 2019, India.[72] The 1979 Moon Treaty turned the jurisdiction of all heavenly bodies (including the orbits around such bodies) over to the international community. The treaty has not been ratified by any nation that currently practices human spaceflight.[73] In 1976, eight equatorial states (Ecuador, Colombia, Brazil, Congo, Zaire, Uganda, Kenya, and Indonesia) met in Bogotá, Colombia. With their \"Declaration of the First Meeting of Equatorial Countries\", or \"the Bogotá Declaration\", they claimed control of the segment of the geosynchronous orbital path corresponding to each country.[74] These claims are not internationally accepted.[75] A spacecraft enters orbit when its centripetal acceleration due to gravity is less than or equal to the centrifugal acceleration due to the horizontal component of its velocity. For a low Earth orbit, this velocity is about 7,800 m/s (28,100 km/h; 17,400 mph);[76] by contrast, the fastest piloted airplane speed ever achieved (excluding speeds achieved by deorbiting spacecraft) was 2,200 m/s (7,900 km/h; 4,900 mph) in 1967 by the North American X-15.[77] To achieve an orbit, a spacecraft must travel faster than a sub-orbital spaceflight. The energy required to reach Earth orbital velocity at an altitude of 600 km (370 mi) is about 36 MJ/kg, which is six times the energy needed merely to climb to the corresponding altitude.[78] Spacecraft with a perigee below about 2,000 km (1,200 mi) are subject to drag from the Earth's atmosphere,[79] which decreases the orbital altitude. The rate of orbital decay depends on the satellite's cross-sectional area and mass, as well as variations in the air density of the upper atmosphere. Below about 300 km (190 mi), decay becomes more rapid with lifetimes measured in days. Once a satellite descends to 180 km (110 mi), it has only hours before it vaporizes in the atmosphere.[80] The escape velocity required to pull free of Earth's gravitational field altogether and move into interplanetary space is about 11,200 m/s (40,300 km/h; 25,100 mph).[81] Space is a partial vacuum: its different regions are defined by the various magnetic fields and \"winds\" that dominate within them, and extend to the point at which those fields give way to those beyond. Geospace extends from Earth's atmosphere to the outer reaches of Earth's magnetic field, whereupon it gives way to the solar wind of interplanetary space.[82] Interplanetary space extends to the heliopause, whereupon the solar wind gives way to the magnetic fields of the interstellar medium.[83] Interstellar space then continues to the outer fringes of the galaxy, where it fades into the intergalactic void.[84] Near-Earth space is the region of outer space above the Kármán line, from low Earth orbits out to geostationary orbits.[85] This region includes the major orbits for artificial satellites and is the site of most of humanity's space activity. The region has seen high levels of space pollution, mainly in the form of space debris, threatening any space activity in this region. Geospace is a region of outer space near Earth that includes the upper atmosphere and magnetosphere.[82] The Van Allen radiation belts lie within the geospace. The outer boundary of geospace is the magnetopause, which forms an interface between the Earth's magnetosphere and the solar wind. The inner boundary is the ionosphere.[86] The variable space-weather conditions of geospace are affected by the behavior of the Sun and the solar wind; the subject of geospace is interlinked with heliophysics—the study of the Sun and its impact on the planets of the Solar System.[87] The day-side magnetopause is compressed by solar-wind pressure—the subsolar distance from the center of the Earth is typically 10 Earth radii. On the night side, the solar wind stretches the magnetosphere to form a magnetotail that sometimes extends out to more than 100–200 Earth radii.[88][89] For roughly four days of each month, the lunar surface is shielded from the solar wind as the Moon passes through the magnetotail.[90] Geospace is populated by electrically charged particles at very low densities, the motions of which are controlled by the Earth's magnetic field. These plasmas form a medium from which storm-like disturbances powered by the solar wind can drive electrical currents into the Earth's upper atmosphere. Geomagnetic storms can disturb two regions of geospace, the radiation belts and the ionosphere. These storms increase fluxes of energetic electrons that can permanently damage satellite electronics, interfering with shortwave radio communication and GPS location and timing.[91] Magnetic storms can also be a hazard to astronauts, even in low Earth orbit. They create aurorae seen at high latitudes in an oval surrounding the geomagnetic poles.[92] Although it meets the definition of outer space, the atmospheric density within the first few hundred kilometers above the Kármán line is still sufficient to produce significant drag on satellites.[80] This region contains material left over from previous crewed and uncrewed launches that are a potential hazard to spacecraft. Some of this debris re-enters Earth's atmosphere periodically.[93] Translunar space is the region of lunar transfer orbits, between the Moon and Earth.[94]Cislunar space is a region outside of Earth that includes lunar orbit, the Moon's orbital space around Earth and the Lagrange points.[95] xGeo space is a concept used by the US to refer to space of High Earth Orbits, ranging from beyond geosynchronous orbit (GEO) at approximately 35,786 km (22,236 mi),[96] out to the L2 Earth-Moon Lagrange point at 448,900 km (278,934 mi). This is located beyond the orbit of the Moon and therefore includes cislunar space.[97] The region where Earth's gravity well remains dominant against gravitational perturbations from the Sun is the planet's Hill sphere.[98] This includes all space from the Earth to a distance of roughly 1% of the mean distance from Earth to the Sun,[99] or 1.5 million km (0.93 million mi). Beyond Earth's Hill sphere extends along Earth's orbital path its orbital and co-orbital space. This space is co-populated by groups of co-orbital Near-Earth Objects (NEOs), such as horseshoe librators and Earth trojans, with some NEOs at times becoming temporary satellites and quasi-moons to Earth. Deep space is defined by the United States government as region of space beyond low-Earth orbit, including cislunar space.[100] Others vary the starting point from beyond cislunar space to beyond the solar system.[101][102][103] The International Telecommunication Union responsible for radio communication, including with satellites, defines the beginning of deep space at 2 million km (1.2 million mi),[104] which is about five times the Moon's orbital distance. Interplanetary space is defined by the solar wind, a continuous stream of charged particles emanating from the Sun that creates a very tenuous atmosphere (the heliosphere) for billions of kilometers into space. This wind has a particle density of 5–10 protons/cm3 and is moving at a velocity of 350–400 km/s (780,000–890,000 mph).[105] Interplanetary space extends out to the heliopause where the influence of the galactic environment starts to dominate over the magnetic field and particle flux from the Sun.[83] The distance and strength of the heliopause varies depending on the activity level of the solar wind.[106] The heliopause in turn deflects away low-energy galactic cosmic rays, with this modulation effect peaking during solar maximum.[107] The volume of interplanetary space is a nearly total vacuum, with a mean free path of about one astronomical unit at the orbital distance of the Earth. This space is not completely empty, and is sparsely filled with cosmic rays, which include ionized atomic nuclei and various subatomic particles. There is also gas, plasma and dust,[108] small meteors, and several dozen types of organic molecules discovered to date by microwave spectroscopy.[109] A cloud of interplanetary dust is visible at night as a faint band called the zodiacal light.[110] Interplanetary space contains the magnetic field generated by the Sun.[105] There are magnetospheres generated by planets such as Jupiter, Saturn, Mercury and the Earth that have their own magnetic fields. These are shaped by the influence of the solar wind into the approximation of a teardrop shape, with the long tail extending outward behind the planet. These magnetic fields can trap particles from the solar wind and other sources, creating belts of charged particles such as the Van Allen radiation belts. Planets without magnetic fields, such as Mars, have their atmospheres gradually eroded by the solar wind.[111] Interstellar space is the physical space within a galaxy beyond the influence each star has upon the encompassed plasma.[84] The contents of interstellar space are called the interstellar medium. Approximately 70% of the mass of the interstellar medium consists of lone hydrogen atoms; most of the remainder consists of helium atoms. This is enriched with trace amounts of heavier atoms formed through stellar nucleosynthesis. These atoms are ejected into the interstellar medium by stellar winds or when evolved stars begin to shed their outer envelopes such as during the formation of a planetary nebula.[112] The cataclysmic explosion of a supernova generates an expanding shock wave consisting of ejected materials that further enrich the medium.[113] The density of matter in the interstellar medium can vary considerably: the average is around 106 particles per m3,[114] but cold molecular clouds can hold 108–1012 per m3.[29][112] A number of molecules exist in interstellar space, as can tiny 0.1 μm dust particles.[115] The tally of molecules discovered through radio astronomy is steadily increasing at the rate of about four new species per year. Large regions of higher density matter known as molecular clouds allow chemical reactions to occur, including the formation of organic polyatomic species. Much of this chemistry is driven by collisions. Energetic cosmic rays penetrate the cold, dense clouds and ionize hydrogen and helium, resulting, for example, in the trihydrogen cation. An ionized helium atom can then split relatively abundant carbon monoxide to produce ionized carbon, which in turn can lead to organic chemical reactions.[116] The local interstellar medium is a region of space within 100 parsecs (pc) of the Sun, which is of interest both for its proximity and for its interaction with the Solar System. This volume nearly coincides with a region of space known as the Local Bubble, which is characterized by a lack of dense, cold clouds. It forms a cavity in the Orion Arm of the Milky Way galaxy, with dense molecular clouds lying along the borders, such as those in the constellations of Ophiuchus and Taurus. (The actual distance to the border of this cavity varies from 60 to 250 pc or more.) This volume contains about 104–105 stars and the local interstellar gas counterbalances the astrospheres that surround these stars, with the volume of each sphere varying depending on the local density of the interstellar medium. The Local Bubble contains dozens of warm interstellar clouds with temperatures of up to 7,000 K and radii of 0.5–5 pc.[117] When stars are moving at sufficiently high peculiar velocities, their astrospheres can generate bow shocks as they collide with the interstellar medium. For decades it was assumed that the Sun had a bow shock. In 2012, data from Interstellar Boundary Explorer (IBEX) and NASA's Voyager probes showed that the Sun's bow shock does not exist. Instead, these authors argue that a subsonic bow wave defines the transition from the solar wind flow to the interstellar medium.[118][119] A bow shock is the third boundary of an astrosphere after the termination shock and the astropause (called the heliopause in the Solar System).[119] Intergalactic space is the physical space between galaxies. Studies of the large-scale distribution of galaxies show that the Universe has a foam-like structure, with groups and clusters of galaxies lying along filaments that occupy about a tenth of the total space. The remainder forms huge voids that are mostly empty of galaxies. Typically, a void spans a distance of 7–30 megaparsecs.[120] Surrounding and stretching between galaxies, there is a rarefied plasma[121] that is organized in a galactic filamentary structure.[122] This material is called the intergalactic medium (IGM). The density of the IGM is 5–200 times the average density of the Universe.[123] It consists mostly of ionized hydrogen; i.e. a plasma consisting of equal numbers of electrons and protons. As gas falls into the intergalactic medium from the voids, it heats up to temperatures of 105 K to 107 K,[3] which is high enough so that collisions between atoms have enough energy to cause the bound electrons to escape from the hydrogen nuclei; this is why the IGM is ionized. At these temperatures, it is called the warm–hot intergalactic medium (WHIM). (Although the plasma is very hot by terrestrial standards, 105 K is often called \"warm\" in astrophysics.) Computer simulations and observations indicate that up to half of the atomic matter in the Universe might exist in this warm–hot, rarefied state.[123][124][125] When gas falls from the filamentary structures of the WHIM into the galaxy clusters at the intersections of the cosmic filaments, it can heat up even more, reaching temperatures of 108 K and above in the so-called intracluster medium (ICM).[126] In 350 BCE, Greek philosopher Aristotle suggested that nature abhors a vacuum, a principle that became known as the horror vacui. This concept built upon a 5th-century BCE ontological argument by the Greek philosopher Parmenides, who denied the possible existence of a void in space.[127] Based on this idea that a vacuum could not exist, in the West it was widely held for many centuries that space could not be empty.[128] As late as the 17th century, the French philosopher René Descartes argued that the entirety of space must be filled.[129] In ancient China, the 2nd-century astronomer Zhang Heng became convinced that space must be infinite, extending well beyond the mechanism that supported the Sun and the stars. The surviving books of the Hsüan Yeh school said that the heavens were boundless, \"empty and void of substance\". Likewise, the \"sun, moon, and the company of stars float in the empty space, moving or standing still\".[130] The Italian scientist Galileo Galilei knew that air had mass and so was subject to gravity. In 1640, he demonstrated that an established force resisted the formation of a vacuum. It would remain for his pupil Evangelista Torricelli to create an apparatus that would produce a partial vacuum in 1643. This experiment resulted in the first mercury barometer and created a scientific sensation in Europe. The French mathematician Blaise Pascal reasoned that if the column of mercury was supported by air, then the column ought to be shorter at higher altitude where the air pressure is lower.[131] In 1648, his brother-in-law, Florin Périer, repeated the experiment on the Puy de Dôme mountain in central France and found that the column was shorter by three inches. This decrease in pressure was further demonstrated by carrying a half-full balloon up a mountain and watching it gradually expand, then contract upon descent.[132] In 1650, German scientist Otto von Guericke constructed the first vacuum pump: a device that would further refute the principle of horror vacui. He correctly noted that the atmosphere of the Earth surrounds the planet like a shell, with the density gradually declining with altitude. He concluded that there must be a vacuum between the Earth and the Moon.[133] Back in the 15th century, German theologian Nicolaus Cusanus speculated that the Universe lacked a center and a circumference. He believed that the Universe, while not infinite, could not be held as finite as it lacked any bounds within which it could be contained.[134] These ideas led to speculations as to the infinite dimension of space by the Italian philosopher Giordano Bruno in the 16th century. He extended the Copernican heliocentric cosmology to the concept of an infinite Universe filled with a substance he called aether, which did not resist the motion of heavenly bodies.[135] English philosopher William Gilbert arrived at a similar conclusion, arguing that the stars are visible to us only because they are surrounded by a thin aether or a void.[136] This concept of an aether originated with ancient Greek philosophers, including Aristotle, who conceived of it as the medium through which the heavenly bodies move.[137] The concept of a Universe filled with a luminiferous aether retained support among some scientists until the early 20th century. This form of aether was viewed as the medium through which light could propagate.[138] In 1887, the Michelson–Morley experiment tried to detect the Earth's motion through this medium by looking for changes in the speed of light depending on the direction of the planet's motion. The null result indicated something was wrong with the concept. The idea of the luminiferous aether was then abandoned. It was replaced by Albert Einstein's theory of special relativity, which holds that the speed of light in a vacuum is a fixed constant, independent of the observer's motion or frame of reference.[139][140] The first professional astronomer to support the concept of an infinite Universe was the Englishman Thomas Digges in 1576.[141] But the scale of the Universe remained unknown until the first successful measurement of the distance to a nearby star in 1838 by the German astronomer Friedrich Bessel. He showed that the star system 61 Cygni had a parallax of just 0.31 arcseconds (compared to the modern value of 0.287″). This corresponds to a distance of over 10 light years.[142] In 1917, Heber Curtis noted that novae in spiral nebulae were, on average, 10 magnitudes fainter than galactic novae, suggesting that the former are 100 times further away.[143] The distance to the Andromeda Galaxy was determined in 1923 by American astronomer Edwin Hubble by measuring the brightness of cepheid variables in that galaxy, a new technique discovered by Henrietta Leavitt.[144] This established that the Andromeda galaxy, and by extension all galaxies, lay well outside the Milky Way.[145] The modern concept of outer space is based on the \"Big Bang\" cosmology, first proposed in 1931 by the Belgian physicist Georges Lemaître.[146] This theory holds that the universe originated from a very dense form that has since undergone continuous expansion. The earliest known estimate of the temperature of outer space was by the Swiss physicist Charles É. Guillaume in 1896. Using the estimated radiation of the background stars, he concluded that space must be heated to a temperature of 5–6 K. British physicist Arthur Eddington made a similar calculation to derive a temperature of 3.18 K in 1926. German physicist Erich Regener used the total measured energy of cosmic rays to estimate an intergalactic temperature of 2.8 K in 1933.[147] American physicists Ralph Alpher and Robert Herman predicted 5 K for the temperature of space in 1948, based on the gradual decrease in background energy following the then-new Big Bang theory.[147] The modern measurement of the cosmic microwave background is about 2.7K. The term outward space was used in 1842 by the English poet Lady Emmeline Stuart-Wortley in her poem \"The Maiden of Moscow\".[148] The expression outer space was used as an astronomical term by Alexander von Humboldt in 1845.[149] It was later popularized in the writings of H. G. Wells in 1901.[150] The shorter term space is older, first used to mean the region beyond Earth's sky in John Milton's Paradise Lost in 1667.[151][152] \"Spaceborne\" denotes existing in outer space, especially if carried by a spacecraft;[153][154] similarly, \"space-based\" means based in outer space or using space technology. For most of human history, space was explored by observations made from the Earth's surface—initially with the unaided eye and then with the telescope. Before reliable rocket technology, the closest that humans had come to reaching outer space was through balloon flights. In 1935, the U.S. Explorer II crewed balloon flight reached an altitude of 22 km (14 mi).[156] This was greatly exceeded in 1942 when the third launch of the German A-4 rocket climbed to an altitude of about 80 km (50 mi). In 1957, the uncrewed satellite Sputnik 1 was launched by a Russian R-7 rocket, achieving Earth orbit at an altitude of 215–939 kilometres (134–583 mi).[157] This was followed by the first human spaceflight in 1961, when Yuri Gagarin was sent into orbit on Vostok 1. The first humans to escape low Earth orbit were Frank Borman, Jim Lovell and William Anders in 1968 on board the U.S. Apollo 8, which achieved lunar orbit[158] and reached a maximum distance of 377,349 km (234,474 mi) from the Earth.[159] The first spacecraft to reach escape velocity was the Soviet Luna 1, which performed a fly-by of the Moon in 1959.[160] In 1961, Venera 1 became the first planetary probe. It revealed the presence of the solar wind and performed the first fly-by of Venus, although contact was lost before reaching Venus. The first successful planetary mission was the 1962 fly-by of Venus by Mariner 2.[161] The first fly-by of Mars was by Mariner 4 in 1964. Since that time, uncrewed spacecraft have successfully examined each of the Solar System's planets, as well their moons and many minor planets and comets. They remain a fundamental tool for the exploration of outer space, as well as for observation of the Earth.[162] In August 2012, Voyager 1 became the first man-made object to leave the Solar System and enter interstellar space.[163] The absence of air makes outer space an ideal location for astronomy at all wavelengths of the electromagnetic spectrum. This is evidenced by the spectacular pictures sent back by the Hubble Space Telescope, allowing light from more than 13 billion years ago—almost to the time of the Big Bang—to be observed.[164] Not every location in space is ideal for a telescope. The interplanetary zodiacal dust emits a diffuse near-infrared radiation that can mask the emission of faint sources such as extrasolar planets. Moving an infrared telescope out past the dust increases its effectiveness.[165] Likewise, a site like the Daedalus crater on the far side of the Moon could shield a radio telescope from the radio frequency interference that hampers Earth-based observations.[166] Uncrewed spacecraft in Earth orbit are an essential technology of modern civilization. They allow direct monitoring of weather conditions, relay long-range communications like television, provide a means of precise navigation, and allow remote sensing of the Earth. The latter role serves a wide variety of purposes, including tracking soil moisture for agriculture, prediction of water outflow from seasonal snow packs, detection of diseases in plants and trees, and surveillance of military activities.[167] The deep vacuum of space could make it an attractive environment for certain industrial processes, such as those requiring ultraclean surfaces.[168] Like asteroid mining, space manufacturing would require a large financial investment with little prospect of immediate return.[169] An important factor in the total expense is the high cost of placing mass into Earth orbit: $8,000–$27,000 per kg, according to a 2006 estimate (allowing for inflation since then).[170] The cost of access to space has declined since 2013. Partially reusable rockets such as the Falcon 9 have lowered access to space below 3500 dollars per kilogram. With these new rockets the cost to send materials into space remains prohibitively high for many industries. Proposed concepts for addressing this issue include, fully reusable launch systems, non-rocket spacelaunch, momentum exchange tethers, and space elevators.[171] Interstellar travel for a human crew remains at present only a theoretical possibility. The distances to the nearest stars mean it would require new technological developments and the ability to safely sustain crews for journeys lasting several decades. For example, the Daedalus Project study, which proposed a spacecraft powered by the fusion of deuterium and helium-3, would require 36 years to reach the \"nearby\" Alpha Centauri system. Other proposed interstellar propulsion systems include light sails, ramjets, and beam-powered propulsion. More advanced propulsion systems could use antimatter as a fuel, potentially reaching relativistic velocities.[172] In addition to astronomy and space travel, the ultracold temperature of outer space can be used as a renewable cooling technology for various applications on Earth through passive daytime radiative cooling,[173][174] which enhances longwave infrared (LWIR) thermal radiation heat transfer on the Earth's surface through the infrared window into outer space to lower ambient temperatures.[175][176] It became possible with the discovery to suppress solar heating with photonic metamaterials.[177] Apollo 10 (May 18–26, 1969) was the fourth crewed mission in the United States Apollo program, and the second to orbit the Moon. NASA described it as a \"dress rehearsal\" for the first Moon landing, and designated it an \"F\" mission. While John Young remained in the Command and Service Module orbiting the Moon, Tom Stafford and Gene Cernan flew the Apollo Lunar Module (pictured) to within 14.4 kilometers (7.8 nmi) of the lunar surface, the point at which powered descent for landing would begin on a landing mission, before rejoining Young in the Command and Service Module. While in the Lunar Module, Stafford and Cernan photographed the site where Apollo 11 would land two months later. After orbiting the Moon 31 times over 61.6 hours, Apollo 10 returned safely to Earth, setting a record that still stands for the highest velocity achieved by a crewed spacecraft. Both Young and Cernan would walk on the Moon later in the Apollo program; Stafford flew again in 1975 on Apollo–Soyuz. (Full article...) May 18: Global Accessibility Awareness Day (2023); Haitian Flag Day in Haiti (1803); Day of Remembrance for the Victims of Crimean Tatar Genocide in Ukraine Kumquats are a group of small fruit-bearing trees in the flowering plant family Rutaceae. Their taxonomy is disputed. They were previously classified as forming the now-historical genus Fortunella or placed within the genus Citrus, sensu lato. Different classifications have alternatively assigned them to anywhere from a single species, C. japonica, to numerous species representing each cultivar. This photograph, depicting one halved and two whole kumquats, was focus-stacked from 22 separate images. Photograph credit: Ivar Leidus Wikipedia is written by volunteer editors and hosted by the Wikimedia Foundation, a non-profit organization that also hosts a range of other volunteer projects: This Wikipedia is written in English. Many other Wikipedias are available; some of the largest are listed below.  Explore Wikipedia's contents Wikipedia is a compendium of the world's knowledge. If you know what you are looking for, type it into Wikipedia's search box. If, however, you need a bird's eye view of what Wikipedia has to offer, see its main contents pages below, which in turn list more specific pages. Wikipedia's main contents systems are arranged into these subject classifications. Each subject is further divided into subtopics.  Timelines list events chronologically, sometimes including links to articles with more detail.  There are several ways to find timelines: Of particular interest may be: You can help us keep Wikipedia up to date! The list below is for encyclopedia entries that describe and pertain to events happening on a current basis.  Speaking of reference works, various third-party classification systems have been mapped to Wikipedia articles, which can be accessed from these pages: Bibliographies list sources on a given topic, for verification or further reading outside Wikipedia: Overview articles summarize in prose a broad topic like biology, and also have illustrations and links to subtopics like cell biology, biographies like Carl Linnaeus, and other related articles like Human Genome Project. Outline pages have trees of topics in an outline format, which in turn are linked to further outlines and articles providing more detail.  Outlines show how important subtopics relate to each other based on how they are arranged in the tree, and they are useful as a more condensed, non-prose alternative to overview articles. List pages enumerate items of a particular type, such as the List of sovereign states or List of South Africans.  Wikipedia has \"lists of lists\" when there are too many items to fit on a single page, when the items can be sorted in different ways, or as a way of navigating lists on a topic (for example Lists of countries and territories or Lists of people).  There are several ways to find lists: Portals contain featured articles and images, news, categories, excerpts of key articles, links to related portals, and to-do lists for editors.  There are two ways to find portals: Glossaries are lists of terms with definitions. Wikipedia includes hundreds of alphabetical glossaries; they can be found in two ways: Wikipedia's collection of category pages is a classified index system.  It is automatically generated from category tags at the bottoms of articles and most other pages. Nearly all of the articles available so far on the website can be found through these subject indexes. If you are simply looking to browse articles by topic, there are two top-level pages to choose from: For biographies, see Category:People. Category:Contents is technically at the top of the category hierarchy, but contains many categories useful to editors but not readers. Special:Categories lists every category alphabetically. Vital articles are lists of subjects for which the English Wikipedia should have corresponding high-quality articles. They serve as centralized watchlists to track the quality status of Wikipedia's most important articles and to give editors guidance on which articles to prioritize for improvement. Featured content represents the best of Wikipedia, and has undergone a thorough review process to ensure that it meets the highest encyclopedic standards. Presented by type: Good articles are articles that meet a core set of editorial standards, the good article criteria, and successfully pass through the good article nomination process. They are well written, contain factually accurate and verifiable information, are broad in coverage, neutral in point of view, stable, and illustrated, where possible, by relevant images with suitable copyright licenses. Growing collections of Wikipedia articles are starting to become available as spoken word recordings as well. Wikipedia's alphabetical article indexes Types Topics Places, people and times Indices Edit instructions Disasters and accidents Health and environment International relations Law and crime Politics and elections Armed conflicts and attacks Disasters and accidents International relations Law and crime Politics and elections Science and technology Business and economy Disasters and accidents International relations Law and crime Armed conflicts and attacks Disasters and accidents International relations Politics and elections Armed conflicts and attacks Arts and culture International relations Politics and elections Armed conflicts and attacks Business and economy Disasters and accidents International relations Law and crime Sports Animation (Anime) · Architecture · Comics · Film (Horror, Science fiction) · Literature (Poetry) · Music (Classical, Country, Hip hop, Jazz, Latin, Metal, Rock, UK, US, Korea) · Radio · Television (Australia, Canada, Ireland, UK, Scotland, US) · Video games Elections · International leaders · Sovereign states · Sovereign state leaders · Territorial governors Archaeology · Biotechnology · Computing · Palaeontology · Quantum computing and communication · Senescence research · Space/Astronomy · Spaceflight · Sustainable energy research Climate change · Weather Aviation · Rail transport · Transportation technology Afghanistan · Albania · Algeria · Andorra · Angola · Antarctica · Antigua and Barbuda · Argentina · Armenia · Australia · Austria · Azerbaijan · Bangladesh · The Bahamas · Bahrain · Barbados · Belarus · Belgium · Belize · Benin · Bhutan · Bolivia · Bosnia and Herzegovina · Botswana · Brazil · Brunei · Bulgaria · Burkina Faso · Burundi · Cambodia · Cameroon · Canada · Cape Verde · Central African Republic · Chad · Chile · China · Colombia · Costa Rica · Comoros · Congo · D.R. Congo · Croatia · Cuba · Cyprus · Czech Republic · Denmark · Djibouti · Dominica · Dominican Republic · East Timor · Ecuador · Egypt · El Salvador · Eritrea · Estonia · Ethiopia · Eswatini · Equatorial Guinea · Fiji · Finland · France · Gabon · The Gambia · Georgia · Germany · Ghana · Greece · Grenada · Guatemala · Guinea · Guinea-Bissau · Guyana · Haiti · Honduras · Hong Kong · Hungary · Iceland · India · Indonesia · Iran · Iraq · Ireland · Israel · Italy · Ivory Coast · Jamaica · Japan · Jordan · Kazakhstan · Kenya · Kiribati · Kosovo · Kuwait · Kyrgyzstan · Laos · Latvia · Lebanon · Lesotho · Liberia ·  Liechtenstein · Libya · Lithuania · Luxembourg · Macau · Madagascar · Marshall Islands · Malawi · Malaysia · Maldives · Mali · Malta · Mauritania · Mauritius · Mexico · Micronesia · Moldova · Monaco · Mongolia · Montenegro · Morocco · Mozambique · Myanmar · Nauru · Namibia · Nepal · Netherlands · New Zealand · Nicaragua · Niger · Nigeria · North Korea · North Macedonia · Norway · Oman · Pakistan · Palau · Palestine · Panama · Papua New Guinea · Paraguay · Peru · Philippines · Poland · Portugal · Qatar · Romania · Russia · Rwanda · Saint Kitts and Nevis · Saint Lucia · Saint Vincent and the Grenadines · Samoa · San Marino · São Tomé and Príncipe · Saudi Arabia · Senegal · Serbia · Seychelles · Sierra Leone · Singapore · Slovakia · Slovenia · Somalia · South Africa · Solomon Islands · South Korea · South Sudan · Spain · Sri Lanka · Sudan · Suriname · Sweden · Switzerland · Syria · Taiwan · Tajikistan · Tanzania · Thailand · Togo · Tonga · Trinidad and Tobago · Tunisia · Turkey · Turkmenistan · Tuvalu · Uganda · Ukraine · United Arab Emirates · United Kingdom · United States · Uruguay · Uzbekistan · Vanuatu · Vatican City · Venezuela · Vietnam · Yemen · Zambia · Zimbabwe Establishments · Disestablishments Works · Introductions · Works entering the public domain  Damien McCormack (born 28 January 1987) is an Australian rules footballer formerly on the Western Bulldogs list in the Australian Football League (AFL). Recruited from the Dandenong Stingrays Under 18's with the 38th pick in the 2004 National Draft, McCormack showed enough improvement throughout season 2005 to make the Werribee Tigers Grand Final side in the Victorian Football League competition. Having been allocated the number 28 guernsey, McCormack is listed at 183 cm and 80 kg. He was delisted following the completion of the 2007 AFL season after failing to play any games with the senior team for the year.[1] McCormack spent the 2009 season with the South Australian National Football League team of Glenelg. After a promising pre-season, he underwent reconstructive surgery on his shoulder which ended his season. He has signed in 2009 for the MPNFL side Seaford Tigers, where he played his junior football and participated in the club's third consecutive premiership.  This Australian rules football biography of a person born in the 1980s is a stub. You can help Wikipedia by expanding it.   Wikipedia is a free online encyclopedia that anyone can edit in good faith, and tens of millions already have! Wikipedia's purpose is to benefit readers by containing information on all branches of knowledge. Hosted by the Wikimedia Foundation, it consists of freely editable content, whose articles also have numerous links to guide readers to more information. Written collaboratively by largely anonymous volunteers, anyone with Internet access (and who is not presently blocked) can write and make changes to Wikipedia articles, except in limited cases where editing is restricted to prevent disruption or vandalism. Since its creation on January 15, 2001, it has grown into the world's largest reference website, attracting over a billion visitors monthly. It currently has more than sixty-one million articles in more than 300 languages, including 6,657,661 articles in English with 125,164 active contributors in the past month. Wikipedia's fundamental principles are summarized in its five pillars. The Wikipedia community has developed many policies and guidelines, although editors do not need to be familiar with them before contributing. Anyone can edit Wikipedia's text, references, and images. What is written is more important than who writes it. The content must conform with Wikipedia's policies, including being verifiable by published sources. Editors' opinions, beliefs, personal experiences, unreviewed research, libelous material, and copyright violations will not remain. Wikipedia's software allows easy reversal of errors, and experienced editors watch and patrol bad edits. Wikipedia differs from printed references in important ways. It is continually created and updated, and encyclopedic articles on new events appear within minutes rather than months or years. Because anyone can improve Wikipedia, it has become more comprehensive, clear, and balanced than any other encyclopedia. Its contributors improve the quality and quantity of the articles as well as remove misinformation, errors, and vandalism. Any reader can fix a mistake or add more information to articles (see Researching with Wikipedia).  Begin by simply clicking the [edit] or [edit source] buttons or the pencil icon  at the top of any non-protected page or section. Wikipedia has tested the wisdom of the crowd since 2001 and found that it succeeds.  Introduction ReadersHow to report a problem with an article, or find out more information. Article subjectsProblems with articles about you, your company, or somebody you represent. LicensingHow to copy Wikipedia's information, donate your own, or report unlicensed use of your information. DonorsFind out about the process, how to donate, and information about how your money is spent. Press and partnershipsIf you're a member of the press looking to contact Wikipedia, or have a business proposal for us.  Back to main page  Thank you for your interest in contacting Wikipedia. Before proceeding, some important disclaimers: The links on the left should direct you to how to contact us or resolve problems. If you cannot find your issue listed there, you can email helpful, experienced volunteers at info-enwikimedia.org. Please refrain from emailing about disagreements with content; they will not be resolved via email.      Thank you for considering a donation to the Wikimedia Foundation, the nonprofit that hosts Wikipedia and other crucial free knowledge projects. Each year, because of the 2% of readers who give to support our mission, we can expand the reach of free knowledge to new corners of the world. If Wikipedia matters and is useful to you too, please join them and donate R$10, R$20, R$50 or whatever feels right to you today. Wikipedia is different. No advertising, no subscription fees, no paywalls. Those don't belong here. Wikipedia is a place to learn, free from bias or agenda. Today, we invite you to donate whatever feels right. Show the world that access to independent and unbiased information matters to you. Thank you.     Technology: Servers, bandwidth, maintenance, development. Wikipedia is one of the top 10 websites in the world, and it runs on a fraction of what other top websites spend. People and Projects: The other top websites have thousands of employees. We have about 700 staff and contractors to support a wide variety of projects, making your donation a great investment in a highly-efficient not-for-profit organization. Tax deductibility information We do not sell or trade your information to anyone. By donating, you agree to share your personal information with the Wikimedia Foundation, the nonprofit organization that hosts Wikipedia and other Wikimedia projects, and its service providers pursuant to our donor policy. Wikimedia Foundation and its service providers are located in the United States and in other countries whose privacy laws may not be equivalent to your own. For more information please read our donor policy. For recurring donors, fixed monthly payments will be debited by the Wikimedia Foundation on the monthly anniversary of the first donation, until such time as you notify us to discontinue them. Donations initiated on the 29, 30, or 31 of the month will recur on the last day of the month for shorter months, as close to the original date as possible. For questions, please contact donate@wikimedia.org.     This page provides help with the most common questions about Wikipedia. You can also search Wikipedia's help pages using the search box below, or browse the Help menu or the Help directory. The Readers' FAQ and our about page contain the most commonly sought information about Wikipedia. For simple searches, there is a search box at the top of every page. Type what you are looking for in the box. Partial matches will appear in a dropdown list. Select any page in the list to go to that page. Or, select the magnifying glass \"Go\" button, or press ↵ Enter, to go to a full search result. For advanced searches, see Help:Searching. There are other ways to browse and explore Wikipedia articles; many can be found at Wikipedia:Contents. See our disclaimer for cautions about Wikipedia's limitations. For mobile access, press the mobile view link at the very bottom of every desktop view page. Contributing is easy: see how to edit a page. For a quick summary on participating, see contributing to Wikipedia, and for a friendly tutorial, see our introduction. For a listing of introductions and tutorials by topic, see getting started. The Simplified Manual of Style and Cheatsheet can remind you of basic wiki markup. Be bold in improving articles! When adding facts, please provide references so others may verify them. If you are affiliated with the article subject, please see our conflict of interest guideline. The simple guide to vandalism cleanup can help you undo malicious edits. If you're looking for places you can help out, the Task Center is the place to go, or check out what else is happening at the community portal. You can practice editing and experiment in a sandboxyour sandbox. If there is a problem with an article about yourself, a family member, a friend or a colleague, please read Biographies of living persons/Help. If you spot a problem with an article, you can fix it directly, by clicking on the \"Edit\" link at the top of that page. See the \"edit an article\" section of this page for more information. If you don't feel ready to fix the article yourself, post a message on the article's talk page. This will bring the matter to the attention of others who work on that article. There is a \"Talk\" link at the beginning of every article page. You can contact us. If it's an article about you or your organization, see Contact us – Subjects. Check Your first article to see if your topic is appropriate, then the Article wizard will walk you through creating the article. Once you have created an article, see Writing better articles for guidance on how to improve it and what to include (like reference citations). For contributing images, audio or video files, see the Introduction to uploading images. Then the Upload wizard will guide you through that process. Answers to common problems can be found at frequently asked questions. Or check out where to ask questions or make comments. New users should seek help at the Teahouse if they're having problems editing Wikipedia.   More complex questions can be posed at the Help desk. Volunteers will respond as soon as they're able. Or ask for help on your talk page and a volunteer will visit you there! You can get live help with editing in the help chatroom. For help with technical issues, ask at the Village pump. If searching Wikipedia has not answered your question (for example, questions like \"Which country has the world's largest fishing fleet?\"), try the Reference Desk. Volunteers there will attempt to answer your questions on any topic, or point you toward the information you need. There are three basic steps to building a topic list for Wikipedia:  the first is to search Wikipedia to make sure it doesn't already have a list on the subject.  The second step is to hunt down every word you can find on the subject, from your own memory, books, web directories, dictionaries, etc.  Surround each term with double square brackets, and save the page. Because Wikipedia has become so extensive, don't be surprised if most or even all of the links turn out blue (those are live links, each leading to an article on Wikipedia).  Dead-end links are red, but don't remove them, because they show what articles Wikipedia is missing — anyone can click on a red link to create an article on that topic.  The third step is checking each live article in the list for links to related topics.  When you find one, add it to the list. Search Frequently Asked Questions Search the help desk archives  Wikipedia is made by people like you. Get startedPolicies and Guidelines EditingReferencingImagesTables EditingReferencingImagesTables Talk pagesNavigating WikipediaManual of StyleConclusion View all as single page For more training information, see also: Full help contents pageTraining for studentsA single-page guide to contributingA training adventure gameResources for new editors   This page provides a listing of current collaborations, tasks, and news about English Wikipedia. New to Wikipedia? See the contributing to Wikipedia page or our tutorial for everything you need to know to get started. For a listing of internal project pages of interest, see the department directory. For a listing of ongoing discussions and current requests, see the Dashboard. You can help improve the articles listed below! This list updates frequently, so check back here for more tasks to try. (See Wikipedia:Maintenance or the  Task Center for further information.) Help counter systemic bias by creating new articles on important women. Help improve popular pages, especially those of low quality. This week's article for improvement is: Audio editing software Previous selections:Tableau vivant ·Meadow ·Nike sweatshops This week's backlog of the week is: Category:All uncategorized pages  Welcome to the community bulletin board, which is a page used for announcements from WikiProjects and other groups. Included here are coordinated efforts, events, projects, and other general announcements. Yearly or infrequent events Monthly or continuous events  Also consider posting WikiProject, Task Force, and Collaboration news at The Signpost's WikiProject Report page. Please include your signature when adding a listing here. Latest tech news from the Wikimedia technical community. Please tell other users about these changes. Not all changes will affect you. Translations are available. Problems Changes later this week Future changes Tech news prepared by Tech News writers and posted by bot • Contribute • Translate • Get help • Give feedback • Subscribe or unsubscribe.  Discussions in the following areas have requested wider attention via Requests for comment:  To see a list of a user's contributions, go to their user page or user talk page.  When you do that, the menu item \"User contributions\" will appear in the Toolbox menu on the sidebar. This link will show you all the edits that user has ever made (except deleted edits), up to 500 per page. This is useful for tracking vandalism in progress. Edits with a \"top\" link are the most recent ones to their respective articles. You have your own contributions list, which is particularly useful for tracking your conversations on talk pages. If you are logged in, you can access the list from the \"Contributions\" link at the top of the page. To help keep track of your discussions on talk pages, you may wish to place the {{Discussion tracker}} template to your talk page.  This is a list of recent changes to Wikipedia. Thank you for offering to contribute an image or other media file for use on Wikipedia. This wizard will guide you through a questionnaire prompting you for the appropriate copyright and sourcing information for each file. Please ensure you understand copyright and the image use policy before proceeding.  Uploads to Wikimedia Commons  Upload a non-free file Uploads locally to Wikipedia; must comply with the non-free content criteria  You do not have JavaScript enabled Sorry, in order to use this uploading script, JavaScript must be enabled. You can still use the plain Special:Upload page to upload files to the English Wikipedia without JavaScript. You are not currently logged in. Sorry, in order to use this uploading script and to upload files, you need to be logged in with your named account. Please log in and then try again. Your account has not become confirmed yet. Sorry, in order to upload files on the English Wikipedia, you need to have a confirmed account. Normally, your account will become confirmed automatically once you have made 10 edits and four days have passed since you created it.      You may already be able to upload files on the Wikimedia Commons, but you can't do it on the English Wikipedia just yet. If the file you want to upload has a free license, please go to Commons and upload it there. Important note: if you don't want to wait until you are autoconfirmed, you may ask somebody else to upload a file for you at Wikipedia:Files for upload.  In very rare cases an administrator may make your account confirmed manually through a request at Wikipedia:Requests for permissions/Confirmed.  Sorry, a few special characters and character combinations cannot be used in the filename for technical reasons. This goes especially for # < > [ ] | : { } /  and ~~~. Your filename has been modified to avoid these. Please check if it is okay now. The filename you chose seems to be very short, or overly generic. Please don't use: A file of this name already exists on Commons! If you upload your file with this name, you will be masking the existing file and make it inaccessible. Your new file will be displayed everywhere the existing file was previously used. This should not be done, except in very rare exceptional cases. Please don't upload your file under this name, unless you seriously know what you are doing. Choose a different name for your new file instead.  A file of this name already exists. If you upload your file with this name, you will be overwriting the existing file. Your new file will be displayed everywhere the existing file was previously used. Please don't do this, unless you have a good reason to: It is very important that you read through the following options and questions, and provide all required information truthfully and carefully. Thank you for offering to upload a free work. Wikipedia loves free files. However, we would love it even more if you uploaded them on our sister project, the Wikimedia Commons.Files uploaded on Commons can be used immediately here on Wikipedia as well as on all its sister projects. Uploading files on Commons works just the same as here. Your Wikipedia account will automatically work on Commons too.   Please consider uploading your file on Commons. However, if you prefer to do it here instead, you may go ahead with this form. You can also first use this form to collect the information about your file and then send it to Commons from here. Please note that by \"entirely self-made\" we really mean just that.  Do not use this section for any of the following: Editors who falsely declare such items as their \"own work\" will be blocked from editing. Use this only if there is an explicit licensing statement in the source.  The website must explicitly say that the image is released under a license that allows free re-use for any purpose, e.g. the Creative Commons Attribution license. You must be able to point exactly to where it says this. If the source website doesn't say so explicitly, please do not upload the file. Public Domain means that nobody owns any copyrights on this work. It does not mean simply that it is freely viewable somewhere on the web or that it has been widely used by others.  This is not for images you simply found somewhere on the web. Most images on the web are under copyright and belong to somebody, even if you believe the owner won't care about that copyright. If it is in the public domain, you must be able to point to an actual law that makes it so. If you can't point to such a law but merely found this image somewhere, then please do not upload it.  Please remember that you will need to demonstrate that: This file will be used in the following article: Enter the name of exactly one Wikipedia article, without the [[...]] brackets and without the \"http://en.wikipedia.org/...\" URL code. It has to be an actual article, not a talkpage, template, user page, etc. If you plan to use the file in more than one article, please name only one of them here. Then, after uploading, open the image description page for editing and add your separate explanations for each additional article manually.  Example – article okay.  This article doesn't exist! The article Example could not be found. Please check the spelling, and make sure you enter the name of an existing article in which you will include this file. If this is an article you are only planning to write, please write it first and upload the file afterwards.  This is not an actual encyclopedia article! The page Example is not in the main article namespace. Non-free files can only be used in mainspace article pages, not on a user page, talk page, template, etc. Please upload this file only if it is going to be used in an actual article. If this page is an article draft in your user space, we're sorry, but we must ask you to wait until the page is ready and has been moved into mainspace, and only upload the file after that.  This is a disambiguation page! The page Example is not a real article, but a disambiguation page pointing to a number of other pages. Please check and enter the exact title of the actual target article you meant. If neither of these two statements applies, then please do not upload this image. This section is not for images used merely to illustrate an article about a person or thing, showing what that person or thing look like. In view of this, please explain how the use of this file will be minimal. Well, we're very sorry, but if you're not sure about this file's copyright status, or if it doesn't fit into any of the groups above, then: Please don't upload it. Really, please don't. Even if you think it would make for a great addition to an article. We really take these copyright rules very seriously on Wikipedia. Note that media is assumed to be fully-copyrighted unless shown otherwise; the burden is on the uploader. In particular, please don't upload: If you are in any doubt, please ask some experienced editors for advice before uploading. People will be happy to assist you at Wikipedia:Media copyright questions. Thank you. This is the data that will be submitted to upload:  Your file is being uploaded.  This might take a minute or two, depending on the size of the file and the speed of your internet connection. Once uploading is completed, you will find your new file at this link: File:Example.jpg Your file has been uploaded successfully and can now be found here: File:Example.jpg Please follow the link and check that the image description page has all the information you meant to include. If you want to change the description, just go to the image page, click the \"edit\" tab at the top of the page and edit just as you would edit any other page. Do not go through this upload form again, unless you want to replace the actual file with a new version. To insert this file into an article, you may want to use code similar to the following: If you wish to make a link to the file in text, without actually showing the image, for instance when discussing the image on a talk page, you can use the following (mark the \":\" after the initial brackets!): See Wikipedia:Picture tutorial for more detailed help on how to insert and position images in pages. Thank you for using the File Upload Wizard.Please leave your feedback, comments, bug reports or suggestions on the talk page. ", "url": "https://en.wikipedia.org/wiki/Wikipedia:File_upload_wizard"}