{"title": "Better Programming", "content": "Sign up Sign In Sign up Sign In 213K Followers Home About Write For Us Now in AI More from Medium Newsletters Aphinya Dechalert ·Pinned Member-only Like everything that’s new and shiny, Mojo 🔥 promises grand things —  AI is more than just hype, it’s spawned another programming language — except this time, it’s made specifically for creating AI-driven models. The peeps at Modular decided to call it Mojo. But what exactly is it? What are the perks? What about the cons? How does it impact us as… 9 min read 9 min read Vinita ·Pinned Member-only Where the head goes, the body follows. Perception precedes action. Right action follows the right perspective. —  When you’re having a bad day at work, your mind spirals into all sad things. It’s like someone dimmed the light around you and everything appears dark and gloomy. You’re more likely to lose your nerve or react poorly to even minor inconveniences. It may appear that others are out… 8 min read 8 min read Ruslan Kim ·Pinned Back in 2017, I had a great chance to rewrite a popular Android application that had over 30 million users. Of course that was a tremendous effort of the great team of engineers. But I had an opportunity to influence business decisions and then design architecture, and define tech that… 5 min read 5 min read Sofia Kirillova ·Pinned We present a new dataset that will make it easier to train models for the Face Parsing and Portrait Segmentation tasks, so we gave it such a name — EasyPortrait. —  Apps with video calls have grown in popularity in recent years. Many use them daily for work, school, or to keep in touch with friends and family. Therefore, the functionality of video conferencing software strongly began to increase, adding new features based on Machine Learning models to their ecosystem. 8 min read 8 min read Dan Carter ·Pinned The 2022 paper titled “Emergent Abilities of Large Language Models” [1] has been the source of much speculation — and much hysteria — about the future of AI [2], [3]. The paper’s central claim is that large language models (LLMs) display “emergent abilities” as they scale to larger and larger… 7 min read 7 min read Kenton Blacutt ·Pinned Looking toward the horizon, it’s highly probable that AI will author the lion’s share of all future code. As this evolution unfolds, our transparency into the AI’s processes will gradually diminish, potentially paving the way for unforeseen risks. This trajectory appears inevitable and could reach its zenith within a few… 7 min read 7 min read Martin Heinz ·Pinned Member-only True multi-core concurrency is coming to Python in 3.12 release and here’s how you can use it right now using sub-interpreter API —  Python is 32 years old language, yet it still doesn’t have proper, true parallelism/concurrency. This is going to change soon, thanks to the introduction of a “Per-Interpreter GIL” (Global Interpreter Lock) which will land in Python 3.12. While the release of Python 3.12 is some months away, the code is… 6 min read 6 min read Paolo Rechia ·Pinned Adjusting the behavior of an LLM to a specific use case —  In a previous article, I wrote about creating AI Agents with Langchain and a local LLM such as Vicuna. If you’re unfamiliar with the topic and are interested in learning more, I recommend that you read my previous article to get started. Today, I’m taking this idea a couple of… 16 min read 16 min read Harry Katz ·Pinned It might not be about getting promoted —  I changed jobs during the pandemic. I guess I was part of the Great Resignation. Hitting the anniversary at my new company got me thinking about my career. Have I had a good career so far? Has it been fulfilling? What does it even mean to have a fulfilling career? … 6 min read 6 min read Alex Martinelli ·Pinned Member-only Exploring automated 3D crowd generation methods, limitations, and potential improvements —  This article provides an overview of the process for generating diverse and realistic 3D crowds. We will begin by examining the current simplest approach, as well as its limitations, and explore possible paths for improvement. The process is broken down into three steps: generating 2D images reconstructing 3D objects 6 min read 6 min read Advice for programmers. Connect with Better Programming CEO at @medium. “Coach Tony” to some. My newsletter: https://coachtony.medium.com/subscribe Human bot and a Debugger at Better Programming. Satirist for controversial opinions. Freelance iOS dev. Mr. Chatterbox (per school teacher)linktr.ee/anupamchugh Caffeinating your stories, one cup at a time See all A newsletter covering the best programming articles published across Medium Take a look. By signing up, you will create a Medium account if you don’t already have one. Review our Privacy Policy for more information about our privacy practices. Help Status Writers Blog Careers Privacy Terms About Text to speech", "url": "https://medium.com/better-programming?source=home---------4---------------------3901f1f8_742d_4f4c_99a6_eeaf1fc46509-------7", "threshold": 0.6378392202164842}