{"title": "Colin Hodge – Medium", "content": "Sign up Sign In Sign up Sign In 754 Followers Home About 1 hour ago Entrepreneur's Handbook Thanks so much for allowing me to share my story with your audience of entrepreneurs, and special thanks to Stephen Moore, who helped to edit it! 1 min read 1 min read Published in Entrepreneur's Handbook ·6 days ago You know you’ve created a cultural phenomenon when the nation’s largest college Christian group declares your creation “the evilest app ever.” But that’s exactly what happened when I built Bang With Friends, a Facebook app that let users find out which of their friends wanted to… you know. Once my… 20 min read 20 min read Mar 25 A few months ago when I couldn’t fall asleep, an idea struck me. As the founder of a top 20 dating app in the US and second-time owner of said app, I often get random ideas that swirl together new tech trends with dating. This one was half humor and… 3 min read 3 min read Mar 26, 2020 How to keep grounded, happy, and calm at home during this coronavirus-forced isolation — and still get the most important work done. —  This post was originally titled How I stopped playing “Oscar the Grouch.” It all started on a brisk Taipei day in early 2018. While sharing a bike ride with a friend, she asked me a piercing question. “Well, aren’t you grumpy today?” That’s when I realized — I wasn’t the… 5 min read 5 min read Jul 23, 2019 Dear LiveAF Family and the team at M17 Entertainment, It is with bittersweet emotions that I am announcing my departure as Chief Growth Officer at M17 and as LiveAF CEO. I’ve made so many friends and learned an immense amount, but after over 3 years with the company, I’ve decided… 5 min read 5 min read Jan 9, 2017 Ever feel like men and women speak different languages? Are you frustrated trying to understand the chat-speak used in dating apps? … 5 min read 5 min read Sep 29, 2015 My good friend Megan recently turned 31 and collected some bits of wisdom from her friends. Here’s my homework — it’s only a month late! On life: Life is about stories. As kids, we learn through stories. As adults, our stories define our best memories, our friendships, and our careers. … 2 min read 2 min read Aug 16, 2015 3 steps to a successful hookup After hearing from many of Down’s users and having some escapades of my own, here are the 3 simple steps to a successful hookup. This is your quick guide on the etiquette of hookups. For my sake and the sake of your future partners, mind these rules! 3 min read 3 min read Jan 28, 2015 Perhaps you’ve seen this click-bait article by now — Mandy Len Catron’s NY Times article To Fall in Love With Anyone, Do This. It revives psychologist Arthur Aron’s carefully designed series of questions to make a couple fall in love. Spoiler alert: Mandy followed the guide herself and fell in… 7 min read 7 min read Founder & Fmr CEO of LiveAF & DOWN; Fmr Chief Growth Officer @ M17 Ent.; Product Strategy & Growth-Hacker; Featured Conference Speaker (SXSW, Business Insider) Alex Draper University Jacqueline Dr. Jennifer B. Rhodes Entrepreneur's Handbook See all (325) Help Status Writers Blog Careers Privacy Terms About Text to speech", "url": "https://medium.com/@colinhodge?source=home---------2---------------------3901f1f8_742d_4f4c_99a6_eeaf1fc46509-------7", "threshold": 0.9599925791334349}