{"title": "How I used Midjourney to design a brand identity | by Matty Brownell | May, 2023 | UX Collective", "content": "Sign up Sign In Sign up Sign In Matty Brownell Follow UX Collective -- 16 Listen Share By now, it’s no secret that AI will considerably impact the future of branding and design—making us question how we can continue to provide irreplaceable value as designers. Some creatives like Alif Ibrahim of It’s Nice That have suggested it be used to automate mundane and repetitive tasks like resizing, exporting, or mindless pixel pushing. Others like Evelio, the creative director at IDP Direct, see it as a way to build more curated mood boards and quickly communicate brand ideas to a client. As a founder of a branding agency myself, I’ve begun a journey to discover how AI can improve upon what we create and how we create it. If you’re not familiar with Midjourney, it’s one of the most prominent models in AI image generation to date. I experimented with the model to see how well it could produce a unique series of graphics for a new brand identity. Here are the results: While the exercise was more of a test, I learned some valuable insights along the way. Let’s go through the process together. When defining a style, first identify and build upon unique visual characteristics or themes that your graphics should embody. For this brand, let’s explore a style that captures the ideas of 3D momentum and luminous color blending. It’s helpful to reference existing inspiration you either found online or captured personally. Compiling the inspiration into buckets will form a clearer frame of reference and later become useful as Midjourney inputs. In our case, I have already designed the logo and color palette. It’s important that the new graphics are closely aligned and work together as a unified system. By abstracting the characteristics of the logo and color palette (seen above), we can help guide a more on-brand image result in Midjourney. Now that we’ve identified both the graphic inspiration and brand asset imagery, it’s time to take them both into Midjourney. While most of us are familiar with the /imagine command, I personally feel it is not as powerful when working toward a very specific visual outcome. In our case, we’ll use the /blend command. This command “blends” multiple images together and generates an image somewhere in between. By typing /blend + (Return) into the Discord message box, the above drag-and-drop modules will appear. While Midjourney allows the blending of up to 5 images at once, I recommend sticking with 2–3 images, as this provides greater design control. Now it’s playtime. Let’s upload our image inputs to the drag-and-drop modules. Here are some various combinations I had explored: It looks like one of the results above needs additional refining. As an example, we’ll choose to re-blend this image result: We’ll re-blend this image with another in hopes it will bring the result closer to what we’re looking for: There. Repeating this process will help to grow a library of images with one cohesive style. In the end, here’s where I landed: I also created some other interesting styles along the way: Now that we have a series of graphics we’re comfortable with, we’ll upscale them to a much higher res than Midjourney allows. For upscaling, I recommend a free tool like BigJPG.com. MidJourney isn’t perfect. There will be situations where further editing is needed. Whether it’s fine-tuning colors or composition, I use Photoshop for the finishing touches. If you‘d like to continue to edit using Midjourney text prompts, Lars Nielsen’s prompt guide is a great beginner’s reference. This exercise will by no means guarantee the same results for everyone. Rather, it’s to showcase an example of AI’s power applied to design. Designers will ultimately need to consider how AI can be used purposefully. Using this technology can have an instrumental impact on streamlining tedious design workflows but also has the ability to compromise the quality of our work if we’re not careful. Moving forward, it’s important that we collectively build upon our AI knowledge as a community to guarantee success in our creative work. Happy blending! Matty Brownell is the founder of ONTO, a branding agency focused on helping startups get seen, funded, and scaled. hello@weareonto.com. -- -- 16 UX Collective Branding x AI. Founder of weareonto.com Matty Brownell -- 3 Felicia Wu in UX Collective -- 153 Fabricio Teixeira in UX Collective -- 22 Matty Brownell in Onbrand -- 1 The PyCoach in Artificial Corner -- 20 wordsmithwriter I Anshul -- 22 Christina Sa in UX Planet -- 58 Thomas Smith in The Generator -- 11 Zulie Rane -- 365 Kristen Walters in Adventures In AI -- 121 Help Status Writers Blog Careers Privacy Terms About Text to speech", "url": "https://uxdesign.cc/how-i-used-midjourney-to-design-a-brand-identity-394cf9ddaeed?source=home---------0---------------------3901f1f8_742d_4f4c_99a6_eeaf1fc46509-------7", "threshold": 0.9999862406436011}