{"title": "James Michael Sama – Medium", "content": "Sign up Sign In Sign up Sign In 26K Followers Home Books About A step by step guide to loving yourself deeply, and then bringing that love to your relationship with others. 2017 Just now Member-only The strongest intimacy is emotional, not physical. —  We all know what physical intimacy looks like. It’s the most obvious, direct, and primal showing of attraction. It’s visceral, passionate, and intense. Physical intimacy, as I’ve argued often in the past, is a projection of emotional intimacy. Sure, we can share experiences with others that are strictly physical and… 18 min read 18 min read 22 hours ago Member-only There is no “part time” commitment. You’re in, or you’re out. —  We all understand that relationships are complicated, that communication is important, that men and women have different wants, needs, and desires that they bring to the table when entering a monogamous relationship… What we don’t always understand, though, is the fundamental nature of those we are interested in and the… 15 min read 15 min read 2 days ago Member-only Small things that have a big impact. —  Happiness, as we’ve recently discussed, can seem fragile and fleeting. It comes and goes, blowing with the winds of life’s external circumstances, seemingly outside of our control. However — it is largely a product of what we focus on (or don’t), and is therefore very much under our influence. In… 7 min read 7 min read 5 days ago Member-only The person you marry is the biggest decision you’ll ever make. —  There is arguably no bigger influence on your life than the person you choose to marry. They’re there when you wake up, when you come home, when you go to sleep, and everything in between. … 12 min read 12 min read 5 days ago Member-only You might be searching for something you haven’t defined yet. —  “I just want to be happy.” The mantra of millions marching through their days, waiting for the right person, the right opportunity, or the right offer to come along, expecting it to hold the ever-elusive “happiness” in its hands. I find the concept of happiness to be a fascinating one… 4 min read 4 min read 5 days ago Member-only How you talk to yourself creates your reality. —  Who‘s writing the story of your life? I mean really, honestly, truly — who’s got the pen? Is it you? Or, is it the multitude of voices in your ear every single day from society and the people around you? Are your thoughts, beliefs, and values really yours, or are… 14 min read 14 min read May 9 Member-only Sometimes you need to pause and reflect. —  Living an even more fulfilling life isn’t always about learning new things, or adding something else to your routine, or taking another step into the next level of life (though, progress certainly does enhance the human experience). Sometimes, it’s about reminding ourselves of things that we already know. Remembering who… 7 min read 7 min read May 8 Member-only Are you subconsciously sabotaging yourself? —  I know, you’re frustrated. Dating — in fact — is one of those topics that seems to produce audible groans from an entire room. Ugh, it’s exhausting! And, it really can be. You spend hours swiping, too much money and time getting ready for dates that go nowhere, or even… 9 min read 9 min read May 5 Member-only Whose life are you living? Yours, or theirs? —  It’s human nature to seek connection, community, friendship, and love. It’s quite literally how the human race has survived for so long and dominated the planet. It’s not because we’re the biggest, strongest, fastest, or maybe even smartest — it’s because we stick together, and we work together. En masse… 6 min read 6 min read May 4 Member-only If love is a verb, what does it really look like? —  Ah, the magic of love. The warmth, the safety, the comfort, the joy, the excitement…all feelings that we associate with that “spark” we hope to feel with another person. The one we can melt into as we look into their eyes and be at ease, at home, at peace. Love… 6 min read 6 min read Book Author Life coach to high achievers and world changers. Multiple #1 writer. Speaker. Trusted by: CNN, CNBC, NY Post, CBS, more. Say hello! @JamesMSama | JamesMSama.com Ayelet Baron The Good Men Project Dr. Debi Silber Alex Greenwood JOHN NOSTA See all (10,250) Help Status Writers Blog Careers Privacy Terms About Text to speech", "url": "https://medium.com/@jamesmsama?source=home---------5---------------------3901f1f8_742d_4f4c_99a6_eeaf1fc46509-------7", "threshold": 0.8017518752014814}