{"title": "Mark Riedl – Medium", "content": "Sign up Sign In Sign up Sign In 2K Followers Home About Apr 14 [This is a work in progress] 1. Introduction This article is designed to give people with no computer science background some insight into how ChatGPT and similar AI systems work (GPT-3, GPT-4, Bing Chat, Bard, etc). ChatGPT is a chatbot — a type of conversational AI built — but on top of… 38 min read 38 min read Jan 4, 2021 Contributing authors (alphabetical): Amal Alabdulkarim, Louis Castricato, Siyan Li, and Xiangyu Peng. Updated: June 28, 2021 I research (among other things) automated story generation. I have not taught my course on AI storytelling in a number of years. I have put this primer together as a resource that I think… 26 min read 26 min read Aug 24, 2020 The following is a collection of thoughts that I put together on the topic of AI democratization. Some of the points below were quoted in an article by OneZero, an online technology reporting outfit: https://onezero.medium.com/gpt-3-is-an-amazing-research-tool-openai-isnt-sharing-the-code-d048ba39bbfd To me, AI democratization means making it possible for everyone to create artificial intelligence systems… 6 min read 6 min read Jan 3, 2019 On Friday, December 28th Netflix aired a special episode of their Black Mirror series called Bandersnatch. What made Bandersnatch interesting is that it was an interactive story: watchers could use a remote control to choose options at various points throughout the story’s progression to influence character choice and plot progression. … 9 min read 9 min read Dec 4, 2018 On November 11, 2018, regulators in the US announced a review of export controls across a range of emerging technologies. The list includes artificial intelligence and machine learning, as well as technologies that would make substantial use of AI and ML such as robotics and brain-computer interfaces, and enabling technologies… 5 min read 5 min read Feb 14, 2018 Computational creativity is the art, science, philosophy and engineering of computational systems which, by taking on particular responsibilities, exhibit behaviors that unbiased observers would deem to be creative. Machine learning (ML) has shown promise for many creative tasks such as music generation, image and painting generation, image style transfer, etc… 11 min read 11 min read Oct 25, 2017 This post is based on the keynote talk I gave at the 10th Workshop on Intelligent Narrative Technologies. The slides are here. In the talk, I presented a history of the workshop series, but this post will focus on broader themes. Introduction Storytelling is an important part of how we, as… 20 min read 20 min read Jul 24, 2017 (The following is adapted from a paper by Lara Martin and Brent Harrison, Improvisational Computational Storytelling in Open Worlds, presented at the 2016 International Conference on Interactive Digital Storytelling.) Introduction Storytelling has been of interest to artificial intelligence researchers since the earliest days of the field. Artificial intelligence research has addressed… 11 min read 11 min read Jul 21, 2017 The term Human-Centered Artificial Intelligence is a recognition that the future is increasingly putting humans in contact with artificial intelligences. At the heart of human-centered AI is the recognition that the way AI systems solve problems — especially using machine learning — is fundamentally alien to humans without training in… 12 min read 12 min read May 29, 2017 Updated: link to IJCAI’17 paper Automated understanding, also known as common sense learning or hypothesis generation, is the problem of taking a sequence of events, building some model that explains the events, and using the model to predict future events or answer questions about the sequence of events. We introduce… 10 min read 10 min read AI for storytelling, games, explainability, safety, ethics. Professor @GeorgiaTech . Associate Director @MLatGT . Time travel expert. Geek. Dad. he/him Wil Wheaton Nick Diakopoulos Moshe Vardi Lessig Seth Abramson See all (149) Help Status Writers Blog Careers Privacy Terms About Text to speech", "url": "https://medium.com/@mark-riedl?source=home---------0------------------0----------", "threshold": -0.9127127560755898}