{"title": "Minko Gechev – Medium", "content": "Sign up Sign In Sign up Sign In 4.96K Followers Home About Published in Angular Blog ·May 3 Six months ago, we reached a significant milestone in Angular’s simplicity and developer experience by graduating the standalone APIs from developer preview. Today, we’re thrilled to share that we’re continuing the Angular Momentum with the biggest release since the initial rollout of Angular; making large leaps in reactivity, server-side rendering… 12 min read 12 min read Published in Angular Blog ·Nov 16, 2022 Over the past year we removed Angular’s legacy compiler and rendering pipeline which enabled the development of a series of developer experience improvements in the past couple of months. Angular v15 is the culmination of this with dozens of refinements which lead to better developer experience and performance. Standalone APIs are now out of developer preview! In v14… 10 min read 10 min read Published in Angular Blog ·Apr 29, 2022 At I/O 2021 we had a blast announcing Angular DevTools and letting you use it in the Adventure world! We talked to hundreds of developers and shared insights about our partnership with TensorFlow.js. Hard to believe it’s already time for I/O 2022. This year you’ll find even more Angular content… 4 min read 4 min read Published in Angular Blog ·Apr 13, 2022 Earlier this year, we ran our annual developer survey. We received nearly 25k responses and want to thank each and everyone of you for taking the time to share your feedback. Your input is invaluable for us. It informs our community programs, documentation, prioritization, and roadmap. Many people ask me… 4 min read 4 min read Published in Angular Blog ·May 27, 2021 Among the most significant advantages of working on a popular open codebase is the constant feedback stream in all forms, including GitHub issues and pull requests. Over the past 6 months, our team did a lot of work triaging over 4.5k issues across our 3 main repositories and merging hundreds… 3 min read 3 min read Published in Angular Blog ·May 18, 2021 We’re thrilled to announce Angular DevTools — a Chrome DevTools extension that you can use to inspect the structure of your applications and profile their performance. You can find more about Angular DevTools in the video below and install it from the Chrome Web Store. Better Angular Debugging Experience We ran… 3 min read 3 min read Published in Angular Blog ·Apr 23, 2021 TLDR; In v12, we’ll deprecate our legacy compilation and rendering pipeline called View Engine. This change will not require any action by developers. Libraries dependent on View Engine will continue to work as expected via our compatibility compiler ngcc. … 4 min read 4 min read Published in Angular Blog ·Feb 18, 2021 One of the highest priorities for Angular is to enable best practices from the start. We want you to feel comfortable building a large enterprise user interface the same way as creating a to-do app. We apply this mindset in the framework’ APIs, developer tooling, best practices, and documentation. A… 5 min read 5 min read Published in Angular Blog ·Dec 15, 2020 Earlier this year, we ran our annual developer survey. We want to thank you for the close to 30k responses, which will help us make Angular better! This post discusses the results we received and how they connect to the projects on the roadmap. Results In the survey, we asked a… 4 min read 4 min read Published in Angular Blog ·Aug 26, 2020 In Angular, we strongly believe in consistency and best practices. For example, we adopted TypeScript in its early days because we wanted all developers using the framework to take advantage of compile-time type checking. This way, we enabled an excellent development experience for everyone with better editor support, allowing people… 7 min read 7 min read Product lead for Angular at Google. Help Status Writers Blog Careers Privacy Terms About Text to speech", "url": "https://medium.com/@mgechev?source=home---------1---------------------3901f1f8_742d_4f4c_99a6_eeaf1fc46509-------7", "threshold": 0.9836767132016839}