{"title": "Ryan Holiday – Medium", "content": "Sign up Sign In Sign up Sign In 169K Followers Home Books About See all (6) Discipline Is Destiny guides readers down the path to self-mastery, upon which all the other stoic virtues—courage, temperance, justice, and wisdom—depend. 2022 May 3 Member-only At 6:45pm on Wednesday, April 23rd, 2014, I got an email from my friend Seth Roberts, the pioneering and peerless scientist. I opened it, saw that it was to be the first of a long awaited column called “Personal Science” for the Observer, where I was then an editor. I… 4 min read 4 min read Apr 19 Member-only It’s one of those lines we throw out casually: “I want to spend more ‘quality time’… ” whether it’s with friends, with family, with your kids, or with yourself. We spend an inordinate amount of money and effort at creating opportunities to get this time too. We plan for it… 6 min read 6 min read Apr 12 Member-only As parents, we worry about having all the right answers. But I think it’s better to focus on asking the right questions. The right question at the right time can change the course of a life, can still a turbulent situation, can provide a totally different perspective. While every situation… 14 min read 14 min read Mar 27 Member-only It is only from doing hard things, the Stoics said, that we learn what we’re capable of. A little over three years ago, my wife and I had the craziest idea we’ve ever had in our lives: to open a bookstore in Bastrop, Texas. Opening a small business is always… 9 min read 9 min read Mar 10 Member-only I know someone that spends close to $20,000 a month on a publicist. I know an author who spends something like that out of their own pocket each month on what’s called co-op, or extra prominent placement at airport bookstores. I know many people who spend more than that on… 6 min read 6 min read Feb 22 Member-only Marcus Aurelius never claimed to be a Stoic. Gregory Hays, one of Marcus Aurelius’s best translators, writes in his introduction to Meditations, “If he had to be identified with a particular school, [Stoicism] is surely the one he would have chosen. Yet I suspect that if asked what it was… 10 min read 10 min read Feb 10 Member-only Marcus Aurelius thought a lot about thinking. “Our life is dyed by the color of our thoughts,” he wrote. So naturally, he tried to be thoughtful about what he thought and how he thought. … 5 min read 5 min read Jan 25 Member-only I’m not saying everyone should start a podcast. In fact, I have said the opposite many times. There are way too many of them out there…and most are not good. I’m just saying that having a podcast is pretty magical because you get (for free) something that no amount of… 8 min read 8 min read Jan 12 Member-only It’d be wonderful if a new year magically marked a new beginning. But 2022, like all years, reminded us that the same things keep happening, that world events continue on in their own unpredictable way and that in the end, we control very little but our own actions and opinions. … 9 min read 9 min read Dec 29, 2022 Member-only The other day I sat down to write. But it didn’t happen. It just wasn’t there. The words. The momentum. One thought leading into the next. I knew I wanted to say something. I knew what I wanted it to be about. But I couldn’t get much further than that… 4 min read 4 min read Book Author Bestselling author of ‘Conspiracy,’ ‘Ego is the Enemy’ & ‘The Obstacle Is The Way’ http://amzn.to/24qKRWR Thought Catalog Nomadic Matt M.G. Siegler Srinivas Rao Robert Meza See all (253) Help Status Writers Blog Careers Privacy Terms About Text to speech", "url": "https://medium.com/@ryanholiday?source=home---------3---------------------3901f1f8_742d_4f4c_99a6_eeaf1fc46509-------7", "threshold": -0.5782496086932984}