{"title": "The most insightful stories about Relationships - Medium", "content": "353K Stories 102K Writers Trending Latest Best Ella H ·8 hours ago I wrote an article a year ago about the book “Why Men Love Bitches” by Sherry Argov, and recently I picked the book back up to read it again. I had a surprisingly new perspective on the book compared to the last time I read it, and it resonates more… 6 min read 6 min read Brother Ben X ·5 hours ago So since you know you can’t win an argument with them, and you really shouldn’t, out of respect for your parents, you shouldn’t argue with them — The Honorable Minister Louis Farrakhan Growing up a lot of us didn’t really choose the religion we claimed, for many of us we… 8 min read 8 min read Matthew Royse in Better Advice ·1 day ago Member-only There are certain qualities that set leaders apart from managers —  “Leadership is the art of giving people a platform for spreading ideas that work.” — Seth Godin, an American author, businessman, marketer, and public speaker What makes up a leader? How about a manager? How are they different? The terms “leader” and “manager” are often used interchangeably. … 4 min read 4 min read James Michael Sama ·15 hours ago Member-only There is no “part time” commitment. You’re in, or you’re out. —  We all understand that relationships are complicated, that communication is important, that men and women have different wants, needs, and desires that they bring to the table when entering a monogamous relationship… What we don’t always understand, though, is the fundamental nature of those we are interested in and the… 15 min read 15 min read Claire Franky in Bouncin’ and Behavin’ Blogs ·20 hours ago Member-only Let’s not confuse the two —  “Narcissist” is a term thrown around like “y’all” at a fish fry. People seem to use the word narcissist to describe anyone who acts like an ass. Which is clearly everyone. And when you’re married to a true narcissist, it gets really fucking annoying when every Sally, Vicky, and Tom… 4 min read 4 min read Related Topics Roz Warren, Writing Coach in Everything Shortform ·1 day ago Member-only The first person to text me on Mother’s Day was my ex-husband. Twenty years ago, we went through an acrimonious divorce. This morning, he texted, Happy Mother’s Day! Because? We’re a lot happier now that we’re no longer unhappily married. We both meant well but we both fucked up. We’ve… 1 min read 1 min read See more topics Life coach to high achievers and world changers. Multiple #1 writer. Speaker. Trusted by: CNN, CNBC, NY Post, CBS, more. Say hello! @JamesMSama | JamesMSama.com Psychologist and blogger. I help people use psychology for meaningful personal growth: https://nickwignall.com I help men to escape their comfort zones, improve their self-esteem and make smarter dating decisions. Buy my book 'Big Dick Energy' at https://amzn.to/3HxnwiH DrPsychMom.com, The Dr Psych Mom Show, BestLifeBehavioralHealth.com, rb.gy/zuzqxa, therapy/coaching, affiliate links, not med advice, all people fictional We're having a conversation about the changing roles of men in the 21st century. Main site is https://goodmenproject.com Email us info@goodmenproject.com Visit the archive Help Status Writers Blog Careers Privacy Terms About Text to speech", "url": "https://medium.com/tag/relationships?source=home---------5-----------relationships-------30---525cee1d_ac69_43e7_933a_38e685fd5c03-------18", "threshold": 0.974858287109418}