{"title": "The most insightful stories about Self Improvement - Medium", "content": "531K Stories 147K Writers Trending Latest Best Patrick Miller ·7 hours ago [This essay was funded by my generous Patreon supporters. If you liked this and want to see more, please consider joining the crew!] Ayo Pat, I’ve always found I wanna help my friends who don’t understand fighting games to try and understand them, and I feel I can explain it… 9 min read 9 min read Nick Wignall ·1 day ago #1: Rely on willpower —  We rightly admire self-disciplined people. Because whatever your goals are — from making the Olympics or starting a business to writing a novel or sticking to a new diet — self-discipline is often a key ingredient. Still, self-discipline is a misunderstood concept, mainly because we think about it as a… 6 min read 6 min read Tim Denning in Mind Cafe ·15 hours ago Member-only The meaning of life is to experience nostalgia —  At 21 I didn’t think I’d live to 37. I mean, I had a messed up existence plagued by mental illness. Every year as a young adult felt like a gift. Soon alcohol or drugs would get me, surely. But through some kind of miracle I got saved. … 10 min read 10 min read Gerald Malvin ·17 hours ago Death makes one appreciate life so much more. Almost a month ago, I lost my father suddenly with him not having any serious illness. My father was someone I looked up to and whom I always turn to regarding advice let it be personal or professional. He always readily listened… 5 min read 5 min read James White in Publishous ·12 hours ago Member-only A reading list from the Canadian psychologist —  If you spend any amount of time on social media, you’ve definitely heard of Jordan Peterson. He’s the bestselling author of 12 Rules For Life, Beyond Order, and Maps Of Meaning. He has also received millions of views on his YouTube lectures about God, The Bible, and modern psychology. So… 6 min read 6 min read Related Topics R. Khoirotun ·13 hours ago In the end, I realize something. You have always been able to find me when I am lost, even at my worst. —  You can read this post while listening to this song. They said I’m pretty good at words because I am a writer, but I guess I lost my ability to write when it comes to this person. It’s kinda weird you know because, to be frank, I used to make… 5 min read 5 min read Sean Kernan in Mind Cafe ·7 hours ago Member-only A true story of community engagement as a source of change. —  It’s rare that internet hype can become so useful — and actually affect lives. Those ice bucket challenges were relentless. They hijacked YouTube from 2014–2016. Meanwhile, there was a lot of noise and complaints about them and I was one of the complainees: “Why are people dousing themselves in frigid… 5 min read 5 min read James White in Mind Cafe ·15 hours ago Member-only Avoid them at all costs —  I’m tired of reading cliché self-help books. Chances are, you feel the same way. Many self-help books are overhyped and not worth the paper on which they’re printed. And, unfortunately, they’re also a waste of time and money. Here are five examples of mediocre self-help books to avoid at all… 7 min read 7 min read Matthew Royse in Better Advice ·1 day ago Member-only There are certain qualities that set leaders apart from managers —  “Leadership is the art of giving people a platform for spreading ideas that work.” — Seth Godin, an American author, businessman, marketer, and public speaker What makes up a leader? How about a manager? How are they different? The terms “leader” and “manager” are often used interchangeably. However, these terms… 4 min read 4 min read Jade Cessna ·12 hours ago Yes, I’ve really worked out 100 days in a row…yes, I still have a double chin. A little over 100 days ago, on February 1st, I started a workout streak. At this point in my life, I’ve learned what helps keep me motivated to create a habit and one of… 6 min read 6 min read See more topics Always on the hunt for a good story. That guy from Quora. Writing out of Tampa, Florida. Psychologist and blogger. I help people use psychology for meaningful personal growth: https://nickwignall.com Practical, No BS Self-improvement • 1M+ Views, 10x Top Writer • FREE 5 Habits To Develop Authentic Masculine Confidence: https://rebrand.ly/5htb Aussie Blogger with 500M+ views — Writer for CNBC & Business Insider. Inspiring the world through Personal Development and Entrepreneurship — timdenning.com/mb Let’s make reading cool again! Featured in Publishous, Mind Cafe & Books Are Our Superpower. Visit the archive Help Status Writers Blog Careers Privacy Terms About Text to speech", "url": "https://medium.com/tag/self-improvement?source=home---------3-----------self_improvement-------30---525cee1d_ac69_43e7_933a_38e685fd5c03-------18", "threshold": -0.9999950756697196}