{"title": "The most insightful stories about Writing - Medium", "content": "530K Stories 138K Writers Trending Latest Best Dan Gerstein ·5 hours ago Out of the Shadows: J.R. Moehringer and the Future of Ghostwriting After devouring J.R. Moehringer’s deeply revealing self-examination of his work with Prince Harry and his identity as a ghostwriter in last week’s New Yorker, a friend texted me with a question that surely was on the minds of a… 7 min read 7 min read Sara K. Runnels ·1 day ago Member-only A first Mother’s Day after loss —  [Part One: Breathe In, Breathe Out & Part Two: Verbs in Past Tense] I have two calendars now. One that keeps me sane, present, grounded in reality. And one with no dates, just rows of dispiriting squares blanketed with the words: another day without her. For the last six months… 4 min read 4 min read Tim Denning in The Writing Cooperative ·3 hours ago Member-only We’re all experts in something, even if we don’t realize it —  The writing world has some crazy rules. And most of them are wrong or are way out of date and keep writers broke. Here are a few commonly held assumptions so you can avoid them. You have to be a writer No you don’t. We are all writers. We write emails and text messages all day… 5 min read 5 min read Amy Sea ·5 hours ago Member-only We see you back —  When I first started seeing David Perlmutter highlighting my stories, I thought, cool name. Then I thought, does he really like all my sentences? Then I thought, who is this guy? Then I thought, where did he come from? Then I thought, how does he read so quickly? Then I… 2 min read 2 min read Tom Kuegler in The Mind Of A Writer ·8 hours ago Member-only Here’s my Medium stats over the last 30 days. 4 min read 4 min read Related Topics Grandma Smillew in The Pub ·8 hours ago Dear Funny Humor Writers of Medium, I tagged you today because you’re one of Medium’s top 50 humor writers (congratulations!). I know it’s not very Medium-etiquette of me (I didn’t meter the story to compensate), but I would love it if you tried your witty humor at the following writing… 2 min read 2 min read Thomas Gaudex in Scribe ·5 hours ago Member-only Well, almost, but the time of dating apps is over, folks! —  When my grandparents were young, in the 1950’s, hearts to be taken often met at dances. It was a time when relationships were born from a few glances exchanged. The Internet did not exist, telephones were attached to wires, love was not a profitable business and single people did not… 3 min read 3 min read Yana Bostongirl in The Memoirist ·7 hours ago Member-only How else was I supposed to communicate what I was feeling? —  My friend sends texts to her deceased mother’s old phone number. It is still active and the texts are marked as delivered. However, no one answers. Whoever may be at the other end, does see the heartfelt thoughts shared by a grieving daughter to a beloved mother but they have… 4 min read 4 min read Alexander Semenyuk in Bouncin’ and Behavin’ Blogs ·6 hours ago Member-only An idea to help writers —  Hey friends, I continue seeing a certain subject pop up and the frustration that goes together with it. I’ve read it on Google, Facebook, and of course on Medium as well. (I’ll be putting some of my photos into this article) Someone posts things like; “Look my story had 5… 2 min read 2 min read Ed-iT in Writing101 ·2 days ago Member-only Secret to the power of your imagination —  Imagination is a powerful tool that we all have, but often overlook. It is the ability to create mental images, ideas, and concepts that do not exist in reality. Imagination is not a source of creativity and innovation. It’s also critical to problem-solving, empathy, and emotional intelligence. … 2 min read 2 min read See more topics 1 M+ views on Medium. || Outstand using data. ◼️ Data Science, Design and Tech ◼️ Not an expert, but still trying! :D 👉🏻Inquiries in rfeers@gmail.com Content creator, cat mom, 6-figure entrepreneur. She/her. Get 2x weekly emails on how to make money writing online: https://zuliewrites.ck.page/3e3d3a8187 Aussie Blogger with 500M+ views — Writer for CNBC & Business Insider. Inspiring the world through Personal Development and Entrepreneurship — timdenning.com/mb Get a promotion by creating on the internet → https://part-timecreatorclub.ck.page/9e9d8538b9 Writing about life as a full-time creator & helping new writers get started. DM: anangsha@baos.pub. YouTube: https://www.youtube.com/c/AnangshaAlammyan/ Visit the archive Help Status Writers Blog Careers Privacy Terms About Text to speech", "url": "https://medium.com/tag/writing?source=home---------4-----------writing-------30---525cee1d_ac69_43e7_933a_38e685fd5c03-------18", "threshold": -0.9995858866160107}