{"title": "The most insightful stories about Data Science - Medium", "content": "226K Stories 76K Writers Trending Latest Best Martin Heinz in Better Programming ·Updated 1 day ago Member-only True multi-core concurrency is coming to Python in 3.12 release and here’s how you can use it right now using sub-interpreter API —  Python is 32 years old language, yet it still doesn’t have proper, true parallelism/concurrency. This is going to change soon, thanks to the introduction of a “Per-Interpreter GIL” (Global Interpreter Lock) which will land in Python 3.12. While the release of Python 3.12 is some months away, the code is… 6 min read 6 min read Philip Mocz ·22 hours ago Member-only In today’s recreational coding exercise, we learn how to fit model parameters to data (with error bars) and obtain the most likely distribution of modeling parameters that best explain the data, called the posterior distribution. We will do so in a Bayesian framework, which is a very powerful approach because… 6 min read 6 min read Leonie Monigatti in Towards Data Science ·7 hours ago Member-only Learn how to build apps and showcase your skills with large language models (LLMs). Get started today! —  One common piece of advice I often hear for job applicants is to have a portfolio showcasing your work. This doesn't only apply to artists or models but also to software developers and data scientists. A portfolio of your projects acts as public evidence of your skills. This public evidence… 11 min read 11 min read Cássio Bolba ·15 hours ago Member-only Model you data to look good, but not like Gisele Bundchen… Introduction Data modeling plays a crucial role in the design and development of databases. It is the process of creating a conceptual representation of the data and its relationships within an organization. Effective data modeling ensures that the database accurately… 4 min read 4 min read Claire Longo ·8 hours ago Imposter syndrome is rampant in the Silicon Valley. It’s something that plagues those of us working in and contributing to tech, specifically in the fast paced field of AI as it has become somewhat impossible to keep up with the skills and knowledge required to work in a field developing… 5 min read 5 min read Related Topics Tom Smykowski ·6 hours ago Member-only While we still can, here are some interesting projects in Python revolving around AI, and not only that. 1. Shap-E — Generate 3D Models A Python open source code and model from OpenAI to generate conditional 3D implicit functions: 2 min read 2 min read Anna Geller in Dev Genius ·5 hours ago Event-driven open-source data orchestrator with a built-in code editor and a rich plugin ecosystem —  This post shares the story behind Kestra and explains how you can use it to schedule and parametrize data processing workflows in a declarative way. What is Kestra Kestra is an open-source, event-driven data orchestrator that strives to make data workflows accessible to a broader audience. The product offers a declarative YAML interface… 6 min read 6 min read IMPACT Unofficial ·6 hours ago Earth science and art are rarely mentioned in the same sentence despite the fact that both share a deep connection in their common goal to understand and interpret the world around us. Earth science provides a wealth of inspiration for artists, from the beauty of geological formations to the awe-inspiring… 3 min read 3 min read Matteo Castagna ·2 hours ago Derivation of common loss functions by maximum likelihood estimation —  Throughout different AI and machine learning classes that I’m taking in uni, I see many of my student colleagues struggling to understand the concept of likelihood. Also, teachers tend to skip the topic, but I believe it is fundamental to understand some of the whys in ML. In this article… 8 min read 8 min read Dean Allemang ·22 hours ago I was at the Knowledge Graph Conference this week, and as usual, it was a fun and insightful time. I have enough topics for at least four blog entries, so I’m going to start working through them. This first one is about a topic that seemed to be on just… 8 min read 8 min read See more topics 10M+ Views on Medium || Make money by writing about AI, programming, data science or tech 👉 http://bit.ly/3zfbgiX Join a Community of People Who Love Javascript, Programming and Technology — codertoentrepreneurs.substack.com Data Scientist based in Oxford, UK. I write about DS, AI and try (& sometimes succeed) to give careers advice. Support me: medium.com/@mattchapmanmsc/membership I write about Python, DataOps and MLOps BEXGBoost | DataCamp Instructor |🥇Top 10 AI/ML Writer on Medium | Kaggle Master | https://www.linkedin.com/in/bextuychiev/ Visit the archive Help Status Writers Blog Careers Privacy Terms About Text to speech", "url": "https://medium.com/tag/data-science?source=home---------1-----------data_science-------30---525cee1d_ac69_43e7_933a_38e685fd5c03-------18", "threshold": -0.855073637519483}