{"title": "The most insightful stories about Politics - Medium", "content": "482K Stories 143K Writers Trending Latest Best umair haque in Eudaimonia and Co ·6 hours ago Member-only This Is the Age of Extinction — And It’s Beginning To Trickle Up —  Think with me for a moment about how the world’s changed. In just one decade. Ten years ago, how different was it? Politics was…night and day. By and large, our civilization was still making progress towards democracy. It was the heyday of liberalism. And then a right wing tsunami swept… 9 min read 9 min read Damien Walter ·1 day ago The sociopaths scamming cryptos have moved on to AI —  Some folks on the main Science Fiction group have commented on my mention of AI as a scam. Let’s think about how the AI scam works. There is a new technology we can safely call Large Language Models. They’re interesting, potentially powerful, but also very limited. There are two observable… 2 min read 2 min read Johnny Robish in The Haven ·20 hours ago Member-only Can ‘honor killings’ be far behind? —  Florida Gov. Ron DeSantis has just signed Senate Bill 1580, the “Protections of Medical Conscience,” into law, allowing Florida healthcare providers and insurance companies to refuse services based on their moral, ethical, or religious beliefs. That’s right, folks; patients in Florida will soon be facing denial of care or insurance… 2 min read 2 min read Will Lockett ·1 day ago Member-only But all is not as it seems. —  While Russia is armed to the teeth with Soviet-era nuclear weapons, they haven’t been Putin’s trump card when it comes to his idiotic invasion of Ukraine. After all, there is very little point in nuking a place you want to eventually control, and doing so would spark World War III… 6 min read 6 min read umair haque in Eudaimonia and Co ·1 day ago Member-only The Psychology of the New Global Wave of Fascism —  “I’m not a fascist! They’re the real fascists!! The students, the leftists, the woke mob, the anti-fascists, the teachers, the LGBTQ! They’re putting me in danger! They’re taking away my rights! My rights matter most of all! I’m being persecuted, violently and viciously!! I have a right to be heard… 11 min read 11 min read Related Topics Dash MacIntyre ·9 hours ago It’s your favorite president here, Donald J. Trump, the most respecting of mothers president this country has ever had, maybe even more than Lincoln and Washington combined! Having just been totally vindicated and exonerated in my rape trial against that awful woman E. Jean Carroll, who my lawyers proved without… 4 min read 4 min read Lauren Elizabeth ·12 hours ago Member-only Florida just got even more dangerous. —  Sometimes, it feels like fun and games when it comes to Ron DeSantis. We watch him attempt to navigate the beginnings of a national Presidential campaign that’s all but doomed before it even begins, and it’s genuinely satisfying to know he’s being forced to lie in the bed he made. … 3 min read 3 min read Jessica Wildfire ·1 day ago Member-only There’s been a war on education for decades. —  When my father-in-law found out I was a professor, he had some things to say. “Can you believe they get summers off? Who on earth gets summers off?” My spouse had to explain it to him, because he wouldn’t listen to me. No, we don’t get summers off. We don’t… 9 min read 9 min read Caitlin Johnstone ·1 day ago Listen to a reading of this article (reading by Tim Foley): ❖ American liberals just spent days raging at CNN for hosting a town hall with Donald Trump like it’s the worst thing CNN has ever done. CNN isn’t horrible because it “platformed” Trump, CNN is horrible because it’s… 5 min read 5 min read Laura Halls ·1 day ago Member-only Ending the myths of the right-wing —  A point I’ve been thinking about quite a bit recently is the topic of debate and more specifically if you can ever debate people on the right in an honest way. … 5 min read 5 min read See more topics vampire. A Canadian from Connecticut: 2 strikes against me! I'm a top writer, looking for the Meaning under the headlines. Follow me on Mastodon @Barry 30+ year old History Professor and educator. MA in Business Ethics and Modern European History. History has much to teach, but it doesn't find enough students. The past holds the answers to today’s problems. “Be curious, not judgmental,” at least until you have all the facts. Think and stop watching cable news. are you ready for what's coming? | Also on Substack: https://isaiahmccall.substack.com/ mccallisaiah@gmail.com Visit the archive Help Status Writers Blog Careers Privacy Terms About Text to speech", "url": "https://medium.com/tag/politics?source=home---------8-----------politics-------30---525cee1d_ac69_43e7_933a_38e685fd5c03-------18", "threshold": -0.9858812209488551}