{"title": "The most insightful stories about Programming - Medium", "content": "302K Stories 101K Writers Trending Latest Best Leonie Monigatti in Towards Data Science ·20 hours ago Member-only Learn how to build apps and showcase your skills with large language models (LLMs). Get started today! —  One common piece of advice I often hear for job applicants is to have a portfolio showcasing your work. This doesn't only apply to artists or models but also to software developers and data scientists. A portfolio of your projects acts as public evidence of your skills. This public evidence… 11 min read 11 min read Martin Heinz in Better Programming ·Updated 1 day ago Member-only True multi-core concurrency is coming to Python in 3.12 release and here’s how you can use it right now using sub-interpreter API —  Python is 32 years old language, yet it still doesn’t have proper, true parallelism/concurrency. This is going to change soon, thanks to the introduction of a “Per-Interpreter GIL” (Global Interpreter Lock) which will land in Python 3.12. While the release of Python 3.12 is some months away, the code is… 6 min read 6 min read Dmitrii Eliuseev in Towards Data Science ·17 hours ago Member-only Clustering of Twitter data with K-Means, TF-IDF, Word2Vec, and Sentence-BERT —  What do people think and write about the climate, pandemics, war, or any other burning issue? Questions like this are interesting from a sociological perspective; knowing the current trends in people’s opinions can also be interesting for scientists, journalists, or politicians. But how can we get answers? Collecting responses from… 21 min read 21 min read Philip Mocz ·1 day ago Member-only In today’s recreational coding exercise, we learn how to fit model parameters to data (with error bars) and obtain the most likely distribution of modeling parameters that best explain the data, called the posterior distribution. We will do so in a Bayesian framework, which is a very powerful approach because… 6 min read 6 min read Tom Smykowski ·19 hours ago Member-only While we still can, here are some interesting projects in Python revolving around AI, and not only that. 1. Shap-E — Generate 3D Models A Python open source code and model from OpenAI to generate conditional 3D implicit functions: 2 min read 2 min read Related Topics Arjun Gullbadhar in Level Up Coding ·1 day ago Member-only Introduction: In the world of AI and machine learning, a groundbreaking development has emerged: Mojo, a new programming language created by Chris Letner, the mastermind behind Swift. Mojo tackles the speed limitations that have plagued Python, offering unparalleled performance and speed that can reshape the entire field. Python’s Speed Challenge… 3 min read 3 min read Bennett Garner in Developer Purpose ·13 hours ago There are people who are way more talented at coding. As a young developer, I thought I was pretty smart. Whipping up programs. Solving problems. But then I met developers who were way better than me. People who grok code on a level I can only imagine. I still believe… 2 min read 2 min read Mohamed Aboelez in Level Up Coding ·3 days ago Member-only How about “software development”? There’s a growing consensus among people who’ve been involved with Agile Software Development since the early days that something is rotten in the state of Agile. Having slowly backed out of the Agile movement over the last decade or more, I approach the movement as a… 6 min read 6 min read Python Quickies ·1 day ago Learn this Easy and Helpful Python Quickie Now! —  If you are already familiar with online interviews and coding practice websites, you would for sure, love this easy Python feature. Read this completely for a better understanding! For example, I ask you to print a list of values. You would do that using a for loop in no time. … 3 min read 3 min read Robin Demuth in REWRITE TECH by diconium ·3 hours ago When considering the cost of ownership for a software project, both from an operating and business perspective, the choice of programming language can have a significant impact. Elixir, a functional programming language built on the Erlang virtual machine, offers several advantages over other traditional object oriented… 6 min read 6 min read See more topics A Modern Day Polymath Join a Community of People Who Love Javascript, Programming and Technology — codertoentrepreneurs.substack.com I am Java programmer, blogger, working on Java, J2EE, UNIX, FIX Protocol. I share Java tips on http://javarevisited.blogspot.com and http://java67.com AI+Data | Storytelling+Art | UX+Design Thinking | Innovation+Tech | Using AI for Everything I Can | Get Full Access 👉 https://gesikowski.medium.com/membership 10M+ Views on Medium || Make money by writing about AI, programming, data science or tech 👉 http://bit.ly/3zfbgiX Visit the archive Help Status Writers Blog Careers Privacy Terms About Text to speech", "url": "https://medium.com/tag/programming?source=home---------0-----------programming-------30---525cee1d_ac69_43e7_933a_38e685fd5c03-------18", "threshold": -0.8051349530747463}