{"title": "The Bang With Friends Story: Under The Covers | by Colin Hodge | May, 2023 | Entrepreneur's Handbook", "content": "Sign up Sign In Sign up Sign In Colin Hodge Follow Entrepreneur's Handbook -- 19 Listen Share You know you’ve created a cultural phenomenon when the nation’s largest college Christian group declares your creation “the evilest app ever.” But that’s exactly what happened when I built Bang With Friends, a Facebook app that let users find out which of their friends wanted to… you know. Once my friends got their hands on it, the app spread like wildfire. We hit the top of the Apple App Store’s dating category (at one point beating out Tinder), and within 3.5 months, we had 1 million users. We were everywhere, from The Wall Street Journal to The Colbert Report. But then came lawsuits, a rebrand, an acquisition, and a failed IPO before I became one of the few entrepreneurs to sell their company and later buy it back at a better price. Here’s the inside scoop on my journey and the 12 lessons I learned — from idea validation to acquisitions and negotiations. Let’s dive in. Bang With Friends was closer to an “overnight success” than any other startup. One night, we were joking in a startup incubator office about our provocative logo. The next, I was pulling an all-nighter to keep the servers from crashing and fielding press inquiries. Yet, the road to such an explosive launch was anything but overnight and littered with failures. My first attempt at a mobile app didn’t quite take off. It was a vibrator app for Windows Phone (hey, don’t judge), and while it amused me to think of a vibrator in everyone’s pocket, it didn’t exactly cause a buzz. By late 2012, I was almost a year into a struggling dating startup I created in Seattle, cornily named “Heard About You” (totally a dating site and not a 90s sitcom!). Things started looking up when I won a spot to present “Heard About You” to investors at an online incubator. Boost VC, a brand-new accelerator in Silicon Valley, discovered me from an online pitch. They invited me to spend 3 months with them in their inaugural class. And that’s where the alchemy happened. I entered Boost’s accelerator as the only solo founder, and it weighed on me. My girlfriend at the time, still long distance in Seattle, lent her design skills, but I didn’t have any real teammates. Halfway through Boost, with the help of some liquid courage, I took a hard look at my company’s chances, and I did not like what I saw. I doubted my ability to get enough attention, users, or investment. And I still didn’t have a co-founder. The resulting drunken conversation with entrepreneurs from other startups in the accelerator office was refreshingly honest, funny, and raw. We lamented that dating sites discouraged people from being upfront about their sexual desire; we decided you could simply say that you want to ‘bang’ someone. I vented my frustration that my idea for matching friends-of-friends required a ‘middle man’ without equally strong motivations; we narrowed the search to your Facebook friends. The idea was to go for the jugular. People are curious about who they can hook up with, especially with whom they’ve already met. Lesson 1: Ask yourself hard questions about your startup’s viability. Start free-flowing conversations about your approach and upcoming challenges with blunt, knowledgeable people without a vested interest who can view your startup from the outside. Happy with the intoxicated brainstorming but not thinking much of it, I headed to the city to party. It wasn’t long before I got a text that two others from Boost wanted to start working on the idea. I rushed back in the middle of the night. We cranked out the first version in 3 hours, fueled by Redbull vodkas, and christened the project with an epic name. “Bang With Friends” was born. That first night of creating the MVP was electric. We flowed seamlessly, rarely getting stuck. When we previewed the app to our colleagues, they went wild, marking their friends they wanted to “bang.” After pressing the “I’m Down to Bang” button on their Facebook friends, many begged us to add sharing features so they could find out which friends reciprocated their interest. At their request, we made sharing easier and got our first spike of users, around 500 or so. Lesson 2: I knew we were onto something special because it never failed to evoke a strong reaction, and their faces lit up. Disruptive tech should evoke strong reactions. So if you’re testing potential startup ideas, favor those with noticeable and even polarizing responses. We kept our identities anonymous to avoid compromising our other startups. Some of us worried about what our parents would think. But the anonymity only fueled the hype behind our app. Between preparing for our investor pitches during our “day jobs,” we sent dozens of emails to news sites about Bang With Friends. One of those emails was to BroBible, a hub for male millennials like The Chive or Maxim, with a fratty vibe many initially associated with Bang With Friends. With BroBible’s short article, news of our scandalous app spread like wildfire: we hit 10k user signups in a single day! Our servers — and our drunkenly-built prototype — were crashing under the load. Despite running on fumes from ‘round the clock’ work, I was buzzing with excitement from the electric vibe in the office. My life was fielding interview requests, fixing the servers, and working on app improvements. Our first day of huge press happened to be the day that billionaire investor Tim Draper, whose son Adam Draper created Boost VC, was coming by to discuss investing in my original startup. He sensed the energy in the office and asked me what was happening. Honestly, I was scared to tell him. I remember feeling the pit in my stomach as I confessed that I had launched a side project that was getting press. I paused… then spilled the words “bang with friends”. He sat quietly for a moment, wrinkling his eyebrows, then said that he thought it was a great concept. After an hour of discussion, he offered to invest $100k in each of Bang With Friends and my original startup. After graduating from Boost and with the app taking off, I moved to San Francisco, sleeping in my car for a few nights before finding a place I could afford. Unfortunately, my two co-founders didn’t come along for the ride; they wanted to focus on their other projects. So I was once again a solo founder. The move came with further sacrifice, leading to the breakup with my girlfriend of over two years. But it did mark the real beginning of the company stemming from the app. As we continued adding features and scaling the site to support the wave of visitors, I continued driving press. I conducted interviews anonymously, going by the letter “C.” I fielded interviews with journalists in dozens of countries and gained coverage from almost every country. Fast Company called our company “disruptive” and “the beginning of a sexual revolution.” Marie Claire print magazine instructed readers to try our app if they’re “just down for the night.” Germany’s SPIEGEL said we were “causing a stir,” while BuzzFeed gave us the front page treatment. Humorously for me, the largest university Christian group with “almost 900 chapters active at 576 U.S. colleges,” InterVarsity Christian Fellowship USA, brought us more attention by declaring us “the evilest app ever.” Within the first few weeks, my brother texted me with the teaser video for The Colbert Report’s upcoming show… and it hinted at a dating app for friends! Our accelerator office went crazy with excitement as we gathered around the TV to hear Stephen Colbert joke about Bang With Friends with his millions of viewers. It was one of the most incredible and surreal parts of the journey. Lesson 3: Build a press plan with plenty of story angles that would get clicks. Word-of-mouth is great, but big stories can make a huge splash. Share your ideas for headlines and what your company’s doing with friends, then write down which parts spark their interest. Seeing the spikes in traffic coming from the press, I made a six-month plan with potential story angles for each month. Not all of them landed, but with 4 of 6 picked up, we continued our time in the press spotlight. Despite the incredible attention from the media, most of our traffic continued to be from word-of-mouth via Facebook shares. It sunk in that this was a big deal when I spotted a stranger on our site in a coffee shop in San Francisco. With the huge momentum in the first month and fundraising interest picking up, one of the press opportunities we spotted was to take over the famous SXSW Tech Conference with guerilla marketing. The problem was that we had less than 3 weeks to prepare — it was way too late for any speaking gigs or official events. So we hacked together a one-time spin-off “Bang With SXSW” site so attendees could match each other. To get the word out, we plastered sexy posters based on our original logo around the event sites. As soon as we started seeing posts on social media, we heard of a major roadblock. The SXSW organizers started tearing the posters down and demanded we disable our event website! They didn’t realize that this act of censorship played directly into our hands. Lesson 4: Be interesting, be provocative, but most of all, be different! Too many entrepreneurs worry about getting the perfect story about their startup out there, rather than pragmatically leaning into one aspect of their story that makes them worth talking about. So, take more chances with your marketing and product, erring on the side of different. The news of a “ban” by SXSW created a “Streisand Effect,” causing thousands of attendees to share it. I spoke with TechCrunch and many other outlets. Someone even falsely claimed to be our CMO Founder on camera, causing a small crisis for our anonymous founder story. But the hype from the tech-focused crowd at SXSW buoyed us through the next few months of grueling fundraising. With all this hype, you might think raising money from investors would be easy. Unfortunately, after the initial $100k from Tim Draper, finding more proved damn difficult. The virality of our app got me in the door to countless VC offices, but one by one, they rejected us. Many just wanted to meet the mysterious founder. Others confessed that their investors wouldn’t allow them to fund a sexually-focused company. Now, I admit that my fundraising game was weak. From Sequoia Ventures to Greylock to IDG Ventures, who offered to lead our round and then reneged, we heard hundreds of “no”s. Without a lead VC investor, no one wanted to risk their reputation. One smaller firm in NYC did invest a modest amount in our seed round but failed to lead it, funding a competitor shortly after. Failing with VCs, we found success with bold and independent-minded angel investors. They were less afraid to take a chance on a solo founder in an unsure market that lacked huge returns (very few saw what juggernauts Tinder would become). Many bought into our $1.1m round because they were “founder-focused” and believed in my perseverance. I took this to heart, making sure to repay that trust years later with our successful exit. Y Combinator, the most famous accelerator in the world, invited me to interview for their next batch. Despite encouragement from Sam Altman (with whom I’m still in touch and admire) and a positive meeting with Paul Graham, the five-person panel rejected us due to our sexual nature and my solo founder status. I can only imagine the doors they could’ve opened and the bigger impact we could’ve had on the world had YC been braver concerning our branding. Lesson 5: Become comfortable painting a grand vision in your investor pitch! Other founders are pitching “pie in the sky” visions to secure the bag; you need to “sell” investors that they can hit it big with your company. Practice selling in the mirror and with your team until you start to believe it yourself! Traditional startup investors weren’t the only ones we approached. Alongside a production company, we took our pitch for a “Bang With Friends” dating reality TV show to Hollywood. After pitching five different networks, Lifetime TV, to our great surprise, offered us a TV pilot! Unfortunately, they stood firm on demands for equity in our company (not just the TV show) and a change in guard at the network kiboshed that deal and, with it, our TV dreams. As quickly as the wins stacked up, things took a sharp turn. One day, Apple banned us from the App Store without explanation. We got cut off from our top source of new users with only the vaguest hint at why, despite repeated emails and phone calls. This was such an existential threat to our company that I nearly got arrested when I drove down to their Cupertino HQ to find out why! After removing the word ‘bang’ from the app entirely and changing the app’s title, we got reinstated some three months later. Following Apple’s ban, the organizers of an NYC party leaked our identities, jeopardizing our private lives, other startups, and a key press angle. Yet, the leak freed me up for two key plays that were previously impossible: public appearances and exclusive Bang With Friends parties. The ensuing interviews led to more positive reviews, including from the notoriously harsh Valleywag, who helped reduce our frat-boy image when they said I was “hardly the Tucker Max misogynist you might have expected to invent something like this. Rather, he comes across more like a friendly, sex positive brogrammer in search of a viral loop.” I went on to do video interviews and conferences across the world, learning on-the-fly how to tackle public speaking in front of thousands. Our exclusive parties in New York, San Francisco, and then Austin for SXSW 2014 were thrilling. With a custom site for each event, attendees would sign up for party access and to match with each other. On the wild side, an attractive journalist got into our VIP section in NYC, sat on my lap, and whispered in my ear, “my editor wanted me to get a story on you, but I told him tonight I’m going to fuck you instead.” A few days later, I got an email with her story draft containing intimate details of our hookup, including dick size and skills, despite her promises of off-record action. Thankfully, she decided against sharing it with her editor! Our at-capacity party in San Francisco ended with women dancing on the bar and an afterparty at our office, known as “The BangPad.” Two months after the drama with Apple, Zynga sued us over the use of “With Friends” for alleged trademark infringement on their game, Words With Friends. Legal and tech pundits weighed in, with many stating the obvious. “With friends” is a generic descriptor that perfectly described our app’s functionality. It seemed implausible that consumers would confuse a family-friendly Scrabble-copycat game with our raunchy hookup app. Still, Zynga’s war chest threatened to bankrupt us, so we resolved the issue in mediation. We evolved the brand for broader appeal, not limited to “friends” or “banging,” and avoided paying them a cent. Our simple yet communicative new brand, DOWN, still had a playful side with its wink to the colloquial phrases “Down to Fuck (DTF)” and “Are you down?” yet allowed us on the app stores and a broader product. Lesson 6: A lot of startup life is just staying alive. Even when it feels like your world is crashing down around you, take a step back and think of what advice you’d give to another entrepreneur. Then make those difficult decisions: downsize, cut features or whole products, and be scrappy: squeeze the most out of your runway by delaying or negotiating bills, moving to free trials, etc. Following the rebrand to DOWN, we needed to get back on radars with exciting news. First, we brought our scintillating “Bangability” feature, a sort of hotness score based on swipes on your profile and calibrated to similar people near you, to our mobile apps. This Hot-or-Not-like rating drove virality and coverage from Business Insider, VICE, and more. To cap off the rebranding, after toiling in our loft apartment/office in SOMA for almost six months, we rolled out our unique and sexy new design to great reviews. Unlike Tinder’s card-like UX with 2 gestures (left or right), we focused on 3-way gestures to express your true intentions: up to “hang” (date), down to “get down”, and left to skip. Thanks to a slick circular interface and intimate emphasis on users’ photos, each profile felt fresh versus the more utilitarian feel compared to other apps. Around 1.5 years in, some young bankers approached us, who thought we could sell the company for a nice profit. I was skeptical but wanted to exhaust all options while I was struggling to raise more funding on weak metrics. From 2014–16, we spoke to dozens of potential acquirers: companies from the serious side of dating, like Hinge and Match Group (owners of Tinder), to the seedier side, like Ashley Madison. Discussions went far with a few, but none offered good terms for our assets. Hinge and social app Tango gave us offers that were basically “acqui-hires,” promising me a cushy salary and equity to lead growth or product teams. Ashley Madison flew me to their Toronto HQ in a series of uneasy discussions and due diligence but lowballed us on an offer. That uneasy feeling turned out to be right, as a hack exposed that the company deployed massive numbers of female bots to trick their members! In truth, I wasn’t ready to give up on our vision to make the world more sexually progressive and make dating more honest. Lesson 7: The key to our survival during this time was learning to wear many hats, including marketing, programming, DevOps, and remote team management. When funds or staffing are low, take on new areas in your startup, learning from others’ first-hand accounts and your own trial and error to get those areas “good enough.” During my trip to the 2014 Brazil World Cup, I caught the travel bug hardcore and started to tire of hearing the same Silicon Valley babble. So I sold most of my belongings, serendipitously had my car stolen and reimbursed by another startup, then escaped the San Francisco bubble to become a digital nomad. At this point, our bank account was dangerously close to empty. Even so, deciding to shrink the team to myself, plus a few part-time contractors, was no easy decision, but I knew I had to do something to shake things up. So I cut all our employees. I tried my best to place our six or so staff into jobs at other companies, with engineers going to Instacart and Facebook. Our most impactful team member, Nadav Mills, who greatly helped with design and product, went on to start his own company. From my new base in Guatemala, I did morning Spanish classes, continued trying to fundraise and growth hack in quaint cafes with spotty wifi during the day, and completed Spanish homework while coding at night. While lost somewhere in Central America or Southeast Asia (I don’t remember which), I realized I needed to build revenue. As a user, I was always skeptical about the subscription model. I preferred one-off purchases and experimented with charging to view extra profiles. The results? Damn near disastrous. At most, I projected we would make up to $3k per month. Around that time, I was in Bali, Indonesia, to speak at a tech conference about organic marketing. By chance, I met someone working on a new accelerator in Taipei, Taiwan. The thought of having a steady base for three months and another $40k in funding drew me in, along with the allure of the unknown in Taiwan. With the accelerator promising cheap app distribution to new markets in Asia, I didn’t have time to code subscription purchases. So I risked some short-term gain for the long-term prize of building sustainable revenue. I cut a deal with contractors for 50% profit sharing for the first 3 months and a modest fixed fee. Lesson 8: Make short-term trade-offs for outsized long-term gains. Look at deals with an eye toward what they can unlock in a year or more. Consider trading higher costs now for accelerants that help you reach game-changing milestones. They made out like bandits, with revenue topping $10k per month, earning them 2x their typical rates. But the trade-off was worth it for me, and our business became profitable and escaped death once again! Before I arrived in Taiwan, I received an email from the CEO of Paktor, a dating app startup in Singapore, who was interested in buying or investing in us. He floated a few ideas, from a tempting large cash exit to a far less attractive $100–200k investment for too much equity. I was getting worn out from the solo founder life, and the thought of joining forces with a bigger team with more resources sounded like relief. Lesson 9: Avoid selling when you’re feeling desperate. This can mean arranging a quick respite for yourself or calling in favors from others to help buy yourself some more time and perspective. Paktor happened to have a core office in Taipei, so our in-person meeting led to an offer a few months later. It wasn’t my dream offer or even some immediate liquidity for our investors (we were told an IPO in Australia was in the works), but the vision and our complementary strengths sold me. While I built DOWN from organic marketing, this CEO grew his app with targeted ad spend and already had years of monetization experience. He also boasted a richer network and fundraising ability, allowing me to focus on growing our companies’ metrics rather than selling investors. After the letter of intent, I was able to negotiate an increase in shares but no cash for shareholders, something that Paktor’s board of directors had nixed. Unlike with his board, I didn’t utilize anyone as a “bad cop,” which meant Paktor’s CEO had one (tired) person to convince. Without another buyer, I didn’t know how far I could push the negotiations. So I accepted that deal framing and bargained about my employment terms instead. With our subscription revenue only starting around that time and going to be substantially higher six months later, I should have found ways to delay the deal or demand better terms. Even without another serious buyer, I could have regrounded myself by making a “Plan B” that entailed staying independent with revenue paying for more help. Lesson 10: In negotiations, use or invent a bad cop to establish limits and look out for theirs. Even when you’re the primary decision maker, you need another party to consult for deal terms and act as your control against unfavorable terms so that the other company’s negotiations aren’t too easy. In hindsight, I was happy to conclude the deal for millions of dollars in shares and sell the company. The process took three months of negotiating and six months after the offer. Though we had our differences, I respect the business acumen, intelligence, and hustle of our acquirer’s CEO. Plus, our investors did get rewarded for their patience and trust a few years later when the parent company offered to buy back shares at a premium compared to their principal. Within a year of joining Paktor, the company began a merger with 17Live, the top live-streaming app in Taiwan. I was growing Paktor Labs at the time from my nomad’s paradise in Thailand. My role was helping to acquire and grow multiple apps alongside DOWN, including one that would become the top-grossing dating app in Taiwan. Yet, the real impact was in Taiwan, not Thailand, and I took on the Head of Growth & Marketing position within the merged company. From the start, adapting to Taiwan’s very different work culture was an uphill battle. Reshaping their marketing in a language I didn’t speak or read was challenging. Finding areas for growth hacking was easier, but negotiating resources was a game of influence where people take orders from the top down. Still, with the help of some scrappy team members, we discovered some fruitful growth hacks for retention and revenue in our quest for the user’s “magic moment.” My team’s marketing efforts drove improvements in ads and organic installs. I saw our handiwork around the country, from buses to billboards and videos. After years of patience, the company’s shareholders were thirsty for liquidity. So corporate bankers from Goldman Sachs and Deutsche Bank visited to sell the dream of a billion-dollar IPO in the US. Suddenly, things were full speed ahead. But, despite my promotion to Chief Growth Officer, I struggled to be included in the process. Lesson 11: IPOs are tough to pull off. Make sure your company meets the prerequisites and is open to ending the process before debut if things aren’t shaping up. You’ll need investor awareness and interest, especially from your primary market, a great pitch, and good luck with timing. If you don’t have those, consider options other than IPO. Eying an IPO on the New York Stock Exchange in May 2018, the investor roadshow started in Asia with a fizzle. The pitch team arrived in the US, exhausted, where I offered my support to pitch our growth story. I was in NYC to witness a tired pitch before being dismissed without the chance to help and met back in the city on the eve of the IPO. Our presumed valuation was ~$300m, significantly lower than the ‘unicorn’ exit we discussed. Even worse, there was a shortfall in funds, so one of the wealthy founders aimed to swoop in to fill the gap overnight. The next morning, the CEO and select shareholders — excluding me — were on the NYSE stage to ring the bell, opening trading for the day before we went public. But there was a snag. The gap-stop money was stuck in a bank that wasn’t participating in the IPO, so they demanded an IPO fee and a month to review. Without those funds, the pricing book was too light and other commitments dropped out. The CEO & CFO chose to cancel the IPO and return to Taiwan to regroup. We may be the only company to ring the NYSE bell without actually listing to go public. Those same bankers who oversold 17Live’s IPO prospects gave me an unexpected gift when they forced the company to sell some assets pre-IPO. One of those assets was DOWN, which they feared would steal the attention and taint the company’s reputation during the IPO roadshow in the US, given DOWN’s widespread press coverage. DOWN was sold in a fire sale to a former engineer from 17Live, who seemed to value the business much lower than his other company. So I offered to help keep “my baby” alive after the sale. When one of my best friends and earliest members of Bang With Friends seemed interested in co-owning the company with me, we spotted a unique opportunity to swoop in to save this distressed asset. So we negotiated a deal to buy back the company in the low six digits, significantly under the on-paper value we sold it for two years earlier. Lesson 12: Look for the opportunity when life forces a sudden change. I was saddened when I learned that DOWN wouldn’t be a part of the IPO and public company, but as things shook out, I pounced on the opportunity. If you have trouble spotting the silver lining in sad events, try making a pros/cons list. I’m one of the very few founders who sold their company and bought it back for a much better price (on paper, at least). I count myself very lucky for this stroke of luck, both for the reward of seeing DOWN grow into the potential I saw ten long years ago and for the monetary rewards. In January this year, DOWN celebrated its 10th anniversary. It’s been a helluva journey; drama with the app stores, lawsuits, spotlights in the press, staffing up and down, selling the company, an embarrassing failed IPO, and then scooping up the app before its demise. But that journey isn’t done yet: we now have over 10 million users, and since 2019, our user match-rate has gone up 500%, while our revenue has grown by 268%. We are a top 20 dating app in the USA with millions of downloads, and our remote team has led us to profitability every year since we reacquired the company. Today, DOWN makes millions of dollars per year in revenue and is carrying on the sexual revolution we started a decade before. -- -- 19 Entrepreneur's Handbook Founder & Fmr CEO of LiveAF & DOWN; Fmr Chief Growth Officer @ M17 Ent.; Product Strategy & Growth-Hacker; Featured Conference Speaker (SXSW, Business Insider) Colin Hodge -- Tim Denning in Entrepreneur's Handbook -- 94 Joseph Mavericks in Entrepreneur's Handbook -- 13 Colin Hodge -- 8 Fiona Renate -- 40 The Good Men Project in Hello, Love -- 256 James Michael Sama -- 20 Dr. Samantha Rodman Whiten (Dr. Psych Mom) -- 29 Markham Heid in THE NUANCE -- 100 Debra Groves Harman in Ellemeno -- 66 Help Status Writers Blog Careers Privacy Terms About Text to speech", "url": "https://entrepreneurshandbook.co/the-bang-with-friends-story-under-the-covers-77f757bdb822?source=home---------2---------------------3901f1f8_742d_4f4c_99a6_eeaf1fc46509-------7", "threshold": 0.9999999983872478}