{"title": "UX Collective", "content": "Sign up Sign In Sign up Sign In 458K Followers Home About Editors' picks Receive our newsletter  Publish a story Guineafowl Lab ·Pinned AR designers are the magicians of our time. Here’s what they need to know to safely re-enchant the world. —  by Shay Segal and Nadav Neuman In 1968, science fiction writer Arthur C. Clarke outlined one of his “Clarke’s Laws”: “Any sufficiently advanced technology is indistinguishable from magic.” What did he mean by that? Let’s consider an average Joe from the 18th century: He could never comprehend the technology behind… 19 min read 19 min read Talieh Kazemi ·Pinned Interpreting design-induced changes in user behavior: tips to avoid common mistakes and achieve accurate analysis. —  Introduction Key Factors That Can Affect User Behavior Changes Over Time 1. Cognitive Fluctuations 2. Psycho-Social Factors 3. Sociological Factors 4. Economical Factors 5. Political Factors 6. Technological Factors 7. Environmental Factors 8. Demographic Factors Effective Approaches for Measuring the Impact of a New Design: Statistical Analysis and Time Series… 12 min read 12 min read Christopher Reardon ·Pinned Making things that think. —  I was inspired by this post on LinkedIn. AI makes me superhuman — or so the saying goes. As a designer and sci-fi movie lover, I’ve always been captivated by the utopian vision of AI as an assistant or guardian taking care of my every whim, whether it’s the omnipresent voice of Scarlet Johannson in Her, a caring robot in… 9 min read 9 min read Bruno Temporim Carneiro ·Pinned An experiment on component organization. —  TL;DR: In this guide, I will share a method for structuring Figma components through nesting and organizing variants. This approach allows for easy modification and updates to components. Please note that while others may have discovered similar methods, the solutions presented in this article are based on my own trial-and-error… 11 min read 11 min read Sarowar Hossain ·Pinned A guide to conducting card sorting with participants who are visually impaired. —  Card Sorting is a UX research method used to understand how users categorize and organize information, which reflects how they expect information and content to be organized on a user interface. In this method, participants are given a set of cards containing words, phrases, or concepts and are asked to… 6 min read 6 min read Chris Kernaghan ·Pinned Member-only Validating user demand and saving time with Fake Door Testing. —  I used to work with a startup that was ‘all in’ on UX design. From the top down, in an admittedly small company, they were invested professionally and financially in connecting with users. They specialized in educational technology, so many students were often willing to participate in user testing sessions… 7 min read 7 min read Daley Wilhelm ·Pinned Member-only Hosting TTRPGs could help you become a better designer, researcher, and writer. —  It should come as no surprise that there is a significant overlap between user research nerds and fantasy nerds. UX is a nerdy profession that requires in depth research, stepping into the shoes of users and personas, improvising interviews, and thinking outside of the box. Playing Dungeons & Dragons (DnD)… 9 min read 9 min read Callie Spears ·Pinned There is a lot we all don’t know. —  The first draft of this article was completely different. Originally, it was about how privacy is overrated. The ways we act super afraid of losing it, but while living in an increasingly digital world with more and more personalized content, it also feels impossible to keep. It’s just small scraps… 6 min read 6 min read Joe Alterio ·Pinned The system strikes back. —  In 1895, at least 1900 different companies were producing over 3,000 makes of automobiles. These automobiles varied in size and shape, in manufacturing style, and in energy sources — electric, gas, oil. The intent was fairly aligned — reduction of energy spent on human-sized transportation– but the outputs were wildly… 8 min read 8 min read Dave Hora ·Pinned Research rides three waves of technology: one receding, one rising, one forming in the distance. —  The first wave of research, receding now, grew from academia. The current wave is cresting, ready to wash over software design and product management. And third-wave research will reach even higher, moving into product and organizational strategy. Each wave inevitably consumes and builds upon the prior — they don’t end… 14 min read 14 min read We believe designers are thinkers as much as they are makers. Curated stories on UX, Visual & Product Design. https://linktr.ee/uxc ·  459K followers Connect with UX Collective Designer at Work & Co, Founder of UX Collective — http://twitter.com/fabriciot designer @ Momentive.ai, editor @ UX Collective A weekly resourceful newsletter that helps designers stay in the know, be productive, and think more critically about their work. Take a look. By signing up, you will create a Medium account if you don’t already have one. Review our Privacy Policy for more information about our privacy practices. Help Status Writers Blog Careers Privacy Terms About Text to speech", "url": "https://medium.com/user-experience-design-1?source=home---------0---------------------3901f1f8_742d_4f4c_99a6_eeaf1fc46509-------7", "threshold": -0.9977011816814494}