{"title": "Log in - Wikipedia", "content": " Cattle (Bos taurus) are large, domesticated, cloven-hooved, herbivores. They are a prominent modern member of the subfamily Bovinae and the most widespread species of the genus Bos. Adult females are referred to as cows and adult males are referred to as bulls. Cattle are commonly raised as livestock for meat (beef or veal, see beef cattle), for milk (see dairy cattle), and for hides, which are used to make leather. They are used as riding animals and draft animals (oxen or bullocks, which pull carts, plows and other implements). Another product of cattle is their dung, which can be used to create manure or fuel. In some regions, such as parts of India, cattle have significant religious significance. Cattle, mostly small breeds such as the Miniature Zebu, are also kept as pets. Different types of cattle are common to different geographic areas. Taurine cattle are found primarily in Europe and temperate areas of Asia, the Americas, and Australia. Zebus (also called indicine cattle) are found primarily in India and tropical areas of Asia, America, and Australia. Sanga cattle are found primarily in sub-Saharan Africa. These types (which are sometimes classified as separate species or subspecies) are further divided into over 1,000 recognized breeds. Around 10,500 years ago, taurine cattle were domesticated from as few as 80 wild aurochs progenitors in central Anatolia, the Levant and Western Iran.[1] A separate domestication event occurred in the Indian subcontinent, which gave rise to zebu. According to the Food and Agriculture Organization (FAO), there are approximately 1.5 billion cattle in the world as of 2018.[2] Cattle are the main source of greenhouse gas emissions from livestock, and are responsible for around 10% of global greenhouse gas emissions.[3][4] In 2009, cattle became one of the first livestock animals to have a fully mapped genome.[5] Cattle were originally identified as three separate species: Bos taurus, the European or \"taurine\" cattle (including similar types from Africa and Asia); Bos indicus, the Indicine or \"zebu\"; and the extinct Bos primigenius, the aurochs. The aurochs is ancestral to both zebu and taurine cattle.[6] They were later reclassified as one species, Bos taurus, with the aurochs, zebu, and taurine cattle as subspecies.[7] However, this taxonomy is contentious and some sources prefer the separate species classification, such as the American Society of Mammalogists' Mammal Diversity Database.[8][9] Complicating the matter is the ability of cattle to interbreed with other closely related species. Hybrid individuals and even breeds exist, not only between taurine cattle and zebu (such as the sanga cattle (Bos taurus africanus x Bos indicus), but also between one or both of these and some other members of the genus Bos – yaks (the dzo or yattle[10]), banteng, and gaur. Hybrids such as the beefalo breed can even occur between taurine cattle and either species of bison, leading some authors to consider them part of the genus Bos, as well.[11] The hybrid origin of some types may not be obvious – for example, genetic testing of the Dwarf Lulu breed, the only taurine-type cattle in Nepal, found them to be a mix of taurine cattle, zebu, and yak.[12] However, cattle cannot be successfully hybridized with more distantly related bovines such as water buffalo or African buffalo. The aurochs originally ranged throughout Europe, North Africa, and much of Asia. In historical times, its range became restricted to Europe, and the last known individual died in Mazovia, Poland, in about 1627.[13] Breeders have attempted to recreate cattle of similar appearance to aurochs by crossing traditional types of domesticated cattle, creating the Heck cattle breed. The only pure African taurine breeds (Bos taurus africanus) remaining are the N'Dama, Kuri and some varieties of the West African Shorthorn.[14] Cattle did not originate as the term for bovine animals. It was borrowed from Anglo-Norman catel, itself from medieval Latin capitale 'principal sum of money, capital', itself derived in turn from Latin caput 'head'. Cattle originally meant movable personal property, especially livestock of any kind, as opposed to real property (the land, which also included wild or small free-roaming animals such as chickens—they were sold as part of the land).[15][16] The word is a variant of chattel (a unit of personal property) and closely related to capital in the economic sense.[17][18][16] The term replaced earlier Old English feoh 'cattle, property', which survives today as fee (cf. German: Vieh, Dutch: vee, Gothic: faihu). The word cow came via Anglo-Saxon cū (plural cȳ), from Common Indo-European gʷōus (genitive gʷowés) 'a bovine animal', cf. Persian: gâv, Sanskrit: go-, Welsh: buwch.[19] The plural cȳ became ki or kie in Middle English, and an additional plural ending was often added, giving kine, kien, but also kies, kuin and others. This is the origin of the now archaic English plural, kine. The Scots language singular is coo or cou, and the plural is kye. In older English sources such as the King James Version of the Bible, cattle refers to livestock, as opposed to deer which refers to wildlife. Wild cattle may refer to feral cattle or to undomesticated species of the genus Bos. Today, when used without any other qualifier, the modern meaning of cattle is usually restricted to domesticated bovines.[16] In general, the same words are used in different parts of the world, but with minor differences in the definitions. The terminology described here contrasts the differences in definition between the United Kingdom and other British-influenced parts of the world such as Canada, Australia, New Zealand, Ireland and the United States.[20] \"Cattle\" can only be used in the plural and not in the singular: it is a plurale tantum.[31] Thus one may refer to \"three cattle\" or \"some cattle\", but not \"one cattle\". \"One head of cattle\" is a valid though periphrastic way to refer to one animal of indeterminate or unknown age and sex; otherwise no universally used single-word singular form of cattle exists in modern English, other than the sex- and age-specific terms such as cow, bull, steer and heifer. Historically, \"ox\" was not a sex-specific term for adult cattle, but generally this is now used only for working cattle, especially adult castrated males. The term is also incorporated into the names of other species, such as the musk ox and \"grunting ox\" (yak), and is used in some areas to describe certain cattle products such as ox-hide and oxtail.[32] Cow is in general use as a singular for the collective cattle. The word cow is easy to use when a singular is needed and the sex is unknown or irrelevant—when \"there is a cow in the road\", for example. Further, any herd of fully mature cattle in or near a pasture is statistically likely to consist mostly of cows, so the term is probably accurate even in the restrictive sense. Other than the few bulls needed for breeding, the vast majority of male cattle are castrated as calves and are used as oxen or slaughtered for meat before the age of three years. Thus, in a pastured herd, any calves or herd bulls usually are clearly distinguishable from the cows due to distinctively different sizes and clear anatomical differences. Merriam-Webster and Oxford Living Dictionaries recognize the sex-nonspecific use of cow as an alternate definition,[33][34] whereas Collins and the OED do not. Colloquially, more general nonspecific terms may denote cattle when a singular form is needed. Head of cattle is usually used only after a numeral. Australian, New Zealand and British farmers use the term beast or cattle beast. Bovine is also used in Britain. The term critter is common in the western United States and Canada, particularly when referring to young cattle.[35] In some areas of the American South (particularly the Appalachian region), where both dairy and beef cattle are present, an individual animal was once called a \"beef critter\", though that term is becoming archaic. Cattle raised for human consumption are called beef cattle. Within the beef cattle industry in parts of the United States, the term beef (plural beeves) is still used in its archaic sense to refer to an animal of either sex. Cows of certain breeds that are kept for the milk they give are called dairy cows or milking cows (formerly milch cows). Most young male offspring of dairy cows are sold for veal, and may be referred to as veal calves. The term dogies is used to describe orphaned calves in the context of ranch work in the American West, as in \"Keep them dogies moving\".[36] In some places, a cow kept to provide milk for one family is called a \"house cow\". Other obsolete terms for cattle include \"neat\" (this use survives in \"neatsfoot oil\", extracted from the feet and legs of cattle), and \"beefing\" (young animal fit for slaughter). An onomatopoeic term for one of the most common sounds made by cattle is moo (also called lowing). There are a number of other sounds made by cattle, including calves bawling, and bulls bellowing. Bawling is most common for cows after weaning of a calf. The bullroarer makes a sound similar to a bull's territorial call.[37] Cattle are large quadrupedal ungulate mammals with cloven hooves. Most breeds have horns, which can be as large as the Texas Longhorn or small like a scur. Careful genetic selection has allowed polled (hornless) cattle to become widespread. Cattle are ruminants, meaning their digestive system is highly specialized to allow the consumption of difficult to digest plants as food. Cattle have one stomach with four compartments, the rumen, reticulum, omasum, and abomasum, with the rumen being the largest compartment.The reticulum, the smallest compartment, is known as the \"honeycomb\". The omasum's main function is to absorb water and nutrients from the digestible feed. The omasum is known as the \"many plies\". The abomasum is like the human stomach; this is why it is known as the \"true stomach\". Cattle are known for regurgitating and re-chewing their food, known as cud chewing, like most ruminants. While the animal is feeding, the food is swallowed without being chewed and goes into the rumen for storage until the animal can find a quiet place to continue the digestion process. The food is regurgitated, a mouthful at a time, back up to the mouth, where the food, now called the cud, is chewed by the molars, grinding down the coarse vegetation to small particles. The cud is then swallowed again and further digested by specialized microorganisms in the rumen. These microbes are primarily responsible for decomposing cellulose and other carbohydrates into volatile fatty acids cattle use as their primary metabolic fuel. The microbes inside the rumen also synthesize amino acids from non-protein nitrogenous sources, such as urea and ammonia. As these microbes reproduce in the rumen, older generations die and their cells continue on through the digestive tract. These cells are then partially digested in the small intestines, allowing cattle to gain a high-quality protein source. These features allow cattle to thrive on grasses and other tough vegetation. The gestation period for a cow is about nine months long. A newborn calf's size can vary among breeds, but a typical calf weighs 25 to 45 kg (55 to 99 lb). Adult size and weight vary significantly among breeds and sex. Steers are generally slaughtered before reaching 750 kg (1,650 lb). Breeding stock may be allowed a longer lifespan, occasionally living as long as 25 years. The oldest recorded cow, Big Bertha, died at the age of 48 in 1993. On farms it is very common to use artificial insemination (AI), a medically assisted reproduction technique consisting of the artificial deposition of semen in the female's genital tract.[38] It is used in cases where the spermatozoa can not reach the fallopian tubes or by choice of the owner of the animal. It consists of transferring, to the uterine cavity, spermatozoa previously collected and processed, with the selection of morphologically more normal and mobile spermatozoa. A cow's udder contains two pairs of mammary glands, (commonly referred to as teats) creating four \"quarters\".[39] The front ones are referred to as fore quarters and the rear ones rear quarters.[40] Synchronization of cattle ovulation to benefit dairy farming may be accomplished via induced ovulation techniques. The secondary sex ratio – the ratio of male to female offspring at birth – is approximately 52:48, although it may be influenced by environmental and other factors.[41] Bulls become fertile at about seven months of age. Their fertility is closely related to the size of their testicles, and one simple test of fertility is to measure the circumference of the scrotum: a young bull is likely to be fertile once this reaches 28 centimetres (11 in); that of a fully adult bull may be over 40 centimetres (16 in).[42][43] A bull has a fibro-elastic penis. Given the small amount of erectile tissue, there is little enlargement after erection. The penis is quite rigid when non-erect, and becomes even more rigid during erection. Protrusion is not affected much by erection, but more by relaxation of the retractor penis muscle and straightening of the sigmoid flexure.[44][45][46] The weight of adult cattle varies, depending on the breed. Smaller kinds, such as Dexter and Jersey adults, range between 300 and 500 kg (600 and 1,000 lb).[citation needed] Large Continental breeds, such as Charolais, Marchigiana, Belgian Blue and Chianina adults range from 640 to 1,100 kg (1,400 to 2,500 lb).[citation needed] British breeds, such as Hereford, Angus, and Shorthorn, mature at 500 to 900 kg (1,000 to 2,000 lb), occasionally higher, particularly with Angus and Hereford.[citation needed] Bulls are larger than cows of the same breed by up to a few hundred kilograms. British Hereford cows weigh 600–800 kg (1,300–1,800 lb); the bulls weigh 1,000–1,200 kg (2,200–2,600 lb).[47] Chianina bulls can weigh up to 1,500 kg (3,300 lb); British bulls, such as Angus and Hereford, can weigh as little as 900 kg (2,000 lb) and as much as 1,400 kg (3,000 lb).[citation needed] The world record for the heaviest bull was 1,740 kg (3,840 lb), a Chianina named Donetto, when he was exhibited at the Arezzo show in 1955.[48] The heaviest steer was eight-year-old 'Old Ben', a Shorthorn/​Hereford cross weighing in at 2,140 kg (4,720 lb) in 1910.[49] In the United States, the average weight of beef cattle has steadily increased, especially since the 1970s, requiring the building of new slaughterhouses able to handle larger carcasses. New packing plants in the 1980s stimulated a large increase in cattle weights.[50] Before 1790 beef cattle averaged only 160 kg (350 lb) net; and thereafter weights climbed steadily.[51][52] In laboratory studies, young cattle are able to memorize the locations of several food sources and retain this memory for at least 8 hours, although this declined after 12 hours.[53] Fifteen-month-old heifers learn more quickly than adult cows which have had either one or two calvings, but their longer-term memory is less stable.[54] Mature cattle perform well in spatial learning tasks and have a good long-term memory in these tests. Cattle tested in a radial arm maze are able to remember the locations of high-quality food for at least 30 days. Although they initially learn to avoid low-quality food, this memory diminishes over the same duration.[55] Under less artificial testing conditions, young cattle showed they were able to remember the location of feed for at least 48 days.[56] Cattle can make an association between a visual stimulus and food within 1 day—memory of this association can be retained for 1 year, despite a slight decay.[57] Calves are capable of discrimination learning[58] and adult cattle compare favourably with small mammals in their learning ability in the closed-field test.[59] They are also able to discriminate between familiar individuals, and among humans. Cattle can tell the difference between familiar and unfamiliar animals of the same species (conspecifics). Studies show they behave less aggressively toward familiar individuals when they are forming a new group.[60] Calves can also discriminate between humans based on previous experience, as shown by approaching those who handled them positively and avoiding those who handled them aversively.[61] Although cattle can discriminate between humans by their faces alone, they also use other cues such as the color of clothes when these are available.[62] In audio play-back studies, calves prefer their own mother's vocalizations compared to the vocalizations of an unfamiliar mother.[63] In laboratory studies using images, cattle can discriminate between images of the heads of cattle and other animal species.[64] They are also able to distinguish between familiar and unfamiliar conspecifics. Furthermore, they are able to categorize images as familiar and unfamiliar individuals.[60] When mixed with other individuals, cloned calves from the same donor form subgroups, indicating that kin discrimination occurs and may be a basis of grouping behaviour. It has also been shown using images of cattle that both artificially inseminated and cloned calves have similar cognitive capacities of kin and non-kin discrimination.[65] Cattle can recognize familiar individuals. Visual individual recognition is a more complex mental process than visual discrimination. It requires the recollection of the learned idiosyncratic identity of an individual that has been previously encountered and the formation of a mental representation.[66] By using two-dimensional images of the heads of one cow (face, profiles, 3⁄4 views), all the tested heifers showed individual recognition of familiar and unfamiliar individuals from their own breed. Furthermore, almost all the heifers recognized unknown individuals from different breeds, although this was achieved with greater difficulty. Individual recognition was most difficult when the visual features of the breed being tested were quite different from the breed in the image, for example, the breed being tested had no spots whereas the image was of a spotted breed.[67] Cattle use visual/brain lateralisation in their visual scanning of novel and familiar stimuli.[68] Domestic cattle prefer to view novel stimuli with the left eye, i.e. using the right brain hemisphere (similar to horses, Australian magpies, chicks, toads and fish) but use the right eye, i.e. using the left hemisphere, for viewing familiar stimuli.[69] In cattle, temperament can affect production traits such as carcass and meat quality or milk yield as well as affecting the animal's overall health and reproduction. Cattle temperament is defined as \"the consistent behavioral and physiological difference observed between individuals in response to a stressor or environmental challenge and is used to describe the relatively stable difference in the behavioral predisposition of an animal, which can be related to psychobiological mechanisms\".[71] Generally, cattle temperament is assumed to be multidimensional. Five underlying categories of temperament traits have been proposed:[72] In a study on Holstein–Friesian heifers learning to press a panel to open a gate for access to a food reward, the researchers also recorded the heart rate and behavior of the heifers when moving along the race towards the food. When the heifers made clear improvements in learning, they had higher heart rates and tended to move more vigorously along the race. The researchers concluded this was an indication that cattle may react emotionally to their own learning improvement.[73] Negative emotional states are associated with a bias toward negative responses towards ambiguous cues in judgement tasks. After separation from their mothers, Holstein calves showed such a cognitive bias indicative of low mood.[74] A similar study showed that after hot-iron disbudding (dehorning), calves had a similar negative bias indicating that post-operative pain following this routine procedure results in a negative change in emotional state.[75] In studies of visual discrimination, the position of the ears has been used as an indicator of emotional state.[60] When cattle are stressed other cattle can tell by the chemicals released in their urine.[76] Cattle are very gregarious and even short-term isolation is considered to cause severe psychological stress. When Aubrac and Friesian heifers are isolated, they increase their vocalizations and experience increased heart rate and plasma cortisol concentrations. These physiological changes are greater in Aubracs. When visual contact is re-instated, vocalizations rapidly decline, regardless of the familiarity of the returning cattle, however, heart rate decreases are greater if the returning cattle are familiar to the previously isolated individual.[77] Mirrors have been used to reduce stress in isolated cattle.[78] Cattle use all of the five widely recognized sensory modalities. These can assist in some complex behavioural patterns, for example, in grazing behaviour. Cattle eat mixed diets, but when given the opportunity, show a partial preference of approximately 70% clover and 30% grass. This preference has a diurnal pattern, with a stronger preference for clover in the morning, and the proportion of grass increasing towards the evening.[79] Vision is the dominant sense in cattle and they obtain almost 50% of their information visually.[80] Cattle are a prey animal and to assist predator detection, their eyes are located on the sides of their head rather than the front. This gives them a wide field of view of 330° but limits binocular vision (and therefore stereopsis) to 30° to 50° compared to 140° in humans.[60][81] This means they have a blind spot directly behind them. Cattle have good visual acuity,[60] but compared to humans, their visual accommodation is poor.[clarification needed][80] Cattle have two kinds of color receptors in the cone cells of their retinas. This means that cattle are dichromatic, as are most other non-primate land mammals.[82][83] There are two to three rods per cone in the fovea centralis but five to six near the optic papilla.[81] Cattle can distinguish long wavelength colors (yellow, orange and red) much better than the shorter wavelengths (blue, grey and green). Calves are able to discriminate between long (red) and short (blue) or medium (green) wavelengths, but have limited ability to discriminate between the short and medium. They also approach handlers more quickly under red light.[84] Whilst having good color sensitivity, it is not as good as humans or sheep.[60] A common misconception about cattle (particularly bulls) is that they are enraged by the color red (something provocative is often said to be \"like a red flag to a bull\"). This is a myth. In bullfighting, it is the movement of the red flag or cape that irritates the bull and incites it to charge.[85] Cattle have a well-developed sense of taste and can distinguish the four primary tastes (sweet, salty, bitter and sour). They possess around 20,000 taste buds. The strength of taste perception depends on the individual's current food requirements. They avoid bitter-tasting foods (potentially toxic) and have a marked preference for sweet (high calorific value) and salty foods (electrolyte balance). Their sensitivity to sour-tasting foods helps them to maintain optimal ruminal pH.[80] Plants have low levels of sodium and cattle have developed the capacity of seeking salt by taste and smell. If cattle become depleted of sodium salts, they show increased locomotion directed to searching for these. To assist in their search, the olfactory and gustatory receptors able to detect minute amounts of sodium salts increase their sensitivity as biochemical disruption develops with sodium salt depletion.[86][87] Cattle hearing ranges from 23 Hz to 35 kHz. Their frequency of best sensitivity is 8 kHz and they have a lowest threshold of −21 db (re 20 μN/m−2), which means their hearing is more acute than horses (lowest threshold of 7 db).[88] Sound localization acuity thresholds are an average of 30°. This means that cattle are less able to localise sounds compared to goats (18°), dogs (8°) and humans (0.8°).[89] Because cattle have a broad foveal fields of view covering almost the entire horizon, they may not need very accurate locus information from their auditory systems to direct their gaze to a sound source. Vocalizations are an important mode of communication amongst cattle and can provide information on the age, sex, dominance status and reproductive status of the caller. Calves can recognize their mothers using vocalizations; vocal behaviour may play a role by indicating estrus and competitive display by bulls.[90] Cattle have a range of odiferous glands over their body including interdigital, infraorbital, inguinal and sebaceous glands, indicating that olfaction probably plays a large role in their social life. Both the primary olfactory system using the olfactory bulbs, and the secondary olfactory system using the vomeronasal organ are used.[91] This latter olfactory system is used in the flehmen response. There is evidence that when cattle are stressed, this can be recognised by other cattle and this is communicated by alarm substances in the urine.[76] The odour of dog faeces induces behavioural changes prior to cattle feeding, whereas the odours of urine from either stressed or non-stressed conspecifics and blood have no effect.[92] In the laboratory, cattle can be trained to recognise conspecific individuals using olfaction only.[91] In general, cattle use their sense of smell to \"expand\" on information detected by other sensory modalities. However, in the case of social and reproductive behaviours, olfaction is a key source of information.[80] Cattle have tactile sensations detected mainly by mechanoreceptors, thermoreceptors and nociceptors in the skin and muscles. These are used most frequently when cattle explore their environment.[80] There is conflicting evidence for magnetoreception in cattle. One study reported that resting and grazing cattle tend to align their body axes in the geomagnetic north–south direction.[93] In a follow-up study, cattle exposed to various magnetic fields directly beneath or in the vicinity of power lines trending in various magnetic directions exhibited distinct patterns of alignment.[94] However, in 2011, a group of Czech researchers reported their failed attempt to replicate the finding using Google Earth images.[95] Under natural conditions, calves stay with their mother until weaning at 8 to 11 months. Heifer and bull calves are equally attached to their mothers in the first few months of life.[96] Cattle are considered to be \"hider\" type animals, utilizing secluded areas more in the hours before calving and continued to use it more for the hour after calving. Cows that gave birth for the first time show a higher incidence of abnormal maternal behavior.[97] In one study, beef-calves reared on the range were observed to suckle an average of 5.0 times every 24 hours with an average total time of 46 min spent suckling. There was a diurnal rhythm in suckling activity with peaks between 05:00–07:00, 10:00–13:00 and 17:00–21:00.[98] Semi-wild Highland cattle heifers first give birth at 2 or 3 years of age, and the timing of birth is synchronized with increases in natural food quality. Average calving interval is 391 days, and calving mortality within the first year of life is 5%.[99] One study showed that over a 4-year period, dominance relationships within a herd of semi-wild highland cattle were very firm. There were few overt aggressive conflicts and the majority of disputes were settled by agonistic (non-aggressive, competitive) behaviors that involved no physical contact between opponents (e.g. threatening and spontaneous withdrawing). Such agonistic behavior reduces the risk of injury. Dominance status depended on age and sex, with older animals generally being dominant to young ones and males dominant to females. Young bulls gained superior dominance status over adult cows when they reached about 2 years of age.[99] As with many animal dominance hierarchies, dominance-associated aggressiveness does not correlate with rank position, but is closely related to rank distance between individuals.[99] Dominance is maintained in several ways. Cattle often engage in mock fights where they test each other's strength in a non-aggressive way. Licking is primarily performed by subordinates and received by dominant animals. Mounting is a playful behavior shown by calves of both sexes and by bulls and sometimes by cows in estrus,[100] however, this is not a dominance related behavior as has been found in other species.[99] The horns of cattle are \"honest signals\" used in mate selection. Furthermore, horned cattle attempt to keep greater distances between themselves and have fewer physical interactions than hornless cattle. This leads to more stable social relationships.[101] In calves, the frequency of agonistic behavior decreases as space allowance increases, but this does not occur for changes in group size. However, in adult cattle, the number of agonistic encounters increases as the group size increases.[102] When grazing, cattle vary several aspects of their bite, i.e. tongue and jaw movements, depending on characteristics of the plant they are eating. Bite area decreases with the density of the plants but increases with their height. Bite area is determined by the sweep of the tongue; in one study observing 750-kilogram (1,650 lb) steers, bite area reached a maximum of approximately 170 cm2 (30 sq in). Bite depth increases with the height of the plants. By adjusting their behavior, cattle obtain heavier bites in swards that are tall and sparse compared with short, dense swards of equal mass/area.[103] Cattle adjust other aspects of their grazing behavior in relation to the available food; foraging velocity decreases and intake rate increases in areas of abundant palatable forage.[104] Cattle avoid grazing areas contaminated by the faeces of other cattle more strongly than they avoid areas contaminated by sheep,[105] but they do not avoid pasture contaminated by rabbit faeces.[106] On 24 April 2009, edition of the journal Science, a team of researchers led by the National Institutes of Health and the US Department of Agriculture reported having mapped the bovine genome.[107] The scientists found cattle have about 22,000 genes, and 80% of their genes are shared with humans, and they share about 1000 genes with dogs and rodents, but are not found in humans[clarification needed]. Using this bovine \"HapMap\", researchers can track the differences between the breeds that affect the quality of meat and milk yields.[108] Behavioral traits of cattle can be as heritable as some production traits, and often, the two can be related.[109] The heritability of fear varies markedly in cattle from low (0.1) to high (0.53); such high variation is also found in pigs and sheep, probably due to differences in the methods used.[110] The heritability of temperament (response to isolation during handling) has been calculated as 0.36 and 0.46 for habituation to handling.[111] Rangeland assessments show that the heritability of aggressiveness in cattle is around 0.36.[112] Quantitative trait loci (QTLs) have been found for a range of production and behavioral characteristics for both dairy and beef cattle.[113] Cattle occupy a unique role in human history, having been domesticated since at least the early neolithic age. Archaeozoological and genetic data indicate that cattle were first domesticated from wild aurochs (Bos primigenius) approximately 10,500 years ago. There were two major areas of domestication: one in the Near East (specifically central Anatolia, the Levant and Western Iran), giving rise to the taurine line, and a second in the area that is now Pakistan, resulting in the indicine line.[114] Modern mitochondrial DNA variation indicates the taurine line may have arisen from as few as 80 aurochs tamed in the upper reaches of Mesopotamia near the villages of Çayönü Tepesi in what is now southeastern Turkey and Dja'de el-Mughara in what is now northern Syria.[1] Although European cattle are largely descended from the taurine lineage, gene flow from African cattle (partially of indicine origin) contributed substantial genomic components to both southern European cattle breeds and their New World descendants.[114] A study on 134 breeds showed that modern taurine cattle originated from Africa, Asia, North and South America, Australia, and Europe.[115] Some researchers have suggested that African taurine cattle are derived from a third independent domestication from North African aurochsen.[114] As early as 9000 BC both grain and cattle were used as money or as barter (the first grain remains found, considered to be evidence of pre-agricultural practice date to 17,000 BC).[116][117][118] Some evidence also exists to suggest that other animals, such as camels and goats, may have been used as currency in some parts of the world.[119] One of the advantages of using cattle as currency is that it allows the seller to set a fixed price. It even created the standard pricing. For example, two chickens were traded for one cow as cows were deemed to be more valuable than chickens.[117] Cattle are often raised by allowing herds to graze on the grasses of large tracts of rangeland. Raising cattle in this manner allows the use of land that might be unsuitable for growing crops. The most common interactions with cattle involve daily feeding, cleaning and milking. Many routine husbandry practices involve ear tagging, dehorning, loading, medical operations, artificial insemination, vaccinations and hoof care, as well as training for agricultural shows and preparations. Also, some cultural differences occur in working with cattle; the cattle husbandry of Fulani men rests on behavioural techniques, whereas in Europe, cattle are controlled primarily by physical means, such as fences.[120] Breeders use cattle husbandry to reduce M. bovis infection susceptibility by selective breeding and maintaining herd health to avoid concurrent disease.[121] Cattle are farmed for beef, veal, dairy, and leather. They are less commonly used for conservation grazing, or to maintain grassland for wildlife, such as in Epping Forest, England. They are often used in some of the most wild places for livestock. Depending on the breed, cattle can survive on hill grazing, heaths, marshes, moors and semidesert. Modern cattle are more commercial than older breeds and, having become more specialized, are less versatile. For this reason, many smaller farmers still favor old breeds, such as the Jersey dairy breed.In Portugal, Spain, southern France and some Latin American countries, bulls are used in the activity of bullfighting; In many other countries bullfighting is illegal. Other activities such as bull riding are seen as part of a rodeo, especially in North America. Bull-leaping, a central ritual in Bronze Age Minoan culture (see Sacred Bull), still exists in southwestern France. In modern times, cattle are also entered into agricultural competitions. These competitions can involve live cattle or cattle carcases in hoof and hook events. In terms of food intake by humans, consumption of cattle is less efficient than of grain or vegetables with regard to land use, and hence cattle grazing consumes more area than such other agricultural production when raised on grains.[122] Nonetheless, cattle and other forms of domesticated animals can sometimes help to use plant resources in areas not easily amenable to other forms of agriculture. Bulls are sometimes used as guard animals.[123][124] In occasional cases, cattle are kept as pets, and pet cows often have sweet temperaments, enjoying being petted and \"kissing\" (licking) their owners. But there are costs to keeping them as pets that limit how many people can practically do so; not everyone has space or facilities for a large-animal pet, and some amount of resources are needed to keep one humanely (such as pasture, hay, feed, water, and large-animal veterinary care). In addition, because livestock animals are gregarious, they need at least one companion to avoid being stressed or lonely, so keeping bovine, caprine, or ovine pets requires more than one animal. Most pet cows live on farms that have other livestock anyway, as the marginal cost of one or two more animals is then not very large. Farmers have traditionally often been averse to making pets out of livestock, on the principle that each animal must pay its way somehow if the farm is to survive financially, and also because there are sufficient opportunities for moments of petting and animal appreciation among the herd anyway, even when none of them are pets per se. The average sleep time of a domestic cow is about 4 hours a day.[125] Cattle do have a stay apparatus,[126] but do not sleep standing up;[127] they lie down to sleep deeply.[128] In spite of the urban legend, cows cannot be tipped over by people pushing on them.[129] The meat of adult cattle is known as beef, and that of calves is veal. Other animal parts are also used as food products, including blood, liver, kidney, heart and oxtail. Cattle also produce milk, and dairy cattle are specifically bred to produce the large quantities of milk processed and sold for human consumption. Cattle today are the basis of a multibillion-dollar industry worldwide. The international trade in beef for 2000 was over $30 billion and represented only 23% of world beef production.[130] Approximately 300 million cattle, including dairy cattle, are slaughtered each year for food.[131] The production of milk, which is also made into cheese, butter, yogurt, and other dairy products, is comparable in economic size to beef production, and provides an important part of the food supply for many of the world's people. Cattle hides, used for leather to make shoes, couches and clothing, are another widespread product. Cattle remain broadly used as draft animals in many developing countries, such as India. Cattle are also used in some sporting games, including rodeo and bullfighting. Source: Helgi Library,[132] World Bank, FAOSTAT About a quarter of the world's meat comes from cattle.[133] Certain breeds of cattle, such as the Holstein-Friesian, are used to produce milk,[134][135] which can be processed into dairy products such as milk, cheese or yogurt. Dairy cattle are usually kept on specialized dairy farms designed for milk production. Most cows are milked twice per day, with milk processed at a dairy, which may be onsite at the farm or the milk may be shipped to a dairy plant for eventual sale of a dairy product.[136] Lactation is induced in heifers and spayed cows by a combination of physical and psychological stimulation, by drugs, or by a combination of those methods.[137][138] For mother cows to continue producing milk, they give birth to one calf per year. If the calf is male, it generally is slaughtered at a young age to produce veal.[139] They will continue to produce milk until three weeks before birth.[135] Over the last fifty years, dairy farming has become more intensive to increase the yield of milk produced by each cow. The Holstein-Friesian is the breed of dairy cow most common in the UK, Europe and the United States. It has been bred selectively to produce the highest yields of milk of any cow. Around 22 litres per day is average in the UK.[134][135] Most cattle are not kept solely for hides, which are usually a by-product of beef production. Hides are most commonly used for leather, which can be made into a variety of products, including shoes. In 2012 India was the world's largest producer of cattle hides.[140] Feral cattle are defined as being 'cattle that are not domesticated or cultivated'.[141] Populations of feral cattle are known to come from and exist in: Australia, United States of America,[142] Colombia, Argentina, Spain, France and many islands, including New Guinea, Hawaii, Galapagos, Juan Fernández Islands, Hispaniola (Dominican Republic and Haiti), Tristan da Cunha and Île Amsterdam,[7] two islands of Kuchinoshima[143] and Kazura Island next to Naru Island in Japan.[144][145] Chillingham cattle is sometimes regarded as a feral breed.[146] Aleutian wild cattles can be found on Aleutian Islands.[147] The \"Kinmen cattle\" which are dominantly found on Kinmen Island, Taiwan is mostly domesticated while smaller portion of the population is believed to live in the wild due to accidental releases.[148] Other notable examples include cattle in the vicinity of Hong Kong (in the Shing Mun Country Park,[149] among Sai Kung District[150] and Lantau Island[151] and on Grass Island[152]), and semi-feral animals in Yangmingshan, Taiwan.[153] (2003) & Hoekstra (2003) (2003) Gut flora in cattle include methanogens that produce methane as a byproduct of enteric fermentation, which cattle belch out. The same volume of atmospheric methane has a 72x higher (over 20 years)[157] global warming potential than atmospheric carbon dioxide.[158][159] Methane belching from cattle can be reduced with genetic selection, immunization against the many methanogens, rumen defaunation (killing the bacteria-killing protozoa),[160] diet modification (e.g. seaweed fortification),[161] decreased antibiotic use,[162] and grazing management, among others.[163][164][165] A 2013 report from the Food and Agriculture Organization (FAO) based on 2005 data states that the livestock sector is responsible for 14.5% of greenhouse gas emissions, 65% of which is due to cattle.[3] The IPCC estimates that cattle and other livestock emit about 80 to 93 Megatonnes of methane per year,[166] accounting for an estimated 37% of anthropogenic methane emissions,[167] and additional methane is produced by anaerobic fermentation of manure in manure lagoons and other manure storage structures.[168] Another estimate is 12% of global GHG.[4] While cattle fed forage actually produce more methane than grain-fed cattle, the increase may be offset by the increased carbon recapture of pastures, which recapture three times the CO2 of cropland used for grain.[169] One of the cited changes suggested to reduce greenhouse gas emissions is intensification of the livestock industry,[citation needed] since intensification leads to less land for a given level of production. This assertion is supported by studies of the US beef production system, suggesting practices prevailing in 2007 involved 8.6% less fossil fuel use, 16.3% less greenhouse gas emissions, 12.1% less water use, and 33.0% less land use, per unit mass of beef produced, than those used in 1977.[170] The analysis took into account not only practices in feedlots, but also feed production (with less feed needed in more intensive production systems), forage-based cow-calf operations and back-grounding before cattle enter a feedlot (with more beef produced per head of cattle from those sources, in more intensive systems), and beef from animals derived from the dairy industry. A more controversial suggestion, advocated by George Monbiot in the documentary \"Apocalypse Cow\", is to stop farming cattle completely, however farmers often have political power so might be able to resist such a big change.[171] Significant numbers of dairy, as well as beef cattle, are confined in concentrated animal feeding operations (CAFOs), defined as \"new and existing operations which stable or confine and feed or maintain for a total of 45 days or more in any 12-month period more than the number of animals specified\"[172] where \"[c]rops, vegetation, forage growth, or post-harvest residues are not sustained in the normal growing season over any portion of the lot or facility.\"[173] They may be designated as small, medium and large. Such designation of cattle CAFOs is according to cattle type (mature dairy cows, veal calves or other) and cattle numbers, but medium CAFOs are so designated only if they meet certain discharge criteria, and small CAFOs are designated only on a case-by-case basis.[174] A CAFO that discharges pollutants is required to obtain a permit, which requires a plan to manage nutrient runoff, manure, chemicals, contaminants, and other wastewater pursuant to the US Clean Water Act.[175] The regulations involving CAFO permitting have been extensively litigated.[176]Commonly, CAFO wastewater and manure nutrients are applied to land at agronomic rates for use by forages or crops, and it is often assumed that various constituents of wastewater and manure, e.g. organic contaminants and pathogens, will be retained, inactivated or degraded on the land with application at such rates; however, additional evidence is needed to test reliability of such assumptions.[177] Concerns raised by opponents of CAFOs have included risks of contaminated water due to feedlot runoff,[178] soil erosion, human and animal exposure to toxic chemicals, development of antibiotic resistant bacteria and an increase in E. coli contamination.[179] While research suggests some of these impacts can be mitigated by developing wastewater treatment systems[178] and planting cover crops in larger setback zones,[180] the Union of Concerned Scientists released a report in 2008 concluding that CAFOs are generally unsustainable and externalize costs.[169] Another concern is manure, which if not well-managed, can lead to adverse environmental consequences. However, manure also is a valuable source of nutrients and organic matter when used as a fertilizer.[181] Manure was used as a fertilizer on about 6,400,000 hectares (15.8 million acres) of US cropland in 2006, with manure from cattle accounting for nearly 70% of manure applications to soybeans and about 80% or more of manure applications to corn, wheat, barley, oats and sorghum.[182] Substitution of manure for synthetic fertilizers in crop production can be environmentally significant, as between 43 and 88 megajoules of fossil fuel energy would be used per kg of nitrogen in manufacture of synthetic nitrogenous fertilizers.[183] Grazing by cattle at low intensities can create a favourable environment for native herbs and forbs by mimicking the native grazers who they displaced; in many world regions, though, cattle are reducing biodiversity due to overgrazing.[184] A survey of refuge managers on 123 National Wildlife Refuges in the US tallied 86 species of wildlife considered positively affected and 82 considered negatively affected by refuge cattle grazing or haying.[185] Proper management of pastures, notably managed intensive rotational grazing and grazing at low intensities can lead to less use of fossil fuel energy, increased recapture of carbon dioxide, fewer ammonia emissions into the atmosphere, reduced soil erosion, better air quality, and less water pollution.[169] The veterinary discipline dealing with cattle and cattle diseases (bovine veterinary) is called buiatrics.[186] Veterinarians and professionals working on cattle health issues are pooled in the World Association for Buiatrics, founded in 1960.[187] National associations and affiliates also exist.[188] Cattle diseases were in the center of attention in the 1980s and 1990s when the Bovine spongiform encephalopathy (BSE), also known as mad cow disease, was of concern. Cattle might catch and develop various other diseases, like blackleg, bluetongue, foot rot too.[189][190][191] In most states, as cattle health is not only a veterinarian issue, but also a public health issue, public health and food safety standards and farming regulations directly affect the daily work of farmers who keep cattle.[192] However, said rules change frequently and are often debated. For instance, in the U.K., it was proposed in 2011 that milk from tuberculosis-infected cattle should be allowed to enter the food chain.[193] Internal food safety regulations might affect a country's trade policy as well. For example, the United States has just reviewed its beef import rules according to the \"mad cow standards\"; while Mexico forbids the entry of cattle who are older than 30 months.[194] Cow urine is commonly used in India for internal medical purposes.[195][196] It is distilled and then consumed by patients seeking treatment for a wide variety of illnesses.[197] At present, no conclusive medical evidence shows this has any effect.[198] However, an Indian medicine containing cow urine has already obtained U.S. patents.[199] Digital dermatitis is caused by the bacteria from the genus Treponema. It differs from foot rot and can appear under unsanitary conditions such as poor hygiene or inadequate hoof trimming, among other causes. It primarily affects dairy cattle and has been known to lower the quantity of milk produced, however the milk quality remains unaffected. Cattle are also susceptible to ringworm caused by the fungus, Trichophyton verrucosum, a contagious skin disease which may be transferred to humans exposed to infected cows.[200] Stocking density refers to the number of animals within a specified area. When stocking density reaches high levels, the behavioural needs of the animals may not be met. This can negatively influence health, welfare and production performance.[201] The effect of overstocking in cows can have a negative effect on milk production and reproduction rates which are two very important traits for dairy farmers. Overcrowding of cows in barns has been found to reduced feeding, resting and rumination.[201] Although they consume the same amount of dry matter within the span of a day, they consume the food at a much more rapid rate, and this behaviour in cows can lead to further complications.[202] The feeding behaviour of cows during their post-milking period is very important as it has been proven that the longer animals can eat after milking, the longer they will be standing up and therefore causing less contamination to the teat ends.[203] This is necessary to reduce the risk of mastitis as infection has been shown to increase the chances of embryonic loss.[204] Sufficient rest is important for dairy cows because it is during this period that their resting blood flow increases up to 50%, this is directly proportionate to milk production.[203] Each additional hour of rest can be seen to translate to 2 to 3.5 more pounds of milk per cow daily. Stocking densities of anything over 120% have been shown to decrease the amount of time cows spend lying down.[205] Cortisol is an important stress hormone; its plasma concentrations increase greatly when subjected to high levels of stress.[206] Increased concentration levels of cortisol have been associated with significant increases in gonadotrophin levels and lowered progestin levels. Reduction of stress is important in the reproductive state of cows as an increase in gonadotrophin and lowered progesterone levels may impinge on the ovulatory and lutenization process and to reduce the chances of successful implantation.[207] A high cortisol level will also stimulate the degradation of fats and proteins which may make it difficult for the animal to sustain its pregnancy if implanted successfully.[206] Animal rights activists have criticized the treatment of cattle, claiming that common practices in cattle husbandry, slaughter and entertainment unnecessarily cause fear, stress, and pain. They advocate for abstaining from the consumption of cattle-related animal products and cattle-based entertainment. The following husbandry practices have been criticized by animal welfare and animal rights groups:[208] branding,[209] castration,[210] dehorning,[211][failed verification] ear tagging,[212] nose ringing,[213] restraint,[214] tail docking,[215] the use of veal crates,[216] and cattle prods.[217] There are concerns that the stress and negative health impacts induced by high stocking density such as in concentrated animal feeding operations or feedlots, auctions, and during transport may be detrimental to their welfare,[218][219] and has also been criticized.[220] The treatment of dairy cows faces additional criticism. To produce milk from dairy cattle, most calves are separated from their mothers soon after birth and fed milk replacement in order to retain the cows' milk for human consumption.[221] Animal welfare advocates are critical of this practice, stating that this breaks the natural bond between the mother and her calf.[221] The welfare of veal calves is also a concern.[221] In order to continue lactation, dairy cows are bred every year, usually through artificial insemination.[221] Because of this, some individuals have posited that dairy production is based on the sexual exploitation of cows.[222] Although the natural life expectancy of cattle could be as much as twenty years,[223] after about five years, a cow's milk production has dropped; at which point most dairy cows are sent to slaughter.[224][225] While leather is often a by-product of slaughter, in some countries, such as India and Bangladesh, cows are raised primarily for their leather. These leather industries often make their cows walk long distances across borders to be killed in neighboring provinces and countries where cattle slaughter is legal. Some cows die along the long journey, and sometimes exhausted animals are abused to keep them moving.[226] These practices have faced backlash from various animal rights groups.[227] Animal treatment in rodeo is targeted most often at bull riding but also calf roping and steer roping, with the opposition saying that rodeos are unnecessary and cause stress, injury, and death to the animals.[228] In Spain, the Running of the bulls faces opposition due to the stress and injuries incurred by the bulls during the event.[229][230] Bullfighting is opposed as a blood sport in which bulls are forced to suffer severe stress and death.[231] Oxen (singular ox) are cattle trained as draft animals. Often they are adult, castrated males of larger breeds, although females and bulls are also used in some areas. Usually, an ox is over four years old due to the need for training and to allow it to grow to full size. Oxen are used for plowing, transport, hauling cargo, grain-grinding by trampling or by powering machines, irrigation by powering pumps, and wagon drawing. Oxen were commonly used to skid logs in forests, and sometimes still are, in low-impact, select-cut logging. Oxen are most often used in teams of two, paired, for light work such as carting, with additional pairs added when more power is required, sometimes up to a total of 20 or more.Oxen can be trained to respond to a teamster's signals. These signals are given by verbal commands or by noise (whip cracks). Verbal commands vary according to dialect and local tradition. Oxen can pull harder and longer than horses. Though not as fast as horses, they are less prone to injury because they are more sure-footed. Many oxen are used worldwide, especially in developing countries. About 11.3 million draft oxen are used in sub-Saharan Africa.[232] In India, the number of draft cattle in 1998 was estimated at 65.7 million head.[233] About half the world's crop production is thought to depend on land preparation (such as plowing) made possible by animal traction.[234] The cow is mentioned often in the Quran. The second and longest surah of the Quran is named Al-Baqara (\"The Cow\"). Out of the 286 verses of the surah, seven mention cows (Al Baqarah 67–73).[235][236] The name of the surah derives from this passage in which Moses orders his people to sacrifice a cow in order to resurrect a man murdered by an unknown person.[237] Veneration of the cow has become a symbol of the identity of Hindus as a community,[238]: 20  especially since the end of the 19th century. Slaughter of cows (including oxen, bulls and calves) is forbidden by law in several states of the Indian Union. McDonald's outlets in India do not serve any beef burgers. In Maharaja Ranjit Singh's empire of the early 19th century, the killing of a cow was punishable by death.[239] Cattle are typically represented in heraldry by the bull. Arms of the Azores Arms of Mecklenburg region, Germany Arms of Turin, Italy Arms of Kaunas, Lithuania Arms of Šiauliai, Lithuania Arms of Bielsk Podlaski, Poland Arms of Ciołek, Poland Arms of Turek, Poland Arms of Béarn The cattle population of Britain rose from 9.8 million in 1878 to 11.7 million in 1908, but beef consumption rose much faster. Britain became the \"stud farm of the world\" exporting livestock to countries where there were no indigenous cattle. In 1929 80% of the meat trade of the world was products of what were originally English breeds. There were nearly 70 million cattle in the US by the early 1930s.[244] For 2013, the FAO estimated global cattle numbers at 1.47 billion.[245] Regionally, the FAO estimate for 2013 includes: Asia 497 million; South America 350 million; Africa 307 million; Europe 122 million; North America 102 million; Central America 47 million; Oceania 40 million; and Caribbean 9 million. As per FAS/USDA 2021 data, India had the largest cattle population in the world in 2021 followed by Brazil and China[246] India's cattle's population was reported at 305.5 million head in 2021, accounting for roughly 30% of the world's population.India, Brazil and China accounted for roughly 65% of the world's cattle population in 2021. It has been estimated that out of all animal species on Earth, Bos taurus has the largest biomass at roughly 400 million tonnes, followed closely by Euphausia superba (Antarctic krill) at 379 million tonnes, and Homo sapiens (humans) at 373 million tonnes.[247] An enzyme inhibitor is a molecule that binds to an enzyme's active site, or another site on the enzyme, and blocks the enzyme's catalysis of the reaction. Enzyme inhibitors are generally specific to one enzyme and control that enzyme's activity. They also control essential enzymes such as proteases or nucleases that, if left unchecked, may damage a cell. Many poisons produced by animals or plants are enzyme inhibitors, and many drug molecules are enzyme inhibitors that inhibit an aberrant human enzyme or an enzyme critical for the survival of a pathogen. Since anti-pathogen inhibitors generally target only one enzyme, such drugs are highly specific and generally produce few side effects in humans. Medicinal enzyme inhibitors often have low dissociation constants, meaning a minute amount of the inhibitor will inhibit the enzyme. The discovery of enzyme inhibitors and their refinement are researched in biochemistry and pharmacology. (Full article...) March 28 Amilcare Ponchielli (1834–1886) was an Italian composer. Born in Paderno Fasolaro (now Paderno Ponchielli) near Cremona, then Kingdom of Lombardy–Venetia, Ponchielli won a scholarship at the age of nine to study music at the Milan Conservatory, writing his first symphony by the time he was ten years old. He is best known for his operas, most notably La Gioconda, the third and most successful version of which debuted at La Scala in Milan on 28 March 1880. The Dance of the Hours from that opera is widely known thanks in part to its use in Walt Disney's Fantasia in 1940 and in Allan Sherman's novelty song \"Hello Muddah, Hello Fadduh\". In 1881, Ponchielli was appointed the maestro di cappella of Bergamo Cathedral and a professor of composition at the Milan Conservatory, where his pupils included Giacomo Puccini, Pietro Mascagni, Emilio Pizzi, and Giovanni Tebaldini. He was married to the soprano Teresina Brambilla and died at the age of 51 in Milan. This formal photographic portrait of Ponchielli was taken in Milan and is in the archives of the music publisher Casa Ricordi. Photograph credit: Icilio Calzolari; restored by Adam Cuerden Wikipedia is written by volunteer editors and hosted by the Wikimedia Foundation, a non-profit organization that also hosts a range of other volunteer projects: This Wikipedia is written in English. Many other Wikipedias are available; some of the largest are listed below.  Explore Wikipedia's contents Wikipedia is a compendium of the world's knowledge. If you know what you are looking for, type it into Wikipedia's search box. If, however, you need a bird's eye view of what Wikipedia has to offer, see its main contents pages below, which in turn list more specific pages. Wikipedia's main contents systems are arranged into these subject classifications. Each subject is further divided into subtopics.  Timelines list events chronologically, sometimes including links to articles with more detail.  There are several ways to find timelines: Of particular interest may be: You can help us keep Wikipedia up to date! The list below is for encyclopedia entries that describe and pertain to events happening on a current basis.  Speaking of reference works, various third-party classification systems have been mapped to Wikipedia articles, which can be accessed from these pages: Bibliographies list sources on a given topic, for verification or further reading outside Wikipedia: Overview articles summarize in prose a broad topic like biology, and also have illustrations and links to subtopics like cell biology, biographies like Carl Linnaeus, and other related articles like Human Genome Project. Outline pages have trees of topics in an outline format, which in turn are linked to further outlines and articles providing more detail.  Outlines show how important subtopics relate to each other based on how they are arranged in the tree, and they are useful as a more condensed, non-prose alternative to overview articles. List pages enumerate items of a particular type, such as the List of sovereign states or List of South Africans.  Wikipedia has \"lists of lists\" when there are too many items to fit on a single page, when the items can be sorted in different ways, or as a way of navigating lists on a topic (for example Lists of countries and territories or Lists of people).  There are several ways to find lists: Portals contain featured articles and images, news, categories, excerpts of key articles, links to related portals, and to-do lists for editors.  There are two ways to find portals: Glossaries are lists of terms with definitions. Wikipedia includes hundreds of alphabetical glossaries; they can be found in two ways: Wikipedia's collection of category pages is a classified index system.  It is automatically generated from category tags at the bottoms of articles and most other pages. Nearly all of the articles available so far on the website can be found through these subject indexes. If you are simply looking to browse articles by topic, there are two top-level pages to choose from: For biographies, see Category:People. Category:Contents is technically at the top of the category hierarchy, but contains many categories useful to editors but not readers. Special:Categories lists every category alphabetically. Vital articles are lists of subjects for which the English Wikipedia should have corresponding high-quality articles. They serve as centralized watchlists to track the quality status of Wikipedia's most important articles and to give editors guidance on which articles to prioritize for improvement. Featured content represents the best of Wikipedia, and has undergone a thorough review process to ensure that it meets the highest encyclopedic standards. Presented by type: Good articles are articles that meet a core set of editorial standards, the good article criteria, and successfully pass through the good article nomination process. They are well written, contain factually accurate and verifiable information, are broad in coverage, neutral in point of view, stable, and illustrated, where possible, by relevant images with suitable copyright licenses. Growing collections of Wikipedia articles are starting to become available as spoken word recordings as well. Wikipedia's alphabetical article indexes Types Topics Places, people and times Indices Edit instructions Armed conflicts and attacks Disasters and accidents Law and crime International relations Armed conflicts and attacks Disasters and accidents International relations Law and crime Politics and elections Science and technology Disasters and accidents Health and environment International relations Politics and elections Armed conflicts and attacks Disasters and accidents International relations Law and crime Politics and elections Science and technology Armed conflicts and attacks Disasters and accidents Law and crime Armed conflicts and attacks Disasters and accidents Health and environment Law and crime Science and technology Sports Armed conflicts and attacks Disasters and accidents Politics and elections Science and technology Animation (Anime) · Architecture · Comics · Film (Horror, Science fiction) · Literature (Poetry) · Music (Classical, Country, Hip hop, Jazz, Latin, Metal, Rock, UK, US, Korea) · Radio · Television (Australia, Canada, Ireland, UK, Scotland, US) · Video games Elections · International leaders · Sovereign states · Sovereign state leaders · Territorial governors Archaeology · Biotechnology · Computing · Palaeontology · Quantum computing and communication · Senescence research · Space/Astronomy · Spaceflight · Sustainable energy research Climate change · Weather Aviation · Rail transport · Transportation technology Afghanistan · Albania · Algeria · Andorra · Angola · Antarctica · Antigua and Barbuda · Argentina · Armenia · Australia · Austria · Azerbaijan · Bangladesh · The Bahamas · Bahrain · Barbados · Belarus · Belgium · Belize · Benin · Bhutan · Bolivia · Bosnia and Herzegovina · Botswana · Brazil · Brunei · Bulgaria · Burkina Faso · Burundi · Cambodia · Cameroon · Canada · Cape Verde · Central African Republic · Chad · Chile · China · Colombia · Costa Rica · Comoros · Congo · D.R. Congo · Croatia · Cuba · Cyprus · Czech Republic · Denmark · Djibouti · Dominica · Dominican Republic · East Timor · Ecuador · Egypt · El Salvador · Eritrea · Estonia · Ethiopia · Eswatini · Equatorial Guinea · Fiji · Finland · France · Gabon · The Gambia · Georgia · Germany · Ghana · Greece · Grenada · Guatemala · Guinea · Guinea-Bissau · Guyana · Haiti · Honduras · Hong Kong · Hungary · Iceland · India · Indonesia · Iran · Iraq · Ireland · Israel · Italy · Ivory Coast · Jamaica · Japan · Jordan · Kazakhstan · Kenya · Kiribati · Kosovo · Kuwait · Kyrgyzstan · Laos · Latvia · Lebanon · Lesotho · Liberia ·  Liechtenstein · Libya · Lithuania · Luxembourg · Macau · Madagascar · Marshall Islands · Malawi · Malaysia · Maldives · Mali · Malta · Mauritania · Mauritius · Mexico · Micronesia · Moldova · Monaco · Mongolia · Montenegro · Morocco · Mozambique · Myanmar · Nauru · Namibia · Nepal · Netherlands · New Zealand · Nicaragua · Niger · Nigeria · North Korea · North Macedonia · Norway · Oman · Pakistan · Palau · Palestine · Panama · Papua New Guinea · Paraguay · Peru · Philippines · Poland · Portugal · Qatar · Romania · Russia · Rwanda · Saint Kitts and Nevis · Saint Lucia · Saint Vincent and the Grenadines · Samoa · San Marino · São Tomé and Príncipe · Saudi Arabia · Senegal · Serbia · Seychelles · Sierra Leone · Singapore · Slovakia · Slovenia · Somalia · South Africa · Solomon Islands · South Korea · South Sudan · Spain · Sri Lanka · Sudan · Suriname · Sweden · Switzerland · Syria · Taiwan · Tajikistan · Tanzania · Thailand · Togo · Tonga · Trinidad and Tobago · Tunisia · Turkey · Turkmenistan · Tuvalu · Uganda · Ukraine · United Arab Emirates · United Kingdom · United States · Uruguay · Uzbekistan · Vanuatu · Vatican City · Venezuela · Vietnam · Yemen · Zambia · Zimbabwe Establishments · Disestablishments Works · Introductions · Works entering the public domain  The District Council of Portland Estate was a local government area of South Australia established in 1859 and abolished in 1884. It was seated at the Portland Estate subdivision, immediately south of the modern township of Port Adelaide.[1] The council was proclaimed on 15 September 1859.[2][3] It included sections 1128 through 1131 on the boundary of the hundreds of Port Adelaide and Yatala. This being the land south of the Tam O'Shanter Creek and east of the Old Port Reach (Port Creek), stretching eastwards to modern Commercial Road and southwards to Webb Street, the modern boundary of Port Adelaide and Queenstown[2] The council was amalgamated in to the Corporate Town of Port Adelaide on 4 December 1884.  This article about Adelaide is a stub. You can help Wikipedia by expanding it.   Wikipedia is a free online encyclopedia that anyone can edit in good faith, and tens of millions already have! Wikipedia's purpose is to benefit readers by containing information on all branches of knowledge. Hosted by the Wikimedia Foundation, Wikipedia consists of freely editable content, whose articles also have numerous links to guide readers to more information. Written collaboratively by largely anonymous volunteers, anyone with Internet access and not blocked, can write and make changes to Wikipedia articles (except in limited cases where editing is restricted to prevent disruption or vandalism). Since its creation on January 15, 2001, Wikipedia has grown into the world's largest reference website, attracting over a billion visitors monthly. It currently has more than sixty million articles in more than 300 languages, including 6,635,356 articles in English with 129,868 active contributors in the past month. The fundamental principles of Wikipedia are summarized in its five pillars. The Wikipedia community has developed many policies and guidelines, but you do not need to be familiar with every one of them before contributing. Anyone can edit Wikipedia's text, references, and images. What is written is more important than who writes it. The content must conform with Wikipedia's policies, including being verifiable by published sources. Editors' opinions, beliefs, personal experiences, unreviewed research, libelous material, and copyright violations will not remain. Wikipedia's software allows easy reversal of errors, and experienced editors watch and patrol bad edits. Wikipedia differs from printed references in important ways. It is continually created and updated, and encyclopedic articles on new events appear within minutes rather than months or years. Because anyone can improve Wikipedia, it has become more comprehensive, clear, and balanced than any other encyclopedia. Its contributors improve the quality and quantity of the articles as well as remove misinformation, errors, and vandalism. Any reader can fix a mistake or add more information to articles (see Researching with Wikipedia).  Begin by simply clicking the [edit] or [edit source] buttons or the pencil icon  at the top of any non-protected page or section. Wikipedia has tested the wisdom of the crowd since 2001 and found that it succeeds.  Introduction ReadersHow to report a problem with an article, or find out more information. Article subjectsProblems with articles about you, your company, or somebody you represent. LicensingHow to copy Wikipedia's information, donate your own, or report unlicensed use of your information. DonorsFind out about the process, how to donate, and information about how your money is spent. Press and partnershipsIf you're a member of the press looking to contact Wikipedia, or have a business proposal for us.  Back to main page  Thank you for your interest in contacting Wikipedia. Before proceeding, some important disclaimers: The links on the left should direct you to how to contact us or resolve problems. If you cannot find your issue listed there, you can email helpful, experienced volunteers at info-enwikimedia.org. Please refrain from emailing about disagreements with content; they will not be resolved via email.      Thank you for considering a donation to the Wikimedia Foundation, the nonprofit that hosts Wikipedia and other crucial free knowledge projects. Each year, because of the 2% of readers who give to support our mission, we can expand the reach of free knowledge to new corners of the world. If Wikipedia matters and is useful to you too, please join them and donate R$10, R$20, R$50 or whatever feels right to you today. Wikipedia is different. No advertising, no subscription fees, no paywalls. Those don't belong here. Wikipedia is a place to learn, free from bias or agenda. Today, we invite you to donate whatever feels right. Show the world that access to independent and unbiased information matters to you. Thank you.     Technology: Servers, bandwidth, maintenance, development. Wikipedia is one of the top 10 websites in the world, and it runs on a fraction of what other top websites spend. People and Projects: The other top websites have thousands of employees. We have about 700 staff and contractors to support a wide variety of projects, making your donation a great investment in a highly-efficient not-for-profit organization. Tax deductibility information We do not sell or trade your information to anyone. By donating, you agree to share your personal information with the Wikimedia Foundation, the nonprofit organization that hosts Wikipedia and other Wikimedia projects, and its service providers pursuant to our donor policy. Wikimedia Foundation and its service providers are located in the United States and in other countries whose privacy laws may not be equivalent to your own. For more information please read our donor policy. For recurring donors, fixed monthly payments will be debited by the Wikimedia Foundation on the monthly anniversary of the first donation, until such time as you notify us to discontinue them. Donations initiated on the 29, 30, or 31 of the month will recur on the last day of the month for shorter months, as close to the original date as possible. For questions, please contact donate@wikimedia.org.     This page provides help with the most common questions about Wikipedia. You can also search Wikipedia's help pages using the search box below, or browse the Help menu or the Help directory. The Readers' FAQ and our about page contain the most commonly sought information about Wikipedia. For simple searches, there is a search box at the top of every page. Type what you are looking for in the box. Partial matches will appear in a dropdown list. Select any page in the list to go to that page. Or, select the magnifying glass \"Go\" button, or press ↵ Enter, to go to a full search result. For advanced searches, see Help:Searching. There are other ways to browse and explore Wikipedia articles; many can be found at Wikipedia:Contents. See our disclaimer for cautions about Wikipedia's limitations. For mobile access, press the mobile view link at the very bottom of every desktop view page. Contributing is easy: see how to edit a page. For a quick summary on participating, see contributing to Wikipedia, and for a friendly tutorial, see our introduction. For a listing of introductions and tutorials by topic, see getting started. The Simplified Manual of Style and Cheatsheet can remind you of basic wiki markup. Be bold in improving articles! When adding facts, please provide references so others may verify them. If you are affiliated with the article subject, please see our conflict of interest guideline. The simple guide to vandalism cleanup can help you undo malicious edits. If you're looking for places you can help out, the Task Center is the place to go, or check out what else is happening at the community portal. You can practice editing and experiment in a sandboxyour sandbox. If there is a problem with an article about yourself, a family member, a friend or a colleague, please read Biographies of living persons/Help. If you spot a problem with an article, you can fix it directly, by clicking on the \"Edit\" link at the top of that page. See the \"edit an article\" section of this page for more information. If you don't feel ready to fix the article yourself, post a message on the article's talk page. This will bring the matter to the attention of others who work on that article. There is a \"Talk\" link at the beginning of every article page. You can contact us. If it's an article about you or your organization, see Contact us – Subjects. Check Your first article to see if your topic is appropriate, then the Article wizard will walk you through creating the article. Once you have created an article, see Writing better articles for guidance on how to improve it and what to include (like reference citations). For contributing images, audio or video files, see the Introduction to uploading images. Then the Upload wizard will guide you through that process. Answers to common problems can be found at frequently asked questions. Or check out where to ask questions or make comments. New users should seek help at the Teahouse if they're having problems editing Wikipedia.   More complex questions can be posed at the Help desk. Volunteers will respond as soon as they're able. Or ask for help on your talk page and a volunteer will visit you there! You can get live help with editing in the help chatroom. For help with technical issues, ask at the Village pump. If searching Wikipedia has not answered your question (for example, questions like \"Which country has the world's largest fishing fleet?\"), try the Reference Desk. Volunteers there will attempt to answer your questions on any topic, or point you toward the information you need. Let SuggestBot point the way. SuggestBot is a program that attempts to help Wikipedia users find pages to edit.  It matches people with pages they might like to contribute to based on their past contributions.  It uses a variety of algorithms, including standard information retrieval and collaborative filtering techniques, to make suggestions.  It also sometimes points people to the Community Portal, or their past edits, as a source of inspiration. If you are looking for SuggestBot recommendations, you have these options.  Search Frequently Asked Questions Search the help desk archives  Wikipedia is made by people like you. Get startedPolicies and Guidelines EditingReferencingImagesTables EditingReferencingImagesTables Talk pagesNavigating WikipediaManual of StyleConclusion View all as single page For more training information, see also: Full help contents pageTraining for studentsA single-page guide to contributingA training adventure gameResources for new editors   This page provides a listing of current collaborations, tasks, and news about English Wikipedia. New to Wikipedia? See the contributing to Wikipedia page or our tutorial for everything you need to know to get started. For a listing of internal project pages of interest, see the department directory. For a listing of ongoing discussions and current requests, see the Dashboard. You can help improve the articles listed below! This list updates frequently, so check back here for more tasks to try. (See Wikipedia:Maintenance or the  Task Center for further information.) Help counter systemic bias by creating new articles on important women. Help improve popular pages, especially those of low quality. This week's article for improvement is: Offensive backfield Previous selections:Voting ·Food ·Manufacturing This week's backlog of the week is: Category:Pages using infobox settlement with unknown parameters  Welcome to the community bulletin board, which is a page used for announcements from WikiProjects and other groups. Included here are coordinated efforts, events, projects, and other general announcements. Yearly or infrequent events Monthly or continuous events  Also consider posting WikiProject, Task Force, and Collaboration news at The Signpost's WikiProject Report page. Please include your signature when adding a listing here. Latest tech news from the Wikimedia technical community. Please tell other users about these changes. Not all changes will affect you. Translations are available. Recent changes Changes later this week Future changes Tech news prepared by Tech News writers and posted by bot • Contribute • Translate • Get help • Give feedback • Subscribe or unsubscribe.  Discussions in the following areas have requested wider attention via Requests for comment:  When asking a question about editing Wikipedia at the Teahouse or Help desk, please include all the facts needed to answer your question - especially the page title you're enquiring about. Most respondents will assume you are editing in 'desktop' view, and are using Source Editor, not Visual Editor (VE). So remember to say if you're working on a mobile or using VE.   Always give context to any question. At the Reference desk, for example, don't ask \"who was president in 1900?\" without mentioning the country you're interested in! This prevents volunteers helpers having to ask follow-up questions before providing answers. Friendly reminder: the Teahouse (for new editors) and Help desk are for questions on how to use or edit Wikipedia; the Reference desk is for questions about anything else (real world questions).  This is a list of recent changes to Wikipedia. Thank you for offering to contribute an image or other media file for use on Wikipedia. This wizard will guide you through a questionnaire prompting you for the appropriate copyright and sourcing information for each file. Please ensure you understand copyright and the image use policy before proceeding.  Uploads to Wikimedia Commons  Upload a non-free file Uploads locally to Wikipedia; must comply with the non-free content criteria  You do not have JavaScript enabled Sorry, in order to use this uploading script, JavaScript must be enabled. You can still use the plain Special:Upload page to upload files to the English Wikipedia without JavaScript. You are not currently logged in. Sorry, in order to use this uploading script and to upload files, you need to be logged in with your named account. Please log in and then try again. Your account has not become confirmed yet. Sorry, in order to upload files on the English Wikipedia, you need to have a confirmed account. Normally, your account will become confirmed automatically once you have made 10 edits and four days have passed since you created it.      You may already be able to upload files on the Wikimedia Commons, but you can't do it on the English Wikipedia just yet. If the file you want to upload has a free license, please go to Commons and upload it there. Important note: if you don't want to wait until you are autoconfirmed, you may ask somebody else to upload a file for you at Wikipedia:Files for upload.  In very rare cases an administrator may make your account confirmed manually through a request at Wikipedia:Requests for permissions/Confirmed.  Sorry, a few special characters and character combinations cannot be used in the filename for technical reasons. This goes especially for # < > [ ] | : { } /  and ~~~. Your filename has been modified to avoid these. Please check if it is okay now. The filename you chose seems to be very short, or overly generic. Please don't use: A file of this name already exists on Commons! If you upload your file with this name, you will be masking the existing file and make it inaccessible. Your new file will be displayed everywhere the existing file was previously used. This should not be done, except in very rare exceptional cases. Please don't upload your file under this name, unless you seriously know what you are doing. Choose a different name for your new file instead.  A file of this name already exists. If you upload your file with this name, you will be overwriting the existing file. Your new file will be displayed everywhere the existing file was previously used. Please don't do this, unless you have a good reason to: It is very important that you read through the following options and questions, and provide all required information truthfully and carefully. Thank you for offering to upload a free work. Wikipedia loves free files. However, we would love it even more if you uploaded them on our sister project, the Wikimedia Commons.Files uploaded on Commons can be used immediately here on Wikipedia as well as on all its sister projects. Uploading files on Commons works just the same as here. Your Wikipedia account will automatically work on Commons too.   Please consider uploading your file on Commons. However, if you prefer to do it here instead, you may go ahead with this form. You can also first use this form to collect the information about your file and then send it to Commons from here. Please note that by \"entirely self-made\" we really mean just that.  Do not use this section for any of the following: Editors who falsely declare such items as their \"own work\" will be blocked from editing. Use this only if there is an explicit licensing statement in the source.  The website must explicitly say that the image is released under a license that allows free re-use for any purpose, e.g. the Creative Commons Attribution license. You must be able to point exactly to where it says this. If the source website doesn't say so explicitly, please do not upload the file. Public Domain means that nobody owns any copyrights on this work. It does not mean simply that it is freely viewable somewhere on the web or that it has been widely used by others.  This is not for images you simply found somewhere on the web. Most images on the web are under copyright and belong to somebody, even if you believe the owner won't care about that copyright. If it is in the public domain, you must be able to point to an actual law that makes it so. If you can't point to such a law but merely found this image somewhere, then please do not upload it.  Please remember that you will need to demonstrate that: This file will be used in the following article: Enter the name of exactly one Wikipedia article, without the [[...]] brackets and without the \"http://en.wikipedia.org/...\" URL code. It has to be an actual article, not a talkpage, template, user page, etc. If you plan to use the file in more than one article, please name only one of them here. Then, after uploading, open the image description page for editing and add your separate explanations for each additional article manually.  Example – article okay.  This article doesn't exist! The article Example could not be found. Please check the spelling, and make sure you enter the name of an existing article in which you will include this file. If this is an article you are only planning to write, please write it first and upload the file afterwards.  This is not an actual encyclopedia article! The page Example is not in the main article namespace. Non-free files can only be used in mainspace article pages, not on a user page, talk page, template, etc. Please upload this file only if it is going to be used in an actual article. If this page is an article draft in your user space, we're sorry, but we must ask you to wait until the page is ready and has been moved into mainspace, and only upload the file after that.  This is a disambiguation page! The page Example is not a real article, but a disambiguation page pointing to a number of other pages. Please check and enter the exact title of the actual target article you meant. If neither of these two statements applies, then please do not upload this image. This section is not for images used merely to illustrate an article about a person or thing, showing what that person or thing look like. In view of this, please explain how the use of this file will be minimal. Well, we're very sorry, but if you're not sure about this file's copyright status, or if it doesn't fit into any of the groups above, then: Please don't upload it. Really, please don't. Even if you think it would make for a great addition to an article. We really take these copyright rules very seriously on Wikipedia. Note that media is assumed to be fully-copyrighted unless shown otherwise; the burden is on the uploader. In particular, please don't upload: If you are in any doubt, please ask some experienced editors for advice before uploading. People will be happy to assist you at Wikipedia:Media copyright questions. Thank you. This is the data that will be submitted to upload:  Your file is being uploaded.  This might take a minute or two, depending on the size of the file and the speed of your internet connection. Once uploading is completed, you will find your new file at this link: File:Example.jpg Your file has been uploaded successfully and can now be found here: File:Example.jpg Please follow the link and check that the image description page has all the information you meant to include. If you want to change the description, just go to the image page, click the \"edit\" tab at the top of the page and edit just as you would edit any other page. Do not go through this upload form again, unless you want to replace the actual file with a new version. To insert this file into an article, you may want to use code similar to the following: If you wish to make a link to the file in text, without actually showing the image, for instance when discussing the image on a talk page, you can use the following (mark the \":\" after the initial brackets!): See Wikipedia:Picture tutorial for more detailed help on how to insert and position images in pages. Thank you for using the File Upload Wizard.Please leave your feedback, comments, bug reports or suggestions on the talk page.  An enzyme inhibitor is a molecule that binds to an enzyme's active site, or another site on the enzyme, and blocks the enzyme's catalysis of the reaction. Enzyme inhibitors are generally specific to one enzyme and control that enzyme's activity. They also control essential enzymes such as proteases or nucleases that, if left unchecked, may damage a cell. Many poisons produced by animals or plants are enzyme inhibitors, and many drug molecules are enzyme inhibitors that inhibit an aberrant human enzyme or an enzyme critical for the survival of a pathogen. Since anti-pathogen inhibitors generally target only one enzyme, such drugs are highly specific and generally produce few side effects in humans. Medicinal enzyme inhibitors often have low dissociation constants, meaning a minute amount of the inhibitor will inhibit the enzyme. The discovery of enzyme inhibitors and their refinement are researched in biochemistry and pharmacology. (Full article...) March 28 Amilcare Ponchielli (1834–1886) was an Italian composer. Born in Paderno Fasolaro (now Paderno Ponchielli) near Cremona, then Kingdom of Lombardy–Venetia, Ponchielli won a scholarship at the age of nine to study music at the Milan Conservatory, writing his first symphony by the time he was ten years old. He is best known for his operas, most notably La Gioconda, the third and most successful version of which debuted at La Scala in Milan on 28 March 1880. The Dance of the Hours from that opera is widely known thanks in part to its use in Walt Disney's Fantasia in 1940 and in Allan Sherman's novelty song \"Hello Muddah, Hello Fadduh\". In 1881, Ponchielli was appointed the maestro di cappella of Bergamo Cathedral and a professor of composition at the Milan Conservatory, where his pupils included Giacomo Puccini, Pietro Mascagni, Emilio Pizzi, and Giovanni Tebaldini. He was married to the soprano Teresina Brambilla and died at the age of 51 in Milan. This formal photographic portrait of Ponchielli was taken in Milan and is in the archives of the music publisher Casa Ricordi. Photograph credit: Icilio Calzolari; restored by Adam Cuerden Wikipedia is written by volunteer editors and hosted by the Wikimedia Foundation, a non-profit organization that also hosts a range of other volunteer projects: This Wikipedia is written in English. Many other Wikipedias are available; some of the largest are listed below. To protect the wiki against automated account creation, we kindly ask you to enter the words that appear below in the box (more info): edits articles recent contributors To protect the wiki against automated account creation, we kindly ask you to enter the words that appear below in the box (more info): edits articles recent contributors", "url": "https://en.wikipedia.org/w/index.php?title=Special:UserLogin&returnto=Cattle"}