{"title": "How to tip The Verge: secure email, Signal, SecureDrop, and more", "content": "Updated on Jul 15, 2019,  4:53 pm Note: this is only for editorial tips. For advertising, technical support, and other inquiries, go here. Some of our most important stories start with tips. We’re always looking for information about the companies and products that shape the way we live, insight into the government agencies responsible for public health and the environment, and other stories about the impact technology has on human beings. Evidence is key: firsthand experience or revealing documents will be more useful than a hunch. Have you encountered something that the public should know about? If so, we want to hear from you. Email is the easiest way to reach us. Send tips to the general Verge email here: tips@theverge.com Email addresses for specific reporters and editors are linked on this staff list. If you are at risk of reprisals, do not use your work email, Wi-Fi, or device. Some of our reporters use PGP, which encrypts the contents of emails, but does not disguise the sender or recipient. If you wish to use PGP, look for PGP keys in our staff bios, or contact us and we can direct you to a reporter who uses it. Information about downloading PGP is here: Mac / Windows. You can also send tips using the app Signal, which encrypts text messages and calls. Signal stores your number and the last time you accessed the app, but not whom you communicate with. Be sure not to use your work phone. You can download Signal here. You can tip The Verge via Signal here: +1-646-412-7005 Depending on what version of Signal you’re using, you may need to add The Verge’s number as a contact before beginning a conversation. The contact can be deleted once the conversation has begun. Postal mail is also a secure way of sending tips and documents. For anonymity, use a public mailbox, and don’t include a return address. Address:The VergeP.O. Box 690New York, NY 10272 SecureDrop is the most secure way to send documents to The Verge, although it requires some additional work. Accessible only through the Tor Browser, our SecureDrop instance can be reached by pasting http://ehsxsvhht7wvhew5.onion/ into the browser’s address bar. After submitting documents, you will be given a password that will allow you to check for responses at the same address. The Tor Network will disguise which site you’re visiting, and SecureDrop will not store any information that could identify you. Network operators may still be able to see that you have accessed the Tor Network, so you should avoid accessing SecureDrop from potentially hostile networks, such as your workplace’s. In accordance with best practices set by the Freedom of the Press Foundation, this page is being served over HTTPS without third-party analytics or ad trackers. Advertise with us Jobs @ Vox Media © 2019 Vox Media, Inc. All rights reserved.", "url": "https://www.theverge.com/a/tip-us-secure-contact-email", "threshold": 0.9545500063018411}