{"title": "Permissions & Licensing FAQ - Vox Media", "content": "Filed under: If you are looking to reprint, republish, or reuse our editorial content, we may require that you procure a license. The information below provides answers to some of the most frequent licensing requests we receive, guidelines for circumstances when you may not need to reach out to us directly for a license, and details about situations when we may be unable to respond to your requests. Please note: these guidelines are for editorial content only. For information on how we provide disclosures for Advertising Content, please review our Editorial Ethics & Guidelines.   There are several ways you can share our content that does not require a license or permission from us. For example:  Vox Media publishes an array of original work in audio, video, and written formats. We know that much of this material fits well into a classroom curriculum and may provide valuable insight for students. Consequently, we permit educational use of Vox Media editorial content under the guidelines below. These guidelines apply for nonprofit, noncommercial educational use only (e.g. a high school, college, or university). Please note: Commercial educational publishers (e.g. textbook publishers), events that require tickets, entrance fees, or are for the purpose of raising money or promoting a cause, or any commercial use, do not qualify for permitted use under these terms. Such use must submit a request for a license. To the extent your educational institution requires you to demonstrate that you have permission for your use, please show them this page.  We love that you love our content and want to share it with your communities. However, we do not grant individuals permission to translate and reprint, repost, or upload our content on personal YouTube channels, social media, blogs, websites, etc. Please note that any unauthorized translations and publications of our work will be treated as a violation of our intellectual property rights and be dealt with accordingly. From time to time, our content may be published on a platform that enables community translations through the services of that tool (e.g. YouTube’s community translations). You must comply with the guidelines for use of that translation tool at all times. We do not approve translations sent to us directly or respond to requests for such tools to be enabled.  Our editorial sites frequently review many products and services, but do not accept payments in exchange for reviews. If one of our editorial sites has reviewed your product and you are interested in using a quote from that review in any advertising or promotion, please follow the guidelines below. Note: if you are looking to use an award or badge in advertising, please see the section below for instructions. “With its clean lines, impressive screen, and excellent sound quality, this phone is certainly stunning but its lack of memory does not put it at the top of our list.” \t\tACCEPTABLE: “Clean lines, impressive screen, and excellent sound quality…” \t\tACCEPTABLE: “...this phone is certainly stunning…” \t\tNOT ACCEPTABLE: “...this phone is certainly stunning...at the top of our list” \t\tNOT ACCEPTABLE: “...at the top of our list”  Other than the guidelines presented above, we are unable to facilitate requests for use of quotes in advertising and promotion. To the extent your organization or client requires you to demonstrate that you have permission for use of our quotes, please show them this page.   Vox Media has partnered with Wright’s Media to license select awards and accolades from our editorial coverage in advertising and marketing. If your company has been awarded an accolade for any of the following franchises, please use the email addresses below to inquire about a license to use the franchise award logo or badge in your advertising, marketing materials, press releases, etc. Only the franchises listed below are considered official “awards” that can be licensed at this time.  The Strategist: thestrategist@wrightsmedia.com - The Strategist 100  - This Thing’s Incredible - Best in Class POPSUGAR: popsugar@wrightsmedia.com - POPSUGAR Beauty Awards - POPSUGAR Wellness Awards - POPSUGAR Fitness Awards - POPSUGAR Must Have - POPSUGAR Pick The Dodo: thedodo@wrightsmedia.com - Paw of Approval - The Dodo Pick - The Dodo Faves Thrillist: thrillist@wrightsmedia.com - The Fasties - Thrillist 50 Polygon: polygon@wrightsmedia.com - Polygon Recommends The Verge: theverge@wrightsmedia.com - Best In Show - Verge Recommends - Verge Reviewed We evaluate requests to license images, articles, podcasts, and videos on a case-by-case basis. If you are interested in re-using our editorial content and your proposed use is not covered in these guidelines, please fill out this form. Please note that such requests typically require a licensing fee and a signed license agreement.", "url": "https://www.voxmedia.com/pages/licensing", "threshold": 0.9999071901590064}