{"title": "The Verge Community Guidelines - The Verge", "content": "The Verge is all about exploring our dazzling, terrifying, exciting future together. We’re so glad you’re here and hope you’ll join our community of smart, talented, and enthusiastic people. We’ve created these community guidelines to help make sure that everyone feels welcome to participate on The Verge.  Whether participating in comments on our site, or out in the wild, like on YouTube, Facebook, or Instagram, we expect everyone in our community to follow these rules. First, let’s talk about what makes great comments. Be respectful. Being respectful in the commenting community is about more than just following the rules or being polite; it’s about trying to encourage good conversation by welcoming and including others. Think about how your words and actions might affect others. Better yet: think about how you can help make everyone want to jump in. Be curious. The Verge is about exploring our future together. Show up to the comments with the same spirit of curiosity we bring to writing posts for the site; it’s fun to learn, and we can help each other learn new and interesting things together. Remember that people come from all different places and backgrounds, so don’t assume you know what they think, feel, or mean. Be interesting. Another way of putting it: be relevant. Try to bring something new or unique to the conversation. This isn’t a race to be the first, the loudest, or the edgiest. We hope you’ll share cool stuff with the community, especially if that means sharing an insight that only you can provide. And remember to stay on topic; comments are not a free-for-all, and you’re more likely to write a great comment if it’s related to the topic at hand. Try to add value to each thread you participate in instead of just replying for the sake of it. Show your work. Approach commenting the same way The Verge approaches blogging. Making an argument? Back it up with something tangible that you can link to, whether it’s another news story, a scientific study, or a really good video explanation. Conversations and debates are usually richer and more interesting when people share the sources for their assumptions and conclusions.  Help us out. Our moderators work hard every day to help make sure The Verge is a place where everyone feels welcome. You can help us by reporting comments that violate the rules, like spam, personal attacks, or creepy comments. (See the full rules below for an exhaustive list of Bad Things.) Put simply: don’t be a jerk to other people on The Verge. And if you see someone doing rude stuff in the comments, let us know. We’re trying to foster great conversation and we will remove comments that hurt that goal. You’re free to say whatever you like at other places, but not here. At The Verge we have a different standard than the rest of the internet and we work hard to keep the conversation informative and fun. The bottom line is that the editors and moderators have the final say on whether comments fall within our community guidelines. We will remove anything we deem inappropriate, and these rules may evolve over time as needed. Doing any of the things listed here will result in your comment being removed, and serious violations will result in an instant ban. Above all, our team of moderators works to keep conversation here friendly, engaging, helpful, and productive. If we feel a comment or forum post is harming that endeavor, we’ll take action. Have any questions, or need to get in touch with a moderator? Talk to us here. The Verge is a vox media network © 2023 Vox Media, LLC. All Rights Reserved", "url": "https://www.theverge.com/community-guidelines", "threshold": 0.9976181851546513}