{"title": "This free TV comes with two screens - The Verge", "content": "By  Emma Roth, a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.  There’s a new type of TV coming for Samsung, LG, and Vizio, and it’s completely free if you don’t count the price of your attention — or data. Telly, a company created by Pluto TV co-founder Ilya Pozin, offers up a TV that makes up for its nonexistent price tag by showing constant advertisements in a second, smaller display. The company calls this thin strip of a screen a “Smart Display,” which is separated from the main TV by a soundbar. In addition to showing ads, it’s also capable of displaying a variety of widgets, including sports scores, a news ticker, the weather, and stock prices. Ads could pop up on the far right side of the Smart Display, as shown in the pictures embedded in this article, but might also appear in the form of a sponsored news feed on the left side of the screen. Janko Roettgers first reported on rumors of the device earlier this month. 1/4 1/4 “When I co-founded Pluto TV, we created an entirely new model that offered amazing TV content to viewers for free,” Pozin says in a statement. “Now, with Telly, we are providing the actual television for free as well.”   While ads shouldn’t interrupt whatever you’re watching on the main display, Telly’s chief strategy officer, Dallas Lawrence, tells The Verge that ads might utilize both displays when you’re not using the TV. “When the Theatre display (top screen) is not in use, the ad unit could come to life in a fun way connecting both,” Lawrence says. “There are literally hundreds of things we are thinking about to create the most engaging ad experience ever.” Lawrence also says that Telly is also working on “Telly Rewards” that will reward users with a gift card to services like Netflix or Starbucks for participating in things like on-screen polls. As for the main display, it’s a 55-inch 4K HDR panel linked to the secondary display through the company’s operating system: TellyOS. Unlike most mainline smart TV operating systems, TellyOS currently doesn’t support third-party streaming apps like Netflix. That’s why Telly comes bundled with a free 4K Android TV dongle that you can use to watch whatever streaming service you want. It’s also compatible with other streaming devices, including Roku, the Amazon Fire Stick, and Apple TV, and has three HDMI inputs, 2 USB inputs, and a tuner that you can use to watch over-the-air broadcasts. There’s more to the TV than just the two displays, though. If you look closely, you might notice a camera that’s planted smack-dab in the middle of the soundbar. That enables “free advanced motion-tracking fitness programs” that come with the TV, along with the Zoom integration that Telly’s launching with as well. Lawrence tells The Verge that the TV comes with a privacy shutter (and that the TV ships with it shut), so you can open and close it as you please.  Equipped with a camera and microphone and paid for by the brands that show you ads, having a Telly in your home has clear privacy implications that might go beyond the tracking used by Vizio, Roku, LG, Samsung, and other TV manufacturers. On its viewing and activity data policy, Telly says it “may collect information about the audio and video content you watch, the channels you view, and the duration of your viewing sessions,” along with information about “how you interact” with the TV. That includes your search queries, the buttons you select, as well as the “physical presence of you and any other individuals using the TV at any given time.” Oh, and if you choose to opt out of data collection, you’ll either have to return the TV or pay the presumed cost of the dual-screen TV plus soundbar setup yourself: You have the right to opt-out of sharing your Viewing and Activity Data, but unfortunately, that means you will no longer have access to the Services [and must return the television]. If you opt out and do not return the television to Telly, Telly will charge the credit card on file in the amount of $500.00. Telly is also shipping with 40 different games and the ability to play music from “popular music services.” It even has an “AI-driven voice assistant” that answers to “Hey Telly,” allowing you to set timers or snooze an alarm. If all that sounds a bit vague, that’s because it is. The company has yet to reveal the music services it's partnering with and didn’t expand much on the games or the AI assistant that the device will feature. Still, all points to Pozin’s massive goals for Telly. Pozin has made a bet on free TV in the past with the launch of Pluto TV, one of the most successful free ad-supported streaming TV services (FAST), and will likely apply this knowledge to free hardware as well.  “Don’t be fooled by the free price,” Pozin says in a statement. “This is by far the most advanced television ever developed.”  Would I take a free, ad-supported TV over the LG I have now? Absolutely not, but I’m genuinely intrigued with how this setup works. You can visit the freetelly.com website to reserve one of the 500,000 free devices that Telly says will start shipping “this summer.” Update, May 15th 8:38AM ET: Updated to add more information on Telly’s privacy policies.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2023 Vox Media, LLC. All Rights Reserved", "url": "https://www.theverge.com/2023/5/15/23721674/telly-free-tv-streaming-ilya-pozin-ads", "threshold": 0.7469917027593878}