{"title": "This is Vox Creative", "content": "A documentary that sheds light on the gender biases of the culinary industry as it follows the path of three determined women. Inspired by Jeffery Robinson’s eponymous presentation on the history of racism in America, this original podcast broke the Top 100 on iTunes. Explaining the connections between our names, their pronunciation, our identities, and our sense of belonging. We built a sustainable tiny home to help audiences discover a new way of living, and how the choices they make at home can impact the planet’s future. We scripted and produced a thrilling, horror-esque TV ad-spot reminding everyone not to drive after smoking marijuana. Women are having fewer orgasms than men. The Explainer Studio asked: why? A documentary from Epic Digital tells the story of an eclectic team of researchers taking AI into uncharted territory. 01 02 03 04 05 06 07 We are a creative collective within Vox Media that connects brands and audiences through the things that really matter to them. We leverage the technology, insights, measurement tools and influence of our editorial networks to connect brands to a community that’s 125MM strong. From the team that we build to the stories that we tell, it is our mission to influence audiences from a position of truth and purpose, and to build a more diverse, inclusive, and welcoming brand experience. Together with our partners, we shine a spotlight on the untold stories: the voices, ideas, and talents that reflect our audience’s dynamic world. We believe in empowering the personal identities of our people, including but not limited to race, gender, ability, sexuality, beliefs, culture, age, and body type. This is the promise of Vox Creative.   This is the promise of Vox Creative.  This is the promise of Vox Creative.    We’re great at a few particular things (and pretty good at all the rest). These disciplines represent our biggest investments - in talent, in tools, and in the belief that great brand work should change a mind, change a behavior, or change the world. Investigative journalism and premium entertainment for brands. Context in a world of bite-sized content by way Vox’s signature Explainer format. A focus on understanding and social activation. Integrating your brand and ours. © 2021 Vox Media, Inc.", "url": "https://www.voxmedia.com/vox-advertising", "threshold": 0.9972898929675766}