{"title": "TP-Link’s first Wi-Fi 7 routers, Deco BE85 and Archer BE800, are here - The Verge", "content": "By  Wes Davis If you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement. The Wi-Fi 7 spec isn’t totally finished yet, but you know TP-Link won’t let a pesky little thing like pending certification stop it, and why should it? Netgear and Asus aren’t. And so, the company is launching its first-ever Wi-Fi 7 routers — a mesh system called the Deco BE85, and a powerful single access point router that looks like a set piece designed for an old sci-fi show, the TP-Link Archer BE800. Wi-Fi 7 means you can probably expect a laptop or a phone with a good Wi-Fi 6E or Wi-Fi 7 network card to get over a gigabit throughput wirelessly, possibly way more, particularly if you have a connection to your ISP that’s capable of it, such as those offered in some places by the likes of Google Fiber, AT&T, or Comcast. TP-Link sent us some of its test data, along with the layout of the house it tested the mesh Deco BE85 system in, using a OnePlus 11 5G phone as the Wi-Fi 7 client, and if true, the numbers look enticing, showing the phone reaching well over 3,000Mbps throughput a few feet from the main router, only dropping to a little over 300Mbps at the farthest point. That’s incredibly fast and not something I’ve ever even been close to seeing, with most Wi-Fi 6E routers pushing up over 1,000Mbps at close range. I’d like to see how that bears out in real-world testing.  Despite the spec not being officially completed, these should be some impressive routers. Just looking at their hardware features, both get 10Gbps and 2.5Gbps ports, single USB 3.0 ports, and an SFP+ WAN/LAN port.  Why should you care about Wi-Fi 7? Wi-Fi 7, or 802.11be, is the newest wireless standard, replacing Wi-Fi 6E, which itself replaced 2019’s Wi-Fi 6 update. Like Wi-Fi 6E, the protocol can be used on all three bands: 2.4GHz, 5GHz, and 6Ghz, and brings with it WPA3 (and, eventually, WPA4) security. Unlike Wi-FI 6E, it comes with massive throughput-increasing features that should result in distinct improvements in the overall experience of Wi-Fi — or so we hope.  The biggest changes include wireless multi-link aggregation, which allows a client device with compatible network hardware inside to connect to two bands at once, increasing the amount of data it can transfer and the stability of its connection. With Wi-Fi 7, channel bandwidth is also doubled, going from 160MHz to 320MHz. With doubled bandwidth and other improvements, you should expect about twice the speed over the air, at least up close — farther away, as with all wireless transmission, the signal degrades (the laws of physics still apply, after all). Both of TP-Link’s new routers are technically capable of up to 19Gbps, which is consistent with speeds claimed by Qualcomm regarding its new Wi-Fi 7 chipsets that likely live in them. Naturally, that’s spread across all bands and individual data links, so you shouldn’t expect to see anywhere near that throughput. Both routers will support free and pro versions of TP-Link HomeShield, the company’s network security package. Looking closer, the Deco BE85 uses eight antennas per mesh node, and TP-Link says a three-pack should cover about 9,600 square feet. Of course, in the real world, with walls and furniture and sacks of sentient meat walking around, that may not quite line up. The company also says it will use AI to control roaming, shoving your devices around to the best node as you wander around your home. The best mesh systems already do this without AI and usually do a decent job of it, so we’ll see how and whether TP-Link has improved things there.  Each node has two 2.5Gbps ports and two 10Gbps ports, each of which can serve as WAN or LAN — meaning they’ll autoconfigure themselves depending on whether they’re connected to your modem or to the rest of your network. The Deco BE85 will also support wired backhaul, meaning you can run an ethernet cable between the devices so that each mesh node gets your full bandwidth to share with devices at every part of your house, rather than what it could otherwise pick up wirelessly — at least, that’s traditionally how it works. With multi-link aggregation for wireless backhaul, it’s likely to be faster than gigabit. So, if your house is already wired with older cabling and you don’t feel like running new ethernet drops, you might be better off going wireless with enough Deco BE85 nodes bopping around.  As for the chunky TP-Link Archer BE800 (which is named “beboo” in my headcanon), the company’s new single access point looks like a rejected Xbox design, with its pseudo-x-shaped outer shell and black front grate. It gets a dot matrix LED display, and TP-Link says it has over 3,000 graphics, showing you the weather, time, and for some reason, emoji. I don’t know who wants their router to emote at them, but it looks like y’all finally get that. TP-Link says it’ll also sport the ability to set up a separate network just for your smart home devices,  Mostly, its wireless capabilities look on par with the BE85 kit: it has the same number of bands, antennas, and potential throughput, and though TP-Link didn’t share the coverage area, I’d bet on somewhere around 2,500-3,000 square feet. The company also mentioned the ability to create a distinct network for your smart home devices, though it’s unclear if that goes for the BE85 mesh system as well. Despite its appearance, TP-Link isn’t calling this a gaming router — that distinction is reserved for the Archer GE800, which has been announced but not yet released.  The TP-Link BE85 is available now at Best Buy in a three-pack configuration, and it ain’t cheap, at $1,500. Same goes for the $600 TP-Link BE800, also at Best Buy. Both will also be available for preorder at Amazon. Should you run out and buy one of these routers today? For most people, of course not. The spec won’t be finalized until sometime later this year at the earliest, and as that time approaches, other companies will start announcing routers supporting the new standard. These are both pricey devices, and for at least the next year or two, you won’t see many products that can take advantage of anything Wi-Fi 7 brings to the table. Still, if you just like having the fancy new thing, they’ll be backward-compatible with everything you already own, so it’s not like they won’t work.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2023 Vox Media, LLC. All Rights Reserved", "url": "https://www.theverge.com/2023/5/15/23721525/tp-link-wi-fi-7-deco-be85-archer-be800", "threshold": 0.9994293988600484}