{"title": "Vox Media — The Modern Media Company", "content": "Our editorial networks ignite conversations and influence culture through journalism, storytelling and commentary on current events, lifestyle, entertainment, sports, dining, technology, and shopping. Across digital, podcasts, TV, streaming, live events, and print, we tell stories that affect our audience's daily lives and entertain as much as they inform. Vox Media has completed its acquisition of Group Nine, and begins a new chapter as the leader in modern media. Our portfolio features the most relevant and respected editorial properties across the biggest consumer categories, including: Vox, New York Magazine, The Verge, The Cut, Eater, Vulture, The Strategist, Polygon, SB Nation, Intelligencer, Curbed, Grub Street, Thrillist, Popsugar, The Dodo, NowThis, and Seeker. Off-platform, the Vox Media Podcast Network is one of the largest collections of popular podcasts spanning technology, news, pop culture, emerging trends, and more. Vox Media Studios is the award-winning nonfiction production and distribution studio for multiple TV and streaming partners. Powered by innovative technology that scales quality, we answer the always-changing needs of modern audiences, creators, and marketers. Our wit, passion, and sharp commentary make Vox Media a keystone of modern media. Throughout the wide universe of content on our networks, our goal is to create awareness that breeds obsessions — priming our audience to take action in real life. Whether the end result is subscribing to a podcast, clicking a link to find out more, filling an online shopping cart, or purchasing an event ticket, our storytelling inspires the audience to dive deeper than a headline. We've earned trusted relationships with our audiences by meeting them in the right context — with respect and intent. Our premium suite of advertising solutions builds upon this principle, improving audience experience and brand results Concert: The most powerful publisher-led advertising marketplace that delivers scale, quality, turnkey execution, and responsible data Content: Our full-service content and video production teams, Vox Creative and New York Stories, tap into our deep editorial expertise and, along with our non-fiction story hunters at Epic, tell powerful stories for brands Digital display: Turnkey and custom responsive, high-impact display units Vox Media Podcast Network: One of the largest collections of popular podcasts spanning technology, news, pop culture, futurism, women’s empowerment, and more Events: Tentpole and custom activations featuring unique sponsorship opportunities Data science: Advanced targeting capabilities and custom audience development Our portfolio of successful brands was built in tandem with a suite of sophisticated technology that answers the evolving needs of modern creators and marketers. With a foundation of Chorus, the unified publishing platform for modern media businesses, these revenue-driving and community-building tools enable not only Vox Media, but hundreds of businesses across our industry. Revenue-driving tools: Tap into Vox Media's premium advertising and the brand-safe Concert marketplace that delivers quality, scale, and responsible data Multi-platform publishing: Integrations that seamlessly reach audiences everywhere they are Collaborative storytelling for newsrooms: Dynamic, easy-to-use tools to write, edit, optimize, and manage stories — while preserving newsrooms’ work online Community engagement: Community and moderation tools that drive meaningful lift in safe, productive environments people reached each month on our platform(comScore) Social media followers Monthly video views Monthly podcast downloads Reached monthly on publisher-led Concert marketplace powered by Chorus and Clay publishing technology SOURCE: Site Visitors: Comscore MediaMetrix Multi-platform, December 2021; Podcasts: Megaphone Q4 2021; Video views and social followers: Tubular, February 2022. We are passionate about supporting sustainable editorial and business practices and leading the responsible direction of our industry. Find out how you can partner with us today. Contact Us. ©  Vox Media, LLC. All rights reserved.", "url": "https://www.voxmedia.com", "threshold": 0.999754390424078}