{"title": "90 destaques brasileiros abaixo dos 30 anos", "content": "Início / Listas / Under 30 2018: 90 destaques brasileiros abaixo dos 30 anos No total, foram selecionados 90 jovens de até 30 anos de idade A lista FORBES Under 30 deste ano reúne o que de melhor nossa equipe e nossos conselheiros analisaram na plataforma de inscrições e no mercado, nas mais diferentes categorias. Algumas dessas categorias são mais abrangentes do que seu nome sugere (como indústria, por exemplo), de modo a contemplar talentos difíceis de classificar – mas que não poderiam ficar de fora por sua relevância, influência, ousadia e talento. LEIA MAIS: Camila Cabello é destaque do novo 30 Under 30 Foram selecionados 90 jovens de até 30 anos de idade divididos em: Artes & Espetáculos/Entretenimento; Artes plásticas/Design/Estilo; Ciência/Educação; Direito/Política; Esportes; Finanças; Gastronomia; Indústria; Música; Tecnologia; Terceiro setor; Varejo/E-commerce; Web. Veja, na galeria de fotos abaixo, os 90 destaques brasileiros abaixo dos 30 anos:  ARTES & ESPETÁCULOS/ENTRETENIMENTO  Óscar Martins, 29 Depois de tentar carreira na política, no mercado de ações, no agronegócio e na área de comércio exterior, foi com uma festa que Óscar Martins, um dos principais nomes do setor de eventos atualmente do país, encontrou seu caminho. A trajetória do empresário do entretenimento começou com a organização do lançamento de uma cachaça produzida na fazenda de seu pai, em 2014. O evento previsto para 500 convidados ganhou forma, tomou proporções maiores e acabou se tornando a primeira edição da Óscar Party, com a presença de 4.200 pessoas no Goiânia Golf Club (GO). Sem nenhum tipo de investimento, a iniciativa foi inteiramente financiada pela venda antecipada de ingressos. “Quando a festa surgiu, a única coisa que eu já tinha organizado era aniversário. Mas eu precisava fazer dar certo. Peguei minha agenda de telefones e convidei todo mundo que eu conhecia. Depois, liguei para todos eles novamente e pedi os contatos dos seus amigos. Me ofereci para reservar hotel, buscar no aeroporto. O corpo a corpo fez toda a diferença”, lembra. A empreitada fez tanto sucesso que Óscar não parou mais. No mesmo ano, comandou um pré-Réveillon em Trancoso, na Bahia, e, no ano seguinte, fundou a Agência Óscar. “Eu estava com uma equipe muito boa. Não queria perdê-la. Então criei a agência e começamos a realizar eventos paralelos”, conta ele, que incluiu em seu portfólio a festa MÓL, a feijoada SEOROSA e a OSC Airport Party. Apesar dos inúmeros projetos realizados ao longo dos anos, a Óscar Party ainda é o principal produto. “Em Goiânia, os salões de beleza funcionam até de madrugada no dia da festa. A gente lota os principais hotéis e restaurantes. O clima muda. Você sente que existe algo diferente acontecendo na cidade.”  ARTES & ESPETÁCULOS/ENTRETENIMENTO  Leandro Faria, 29  Comandar a operação do game mais jogado do mundo, com 100 milhões de usuários por mês, não é simples. Mas esse é o desafio de Leandro Faria, diretor de produto da Riot Games, empresa responsável pelo League of Legends  (LoL) no Brasil.  Apesar da pouca idade, o jovem executivo já tem mais de uma década de experiência em internet e tecnologia, obtida em empresas como Fiat Chrysler, Localiza Hertz e Stefanini.  Há quase três anos no setor de entretenimento, comandou, em 2017, a execução do Mid-Season Invitational no Brasil, evento mundial de LoL, assistido por mais de 360 milhões de pessoas. “Sou apaixonado por jogos e amo o que faço.” Apesar de o setor de jogos eletrônicos crescer a largos passos, o mercado ainda é incerto e, para Leandro, a missão é torná-lo uma modalidade respeitável. “O que existe hoje pode não existir amanhã. É preciso coragem para olhar para um caminho turvo e volátil.”  ARTES & ESPETÁCULOS/ENTRETENIMENTO  Vinicius Delatorre, 29 Foi durante uma confraternização, realizada em um jogo de Airsoft – modalidade na qual os participantes simulam operações policiais ou militares, com armas de pressão e projéteis plásticos –, que o empresário Vinicius Delatorre identificou um mercado potencial.  A ideia levou à fundação da Sniper, uma das maiores redes de franquias de entretenimento para shoppings do país. O desafio do modelo de negócios era transformar o gênero de jogo em diversão familiar, levando-o para locais de grande fluxo de pessoas. Sem investimento, Vinicius diz que começou fazendo muitas dívidas. “Mas sempre acreditei que era possível. Conseguir executar um projeto sem ter capital é um desafio.”  Há menos de dois anos no mercado, a Sniper conta com 35 unidades em 22 estados e faturamento milionário. Fechou 2018 com R$ 28 milhões, quatro vezes mais do que no ano passado. Em 2019, a meta é expandir internacionalmente.  ARTES & ESPETÁCULOS/ENTRETENIMENTO  Malu Rodrigues, 25 A carioca estreou nos musicais ainda adolescente. Fez “A noviça rebelde” (2008); “O Despertar da Primavera” (2009/2010); e “O Mágico de Oz” (2012).  Em 2018, em uma espécie de retorno às origens, voltou ao clássico norte-americano dos anos 1960, mas, desta vez, não mais como uma das filhas do capitão Georg von Trapp, mas sim como a protagonista Maria.  Na TV, passou por “Tapas e beijos” e “O outro lado do paraíso”, ambas na TV Globo. Também tem no currículo cinco filmes na telona. O mais recente é “Minha fama de mau”, sobre Erasmo Carlos, no qual vive Wanderléa.  ARTES & ESPETÁCULOS/ENTRETENIMENTO  Raphael Montes, 28 O escritor carioca, formado em direito, lançou seu primeiro romance, “Suicidas”, em 2012, obra finalista dos prêmios Benvirá e Machado de Assis. Seu segundo livro é “Dias Perfeitos”. Ambos foram vendidos para adaptação no cinema.  Raphael ainda lançou “O Vilarejo” e “Jantar Secreto”. Suas obras foram traduzidas em mais de 20 países. O escritor também participou de alguns roteiros, como o do filme “Praça Paris”. É colunista de “O Globo”.  ARTES & ESPETÁCULOS/ENTRETENIMENTO  João Pedro Zappa, 30 Ele chamou a atenção do grande público ao contracenar com Deborah Secco no longa “Boa Sorte”, de Carolina Jabor, em 2014. Dois anos mais tarde, foi à África para as filmagens da premiada obra franco-brasileira “Gabriel e a Montanha”, na qual atuou como ator e produtor associado.  Em 2017, participou da novela “Os Dias Eram Assim”, na Globo. Ao longo de 2018, interpretou o pai da aviação na minissérie “Santos Dumont”, da HBO, ainda sem data de estreia definida.  ARTES & ESPETÁCULOS/ENTRETENIMENTO  Vitória Strada, 22 Aos 22 anos, a atriz e modelo gaúcha protagoniza sua segunda novela em menos de um ano. Em “Espelho da Vida”, o diretor Pedro Vasconcellos, ao saber da gravidez da atriz Isis Valverde, telefonou para ela para que assumisse o papel de protagonista, fazendo par romântico com o ator João Vicente de Castro. Vitória já chegou à TV Globo fazendo outra protagonista, Maria Vitória, na novela de época “Tempo de Amar”, em que contracenou com o ator Bruno Cabrerizo. Seu desempenho foi muito elogiado. Na televisão, a atriz estreou como Taila, na série sobre o mundo sobrenatural “Werner e os Mortos”, veiculada pelo Canal Brasil. Vitória não esconde sua paixão pela dança. Na infância, fez balé e ginástica rítmica. Aos 12 anos, a atriz começou a trabalhar como modelo e enquanto fazia o Ensino Médio surgiu a oportunidade de entrar para o cinema. Ela enfrentou 350 candidatas para viver Maria em seu primeiro longa-metragem, “Real Beleza”, do cineasta conterrâneo Jorge Furtado, um dos mais respeitados no país. No filme, contracenou com Francisco Cuoco, Vladmir Brichta e Adriana Esteves. A atriz fez ainda uma participação em “O filme da minha vida”, do diretor e ator Selton Mello. Vitória se diz muito apegada à família. Quando se mudou de vez para o Rio de Janeiro, por conta das constantes gravações, seus pais vieram para lhe dar um suporte. A atriz já declarou que da mesma forma que uma mãe é apegada a um filho, ela “‘faria qualquer loucura” por seus pais.  ARTES & ESPETÁCULOS/ENTRETENIMENTO  Marco Pigossi, 29 Em busca de novos desafios, o ator paulista deixou a TV Globo – emissora onde participou de minisséries e novelas como “A Força do Querer” (2017) e “Onde Nascem os Fortes” (2018) – em direção à plataforma de streaming Netflix.  Por lá, estreou em dose dupla. Fez “Tidelands”, série de televisão australiana, lançada em dezembro, na qual contracena, em inglês, com a atriz espanhola Elsa Pataky. E foi confirmado como protagonista de “Cidades Invisíveis”, produção brasileira, criada e dirigida por Carlos Saldanha (das animações “A Era do Gelo” e “Rio”), que começará a ser rodada em breve.  “Foi um convite irrecusável”, disse ele na época da mudança de ares, em abril de 2018, depois de viver uma série de mocinhos na televisão aberta, explicando que estava pronto para vivenciar experiências diversificadas na carreira.  ARTES & ESPETÁCULOS/ENTRETENIMENTO  Mateus Ribeiro, 25 O ano de 2018 foi agitado para o jovem catarinense criado no Nordeste do país. Mal terminou de interpretar o protagonista de “Peter Pan, o Musical da Broadway” – pelo qual ganhou o Prêmio Reverência de melhor ator de musical –, Mateus engatou a missão de dar vida ao personagem Lipe na turnê nacional de “Vamp”, adaptação da novela de mesmo nome que fez sucesso nos anos 1990 na Globo.  Os musicais, aliás, não são novidade para ele que, aos 17 anos, fez parte do elenco de “Cabaret”, ao lado de Claudia Raia. Depois dele, foi um atrás do outro: “O Mágico de Oz” (2012), “Crazy for You” (2013), “Chacrinha – O Musical” (2013), “Mulheres à Beira de um Ataque de Nervos” (2015), “Meu Amigo Charlie Brown” (2016), “60! Doc Musical” (2017) e “2 Filhos de Francisco” (2017). Em 2019, deverá ser o protagonista do musical “Bob Esponja”.  ARTES & ESPETÁCULOS/ENTRETENIMENTO  Felipe Didonih, 25 Ele é muito mais do que um rostinho bonito. Eleito Colírio Capricho ainda bem jovem, foi cantor, teve boyband (On Play), mudou de nome (o sobrenome anterior, Nardoni, também não era de batismo) e, atualmente, é um requisitado diretor de clipes dos influenciadores digitais.  Felipe escreveu e dirigiu, entre outros trabalhos, a websérie “A Espera”, que foi ao ar no canal da youtuber “Viihtube” e, em 11 episódios, já contabiliza mais de 50 milhões de views.  ARTES & ESPETÁCULOS/ENTRETENIMENTO  Letícia Colin, 28 A personagem Rosa da novela global “Segundo Sol” roubou a cena, mas há tempos o talento de Letícia chama atenção. Foi no programa “Sandy e Junior”, aos 10 anos, que estreou na TV. Em 2006, fez a novela da Band “Floribella” e, em razão de sua atuação, foi contratada pela Record para “Luz do Sol”. Lá, fez várias novelas, entre elas “Chamas da Vida”, com enredo polêmico sobre estupro.Em 2013, retornou à Globo, onde está até hoje. Letícia fez nove filmes. O último foi “Entre Irmãs”, de Breno Silveira.  ARTES & ESPETÁCULOS/ENTRETENIMENTO  Geovana Peres, 30 A bailarina paulistana passou a integrar neste ano o time seleto de profissionais da Cia. Thuringer Staatsballett, da cidade de Gera, na Alemanha.  Formada pela Escola Bolshoi no Brasil, única filial do Teatro Bolshoi de Moscou no mundo, Geovana fez em fevereiro de 2018 algumas audições na Europa e foi aprovada pela companhia alemã.  Do clássico ao contemporâneo, Geovana interpretou vários espetáculos, com destaque para a “Valsa Moszkowsky” e “Linha Vermelha”.  ARTES PLÁSTICAS/DESIGN/ESTILO Aisha Mbikila, 21 Filha de pai angolano e mãe brasileira, a modelo e DJ brasiliense Aisha Mbikila Garcia Fikula tem em seu nome o seu jeito de ser. No idioma africano swahili, Aisha significa vida. Divertida e esfuziante, a modelo se tornou a única brasileira a integrar a nova campanha da Nike.  A família carioca se mudou para Brasília em 1959 – o avô era o único negro integrante da equipe de planejamento do arquiteto Oscar Niemeyer. Os pais se separaram e Aisha foi criada pela mãe e pela avó. “Cresci numa família matriarcal. Minha avó, Lídia Garcia, era militante do movimento negro e arte educadora. Tinha um ateliê de moda étnica e foi nesse ambiente que me iniciei na moda”, conta ela. A mãe, professora concursada, foi uma das primeiras professoras negras de Brasília.  As duas referências fortes femininas tornaram Aisha uma menina independente, apaixonada por música e dança e com vontades próprias. Aos 12 anos começou a pesquisar danças africanas e dois anos depois, com um grupo de amigas, montou a companhia de dança Ashantis Negras, em homenagem à etnia de Gana, na África. Em Brasília, Aisha se apresentava com o grupo em diferentes palcos. Foi também na capital do país que ela começou a trabalhar como modelo, sem nunca deixar a dança e os esportes, como ginástica rítmica.  Aos 17 anos, decidiu mudar-se para São Paulo, onde via mais chances de engrenar sua carreira de modelo. Não deu outra. Além de campanhas de marcas famosas, Aisha ainda recentemente embarcou para a Patagônia para fazer um especial para o canal National Geographic. Com intenção de ingressar no cinema, ela ainda cursa teatro na SP Escola de Teatro. Seu sonho? “Quero desconstruir todos os padrões impostos às mulheres negras.”   ARTES PLÁSTICAS/DESIGN/ESTILO  Julia Alcântara de Souza, 28 A história do Grupo Orna, fundado por Julia, a caçula de três irmãs, começou com o blog Tudo Orna, em 2010, época em que cursava a Universidade Tecnológica Federal do Paraná. Durante quatro anos, ela e suas irmãs, Débora e Bárbara, dedicaram-se ao blog.  Em 2014, Julia foi estudar fashion design no Savannah College of Art in Design, na Geórgia (EUA), e aí surgiu a ideia de montar a empresa Orna para vender acessórios online. Foi um sucesso. “Queríamos oferecer um produto de qualidade”, diz ela.  Deu tão certo que, em 2016, elas lançaram uma linha de maquiagem, a Orna Make. “Superou todas as nossas expectativas.” Depois vieram os cursos presenciais “Profissão Blogger” e “Digital Business” e, em 2017, o curso online “Efeito Orna”, com temas como empreendedorismo digital.  Em 2018, o cunhado de Julia inaugurou o Café Orna, em Curitiba. Agora a meta da empresária, que mora nos EUA, é internacionalizar o grupo.  ARTES PLÁSTICAS/DESIGN/ESTILO  Luís Maluf, 29 Luís entrou no mundo das artes aos 17 anos, quando trabalhou de aprendiz em uma galeria. Aos 25 anos inaugurou seu próprio espaço, a Luis Maluf Art Gallery, no Jardim Paulista (SP).  Com um olhar clínico para descobrir novos talentos e apostar neles, Maluf começou a trabalhar com o artista Cranio (o dos conhecidos índios de cor azul) há cerca de nove anos, quando comercializava suas obras por R$ 1.500 – e que hoje chegam a valer R$ 52 mil. “A maior parte dos meus clientes na galeria são bem jovens, muitos filhos de colecionadores ou pessoas que já dão, bem cedo, um valor para a arte. O mundo está mudando, e eu tento focar nesse público e fazer disso o meu negócio, porque sei que serão os meus melhores clientes a longo prazo”, conta Luís. Um dos sonhos atuais é mirar no mercado internacional e ter, daqui a 20 anos, uma galeria estabelecida em Nova York.  ARTES PLÁSTICAS/DESIGN/ESTILO  Giovani Caramello, 28 Giovani teve contato com o universo das artes bem cedo, por meio de sua mãe, formada em artes plásticas. Trabalhou com modelagem 3D e esculturas mais comerciais até, aos 23 anos, seguir a linha hiper-realista.  Cada escultura sua de grande proporção leva entre um e dois meses para ficar pronta, e é vendida por cerca de R$ 30 mil.  No momento é representado pela OMA Galeria e está em conversas avançadas com a Plus One Gallery, de Londres.  ARTES PLÁSTICAS/DESIGN/ESTILO  Mauricio Noronha e Rodrigo Brenner, 28 e 27 A dupla de designers curitibanos fundou o Furf Design Studio em 2011 e mistura, com excelência, design com apelo social.  Os dois foram contratados pelo CEO da empresa Etnos, Fernando Antônio Costa Jr., para desenvolver a capa para prótese batizada de Confete, premiada pelo iF Design Award no ano de 2018.  O aparato é funcional, bonito, colorido e tem valor acessível (cerca de 80% mais barato que similares), além de ter um apelo emocional e colaborar com a reabilitação e autoestima do amputado.  ARTES PLÁSTICAS/DESIGN/ESTILO  Hick Duarte, 27  Moda e cultura jovem são temas caros ao fotógrafo e diretor mineiro Hick Duarte, que imprime em seu trabalho um olhar contemporâneo.  Com dez anos de estrada, atraiu a atenção de marcas como Adidas e já expôs em Nova York.  Hick foi o único brasileiro a fazer parte da lista deste ano dos 100 novos talentos do Fashion Awards, um dos prêmios de maior prestígio da moda, organizado pelo British Fashion Council.  CIÊNCIA E EDUCAÇÃO  Gabriel Liguori, 29 Gabriel nasceu com uma cardiopatia congênita chamada atresia pulmonar, que fazia com que desde bebê seu coração não conseguisse bombear corretamente. Aos 2 anos, entrou pela primeira vez no Instituto do Coração (Incor), ligado à USP, para ser operado. Devido à incapacitação respiratória, causada pela baixa oxigenação, não conseguia praticar esportes como outras crianças. Chegou a fazer natação, mas não seguiu em frente.  As frequentes idas ao hospital fizeram com que se apaixonasse pela medicina e se tornasse, aos 29 anos, o médico criador de um gel, feito com as células do paciente, que poderá levar à criação de um coração artificial numa técnica de impressão 3D de tecidos humanos. “Desde sempre frequentei o ambiente hospitalar e dizia que seria médico para ajudar outras crianças com problemas de formação congênita”, conta. Já no primeiro ano de faculdade, na USP, ele se debruçou sobre estudos do coração. Sob a orientação da professora Vera Aiello, ele relata que realizou projetos de anatomia e começou a participar de congressos ao redor do mundo. Na Universidade de Harvard, fez o curso “Principles and Practice of Clinical Research” e ainda estagiou no Children’s Hospital de Boston. Na Inglaterra, esteve nos laboratórios do Royal Bromptom Hospital, onde analisou cardiopatias congênitas.  Seus estudos foram publicados na respeitada publicação Journal Heart. Gabriel também esteve em Maastricht, na Holanda, como intercambiado da International Federation of Medical Students Associations. Na formatura, recebeu o Prêmio Prof. Dr. Edmundo Vasconcelos de distinção em Cirurgia e um ano depois foi contemplado com uma bolsa da Fundação Estudar, do empresário Jorge Paulo Lemann.  CIÊNCIA E EDUCAÇÃO  Fernanda Maria Policarpo Tonelli, 29 O que começou como brincadeira com o jogo Alquimia, com tubos de ensaio e reagentes, se transformou a profissão de Fernanda. “Desde criança era apaixonada pela molécula de DNA e a indescritível sensação experimentada ao investigar os mais diferentes fenômenos químicos e biológicos”.Com o apoio dos pais e da irmã, ela se dedicou a estudar bioquímica. Após a graduação, fez mestrado e doutorado na UFMG na mesma área e desde então trabalha com pesquisa que vai de fitoquímica a nanobiotecnologia e biologia molecular.  Em 2017, ela ganhou o prêmio Para Mulheres na Ciência (L’Óreal/UNESCO/ABC). “Acredito no potencial transformador da ciência na vida dos indivíduos e por esta razão também me dediquei a atividades de extensão e combate à desigualdade de gêneros no meio científico”, diz. Para ela, ser pesquisadora é uma realização.  CIÊNCIA E EDUCAÇÃO  Matheus Goyas, 29 Filho de professora, o belo-horizontino, sempre gostou do universo da educação. Estudou direito (UFMG) e administração pública (Fundação João Pinheiro), mas abandonou ambos os cursos para empreender.  Em 2012, fundou o AppProva com seus amigos do Colégio Santo Antônio, instituição a qual atribui grande parte de suas conquistas. “O AppProva teve uma trajetória impressionante num curto período de tempo: ganhou o StartUp Brasil, foi acelerado pela Fundação Lemann, recebeu investimento de VC da Ebricks Ventures e foi investido pelo Google Lanchpad Acelerator program do Google”, diz ele.  Em 2017, o aplicativo foi adquirido pela Somos Educação, onde Matheus é executivo hoje. Ao longo dos últimos anos recebeu diversos reconhecimentos: Jovem Inspirador (Veja e Fundação Estudar 2013), Empreendedor do ano (MIT Technology Review 2018) e MIT 35 under 35 (MIT Technology Review).  CIÊNCIA E EDUCAÇÃO  Luisa Hamra, 19 Natural de Catanduvas (SP), Luisa Hamra, presenciou em 2015 o maior surto de dengue de sua cidade. Diante da situação, ela decidiu estudar a morfologia e comportamento do mosquito Aedes aegypti.  Com seus conhecimentos em química adquiridos em sala de aula, Luisa desenvolveu em 2016, no banheiro de sua casa, um gel adesivo de baixo custo capaz de afastar o mosquito e matar as larvas do inseto. A iniciativa lhe rendeu uma premiação em Harvard. CIÊNCIA/EDUCAÇÃO Hector Gusmão, 29 O CEO da Fábrica de Startups do Brasil já era empreendedor aos 6 anos, ao produzir e vender esculturas. Aos 18, tornou-se gerente da academia da mãe. Formado em administração pela PUC (RJ), entrou na MPX Energia em 2011. Nessa época, criou com o primo Bruno Castello, que se tornaria seu sócio, a Triplin, para compra de viagens.  A startup estourou e os dois foram ao Vale do Silício. Em 2015, entraram na aceleradora portuguesa, trazendo-a ao Brasil em 2017. “Serão aceleradas 130 startups por ano, com faturamento de R$ 50 milhões”, diz.  CIÊNCIA E EDUCAÇÃO  Anderson da Silva Pereira, 29 Anderson chegou ao Grupo Santander em 2016. Por sua ligação à educação, um ano depois se tornou o mais jovem CEO do banco ao assumir a Universia Brasil, empresa de educação e empregabilidade que recruta 3.500 estagiários por ano pelo portal de empregos.  Ele é hoje o organizador do projeto Capacita-me e realiza um dos maiores encontros de educação superior do mundo, que, só no último ano, reuniu 150 reitores brasileiros em Salamanca, na Espanha. Anderson é ainda diretor do comitê Acelera da Fiesp. DIREITO/POLÍTICA Kim Kataguiri, 22 Foi um debate em sala de aula sobre o Bolsa Família que criou Kim Kataguiri como o conhecemos hoje. Quando fazia o ensino médio técnico em desenvolvimento de sistemas, o neto de imigrantes japoneses interessou-se pelo programa que, segundo o professor, havia ajudado a tirar o Brasil da pobreza. “Fui estudar melhor, pesquisei muito e vi que o Brasil estava bem, mas caminhava muito mais devagar que a China, por exemplo, e a política fazia crescer mais a classe média do que os pobres”, conta. Para discordar do professor, ele fez um vídeo no YouTube, que viralizou. “Começaram a me pedir para falar sobre outros temas.” Os vídeos, em que ele bradava contra a esquerda e a favor do liberalismo e da economia de mercado, o catapultaram à fama.  O Movimento Brasil Livre, o MBL, do qual é um dos cocriadores, nasceu a partir daí, na esteira das manifestações pelo impeachment da ex-presidente Dilma Rousseff, em 2014. Kim e seu MBL foram ganhando cada vez mais projeção – em 2015, a revista americana Time incluiu o rapaz na lista dos 30 jovens mais influentes do mundo.  E ele acredita que entrar para a política foi um caminho natural. “Organizamos um movimento que foi bem-sucedido em seu propósito de derrubar um governo. Minha ‘penalidade’ era oferecer uma alternativa”, diz sobre a candidatura em 2018 a deputado federal. Os 465.310 votos recebidos supreenderam inclusive a ele. “Pensava que uns 200 mil votos já seria um cenário bem positivo”, afirma Kim, que conta estar se acostumando à ideia de ir a Brasília toda semana, enquanto tenta formar-se em Direito. “Quero depois fazer mestrado e doutorado e dar aulas, e ao mesmo tempo continuar parlamentar”, responde, quando perguntado aonde quer chegar. “E o MBL tem que chegar à presidência da República.”  DIREITO/POLÍTICA  Marina Amaral Cançado, 29 Acreditando que o serviço público pode trabalhar de forma inovadora, há oito anos Marina ajudou a fundar o Tellus, organização pioneira em inovação e design de serviços para o governo.  Graduada em administração pela FGV, com pós na Universidade de Georgetown, nos EUA, em 2014 abriu a Flow Brasil, consultoria que aplica insights da ciência comportamental para melhorar a eficiência de políticas públicas e programas sociais.  A incansável Marina ainda lidera a Agenda Brasil do Futuro, associação formada por jovens de famílias empresárias que realizam e financiam projetos estratégicos. “Para mim, muito cedo ficou claro que, para o Brasil avançar, de modo a proporcionar condições melhores para as pessoas, era necessário reconceber o Estado brasileiro, aproximar a sociedade da política e reorganizar a filantropia, de modo a ser mais estratégica e estruturante”, diz ela.  DIREITO/POLÍTICA  Fernando Holiday, 22 Fernando Silva Bispo, que adotou a alcunha Holiday em homenagem à cantora Billie Holiday, não teme polêmicas. Negro, é contra cotas raciais e debates de apropriação cultural. Pobre, recusa o discurso vitimista. Mais jovem vereador eleito da história de São Paulo, Fernando interessou-se por política por causa de discussões em sala de aula da escola pública de Carapicuíba em que estudou.  “Em 2015, na esteira das primeiras manifestações do MBL [Movimento Brasil Livre], identifiquei um movimento político alinhado ao que eu já acreditava”, conta. “Desde então fui militando, me envolvendo, até que a candidatura se tornou algo natural.” O coordenador do MBL tem um sonho: virar professor. “Na política penso apenas, por ora, em fazer um bom trabalho e honrar os votos em mim confiados. Não acredito que a reeleição seja o único caminho possível, considero ainda a possibilidade de retornar à militância do movimento e dar um maior foco à minha formação acadêmica. Tudo isso dependerá do cenário político de 2020.”  DIREITO/POLÍTICA  Daniel José, 30 Caçula de 11 irmãos, Daniel conseguiu, com bolsas, formar-se economista e fazer mestrado em Yale. Trocou o mercado financeiro por um trabalho com refugiados de guerra na Jordânia. Foi quando pensou em política pela primeira vez.  Sua importância ficou mais clara quando começou a trabalhar com consultoria em educação pública. Para solucionar o problema de falta de lideranças políticas, cocriou o movimento RenovaBR. Este ano, aos 30, recebeu a sexta maior votação a deputado estadual de SP. “Minha prioridade é a educação pública. Temos que tirar a política da Idade Média.”  DIREITO/POLÍTICA  Tabata Amaral, 24 Educação também é a bandeira de Tabata, a sexta deputada federal mais votada em SP em 2018.  Garota da periferia, filha de uma diarista e de um cobrador de ônibus, depois de colecionar medalhas em olimpíadas de matemática, conseguiu bolsas de estudo, primeiro no ensino médio e depois da Fundação Estudar para Harvard.  Lá, formou-se em astrofísica e em ciências políticas. Resolveu voltar para o Brasil para trabalhar com educação. Fundou uma ONG e entrou para o Acredito, movimento para formar novas lideranças políticas.  DIREITO/POLÍTICA  Felipe Neves, 29 O advogado (e no momento mestrando de Stanford) é fundador do Projeto Constituição na Escola, ONG que promove aulas e palestras sobre a Constituição em cerca de 130 escolas públicas de SP, BA e RJ.  O corpo docente de 100 advogados voluntários proporciona aulas a 35 mil alunos por semestre.  Neves foi escolhido como um dos 11 jovens líderes brasileiros pela Fundação Obama, e se encontrou pessoalmente com o ex-presidente durante sua passagem pelo Brasil.  ESPORTE  Dudu, 26 Foi um grande ano para Dudu. Eleito o craque do Campeonato Brasileiro e vencedor da tradicional Bola de Prata (criada em 1970 pela revista Placar e desde 2016 organizada pela ESPN), o atacante foi um dos grandes destaques do Palmeiras na conquista do decacampeonato. Nascido em Goiânia, Eduardo Pereira Rodrigues começou sua carreira no Cruzeiro em 2009, com atuação tímida. Emprestado para o Coritiba, ganhou o primeiro título de expressão com a Série B de 2010. De volta ao Mineiro, foi campeão estadual e partiu para a Ucrânia para jogar no Dínamo de Kiev (em uma transação de 5 milhões de euros), onde ficou de 2011 ao começo de 2014, quando voltou para atuar no Grêmio. Depois de uma boa temporada no time gaúcho, o goiano foi disputado pelos três grandes de São Paulo, e acabou no alviverde. A escolha não poderia ser mais acertada. Com o Palmeiras, ganhou a Copa do Brasil em 2015 e seu primeiro Campeonato Brasileiro em 2016, com direito ao prêmio de craque da edição, dobradinha que se repetiu em 2018. Além disso, entrou para a seleção da Conmebol da Libertadores de 2018. Em quase quatro anos de clube, o atacante fez 55 gols em 228 jogos. Não à toa, Dudu é um dos ídolos da torcida palmeirense: a camisa 7 é líder no ranking de vendas do clube desde 2016. Com contrato assinado até 2020, ele chegou a recusar uma proposta milionária para ir ao Changchun Yatai, da China. Na seleção brasileira, o jovem jogador já teve algumas chances com o técnico Tite, sem muito destaque. Ele, claro, sonha com mais uma escalação oficial. Com tanta atenção sobre o atleta, é bom o time paulistano preparar o bolso se quiser segurá-lo: boas propostas para levá-lo embora não faltarão.  ESPORTE  Breno Correia, 19 Breno Martins Correia é o mais jovem nadador da equipe masculina de revezamento 4x200m, que ganhou medalha de ouro para o Brasil no Campeonato Mundial de piscina curta, disputado no dia 14 de dezembro, na China.  Ele cravou a melhor parcial de todos nesta prova, com 1m40s98. Os outros membros da equipe são Luiz Altamir, Fernando Scheffer e Leonardo Santos.  Breno também levou a medalha de bronze no 4x100m livre no Mundial. “Nosso time mescla atletas veteranos com os mais novos. Isso é muito importante e reflete nesse resultado”, disse ele.  O nadador baiano é apaixonado pelo esporte desde pequeno. No Clube Pinheiros, em São Paulo, onde está até hoje, foi treinado por Alberto Silva. Em 2018, no Ranking Brasileiro Absoluto, Breno venceu a prova com o melhor índice técnico da competição. Foi também o brasileiro mais medalhado nos Jogos Odesur. ESPORTE Letícia Bufoni, 25 Quem acha que o Brasil não tem mais atletas na posição máxima do esporte mundial está se esquecendo de Letícia Bufoni.  A paulistana moradora de Los Angeles, na Califórnia, desde os 13 anos, é considerada hoje o principal nome do skate feminino no mundo.Skatista desde os 9 anos, ela é dona de sete medalhas do X Games (três delas de ouro, conquistadas em 2013 em Barcelona, Los Angeles e Foz do Iguaçu), além ser a primeira mulher a ganhar o Super Crown da Street League, um dos mais importantes campeonatos de skate de rua.  Bufoni também uma das vozes mais ativas para a adoção do skate como modalidade nos Jogos Olímpicos de Tóquio em 2020. Agora, ela é uma das grandes apostas do Brasil para medalha. Com uma pista de skate própria em casa, Letícia passa seus momentos de folga viajando, praticando um pouco mais e se divertindo com outros esportes, como surfe e futebol.  ESPORTE  Vinícius Júnior, 18 O jogador carioca entrou para a história das transações brasileiras ao ser vendido do Flamengo para o Real Madrid por € 45 milhões em 2017. À época, só Neymar havia sido protagonista de uma transação maior.  Não era para menos: mesmo novo, ele era o artilheiro do time carioca e uma das figuras mais fixas da seleção brasileira sub-17.  O clube espanhol parece satisfeito com a aposta: com cada vez mais espaço no disputado time, ele tem marcado gols e caído nas graças da torcida madridista.  ESPORTE  Douglas Souza, 23 O paulista de Santa Bárbara d’Oeste é um dos principais nomes do tradicional vôlei nacional. Atual jogador do Taubaté e da seleção brasileira, Douglas foi alvo de ataques nas redes sociais recentemente depois que colegas da seleção se manifestaram a favor do candidato presidencial eleito.  Primeiro campeão olímpico assumidamente gay do vôlei brasileiro, Douglas ficou na dele e decidiu fazer o que sabe de melhor: jogar vôlei. Neste ano, foi o quinto maior pontuador do Mundial e terceiro melhor na recepção.  ESPORTE  Felipe Fraga, 23 O paraense desenvolveu a paixão pelo automobilismo desde cedo. Aos 6 anos, tornou-se campeão brasileiro de kart.  Na Stock Car desde 2014, seguiu o histórico de conquistas: em 2016, tornou-se o mais jovem piloto a conquistar um título na categoria, aos 21 anos. Atualmente corredor da Cimed Chevrolet Racing, terminou o campeonato de 2018 num apertado segundo lugar com três vitórias, sete pódios e duas poles positions.  FINANÇAS  Ricardo Guimarães, 23 Depois de um período trabalhando no mercado financeiro tradicional, Ricardo Guimarães Filho buscou aproveitar o crescente interesse em blockchain para criar a BitCapital, plataforma de open banking que usa a tecnologia como pilar. “Quando comecei a estudar a profundidade dos desdobramentos que o blockchain pode ter no mundo, percebi que seria necessário desenvolver uma nova empresa para fomentar e dar suporte a um novo ecossistema financeiro mais colaborativo e inclusivo,” aponta. O empreendedor acredita que a tecnologia dos bancos é insuficiente para atender às demandas de empresas digitais, e o cenário se agrava quando o assunto é blockchain. Criada para permitir a existência de moedas digitais, a tecnologia cria blocos de informação sequenciais, trazendo vantagens como maior transparência e baixo custo em transações. “Nossa missão é suprir as deficiências que vemos hoje em termos de APIs e oferecer uma nova infraestrutura de pagamentos, diferente do sistema atual de cartões bandeirados, que é fortemente concentrado,” aponta. Porém, o negócio de Guimarães enfrenta uma série de desafios relacionados com a rigidez dos aspectos regulatórios do mercado financeiro, bem como a criação de regras específicas para operações derivadas da nova tecnologia. “Entender as barreiras de entrada no sistema financeiro, estruturas de mercado e as questões regulatórias é um ponto-chave nesse início.” Apesar de blockchain ser uma tecnologia relativamente incipiente, Guimarães acredita que executivos mais atentos já sabem do que se trata: “Ainda há muito a desenvolver, mas o blockchain já é uma realidade. Hoje não existe mais aquela dúvida sobre o potencial dessa tecnologia e sua capacidade de escalonar.”   FINANÇAS  Davi Braga, 16 O estudante alagoano ficou famoso no país aos 14 anos, quando fez sua primeira palestra para o TEDx como um dos mais jovens investidores do país. “Quem sonha é teimoso demais para deixar seu futuro nas mãos do destino”, afirma o menino.  Aos 13 anos, Davizinho, como é conhecido, criou sua primeira startup, List-it, marketplace de listas escolares, e, um ano depois, já faturava R$ 600 mil. Ele tem um canal no Youtube e participou da versão mais recente do programa Shark Tank.  No ano passado, lançou o livro Empreender Grande, Desde Pequeno, em que ensina outros garotos a faturar “como um tubarão”. Ele rodou o Brasil dando entrevistas e palestras sobre o livro.  Como uma de suas inspiradoras, cita a empresária Luiza Trajano, do Magazine Luiza. “São as pessoas que movem o mundo”, diz o empreendedor mirim. Hoje ele estuda em uma escola técnica de negócios em Boston (EUA). FINANÇAS Pedro Conrade, 26 O empreendedor Pedro Conrade segue firme e forte no comando da Neon, empresa de pagamentos que criou em 2016.  A startup paulistana oferece conta digital e cartão de crédito para uma carteira de 1,7 milhão de usuários, entre pessoas físicas e jurídicas.  Em maio deste ano, a fintech sofreu um duro golpe com a liquidação extrajudicial do Banco Neon, seu banco parceiro, e logo depois, fechou com o Banco Votorantim para seguir operando. “A minha principal conquista de 2018 foi ter a certeza de que a Neon é uma empresa forte, cheia de pessoas altamente capacitadas, capazes de passar por desafios que ninguém imaginaria,” avalia Conrade.  Apesar dos percalços do ano, o fundador ressalta que a empresa tem várias razões para celebrar: além de um aporte de 72 milhões de reais, conseguiu chegar a 200 funcionários, definir uma nova liderança e lançar novos produtos.  FINANÇAS  Marco Aurélio Gomes, 24 O sergipano Marco Aurélio lidera o Kea Fund, primeiro fundo de venture capital especializado em blockchain no Brasil, fundado por ele em novembro de 2017.  Segundo o empreendedor, o primeiro ano foi dedicado a aprimorar a tese de investimento da empresa. “Em 2019, buscaremos encontrar, investir e apoiar empresas que estejam utilizando blockchain para trazer disrupção a mercados como o setor financeiro, seguros e saúde.”  FINANÇAS  Danilo Chiang, 30 No BTG Pactual, Danilo Chiang integra o time de investimentos do maior fundo de infraestrutura da América Latina com US$ 1,83 bilhão.  Danilo também integra conselhos de administração de empresas como a GlobeNet, empresa brasileira de telecomunicações sediada nos Estados Unidos e gestora do tráfego internacional de internet no Brasil, com R$ 1 bilhão de reais de faturamento.  FINANÇAS  Felipe Gentil, 27  Uma carreira em ascensão na XP Investimentos não foi o suficiente para impedir Felipe de ir atrás de seus sonhos.  Em 2015 o jovem fundou a Proseek, focada na educação e alocação de talentos para o mercado financeiro. Atualmente, cerca de 500 alunos já estão formados.  Na última rodada de captação de investimentos, a empresa foi avaliada em R$ 65 milhões e captou R$ 2 milhões em investimentos. O plano de crescimento agressivo inclui, até 2020, a abertura de uma faculdade.  GASTRONOMIA  Renata Vanzetto, 30 Quem olha para os nove empreendimentos (restaurantes e bufês) de Renata e seu atual time de 200 funcionários não imagina que tudo começou de forma muito despretensiosa: “Eu abri o primeiro Marakuthai em Ilhabela, com apenas 18 anos… Trabalhava com a minha família de forma bem informal, nunca imaginamos que seria algo grande”, conta a chef, que diz ter ficado mais conhecida após ganhar um prêmio do extinto “Guia Quatro Rodas”, um ano após a abertura do primeiro restaurante. Extremamente criativa e inquieta, Renata emplaca um sucesso atrás do outro e continua a manter a família bem próxima em suas sociedades, especialmente a ala feminina (mãe, tia, irmã e prima) e também seus amigos.  Após “dominar” um pedaço da Rua Bela Cintra, nos Jardins, com o bar Me Gusta, o restaurante Ema e a lanchonete Mathilda, em 2018 a chef passou seu primeiro ano sem inaugurar um novo negócio. Devido ao grande sucesso do Mathilda, logo no início de 2019 o restaurante ganhará uma segunda unidade em Pinheiros, e como é alto o nível de rotatividade (tanto de clientes presenciais como pedidos por delivery), estuda-se a possibilidade de virar uma franquia.  Em um mundo ideal, Renata confessa que sonha voltar a morar em Ilhabela, onde viveu até os 20 anos, daqui cerca de cinco anos – mas sabe que provavelmente a “agitação” não irá permitir. “Se eu não tivesse os meus próprios restaurantes provavelmente teria uma empresa para criar, do zero, vários conceitos”, completa. GASTRONOMIA Felipe Braga, 29 Felipe assumiu a posição de CEO no Suplicy Cafés no segundo semestre de 2017, e desde então a empresa passou por um reshape total, reposicionamento das lojas, abertura de pontos de venda e toda uma nova estratégia – o que explica os 180% de crescimento no último ano.  O objetivo para 2019, segundo Braga, é “construir uma empresa para os próximos 15 anos de forma sólida”.  Formado em administração pela FAAP e com bootcamp de empreendedorismo no prestigiado Babson College, conta que um de seus objetivos é poder ajudar quem está começando: “O setor food & beverage ainda é muito mistificado aqui no Brasil. Eu penso que a minha dor poderia ter sido menor. Não tem muito conhecimento, por exemplo, eu nunca tive uma aula na faculdade do assunto… É bem distante”.   GASTRONOMIA  Giovanna Grossi, 28 A chef cresceu entre panelas: seus pais são restaurateurs em Maceió, sua cidade natal. Logo após se formar, com apenas 19 anos, Giovanna mudou para a Europa, onde permaneceu quatro anos e trabalhou em restaurantes estrelados.  Quando a saudade de casa apertou, a chef inscreveu-se para a seleção brasileira do concurso Bocuse d’Or, a copa da gastronomia, e com apenas 24 anos chegou à etapa final. Desde então dedica-se totalmente ao Bocuse.  Atualmente é a presidente do campeonato no Brasil e fundou a Academia Brasil d’Or, uma organização sem fins lucrativos dedicada à divulgação da gastronomia brasileira e responsável pelo time brasileiro do Bocuse d’Or (que compete em janeiro de 2019 na etapa final).  Ela, em suas palavras, “se vira nos 50”, e além de todas as responsabilidades vai inaugurar um restaurante próprio no primeiro semestre de 2019 – e é uma voz ativa contra o machismo na cozinha.  GASTRONOMIA  Luiz Filipe Souza, 29 O ano de 2018 foi definitivamente especial para Luiz. O aprendiz de Salvatore Loi comemorou em julho o primeiro ano do seu Evvai, um dos atuais destinos quando se fala em alta gastronomia em São Paulo. Também classificou-se na final do Bocuse d’Or onde irá representar o país em janeiro de 2019. “Todos os dias simulamos a prova, que dura cinco horas e meia, conta.  Seu sonho atual? Receber uma estrela Michelin e abrir mais restaurantes que façam sentido – em março inaugura uma hamburgueria, também em SP.  GASTRONOMIA  Bruno Katz, 27 Com apenas 16 anos, Bruno trabalhou na cozinha do restaurante Madame Toffi, em Búzios, a primeira vez que seu coração bateu mais forte.  Até tentou cursar administração, mas logo voltou para gastronomia, onde cozinhou ao lado de diversos chefs, incluindo Claude e depois Thomas Troisgros, com quem trabalhou por quatro anos no Olympe após retornar de estágio no Daniel, em Nova York.  Atualmente está à frente do N.O.S.S.O, um conceito híbrido entre comida e bebida em Ipanema.  GASTRONOMIA  Victor Dimitrow, 28 Após se formar em gastronomia no Brasil, o chef se aprimorou no Instituto Paul Bocuse, em Lyon. Na sequência passou pelos restaurantes Le Chateaubriand e Patrick Guilbaud.  Em 2015 abriu o Petí, que preza pelo uso de ingredientes sazonais e execução primorosa. “O meu turning point foi quando inaugurei mais dois restaurantes dentro das unidades da Escola Panamericana, em 2017. Agora estamos tentando fazer coisas diferentes, mas não sei se é o momento para empreender aqui no Brasil.”  INDÚSTRIA  Gabriela Silvarolli, 22 Aos 5 anos, Gabriela Silvarolli já perambulava pelas lojas de calçados da família, a Corello, vendo as mulheres experimentarem sapatos e sonhando em ser vendedora. Ela conta que, com a mãe, Carla Silvarolli, CEO da empresa, ia às feiras, viajava ao sul do país para escolher os couros e visitava as montagens das vitrines, após os shoppings fecharem. Gabi, como é chamada pela família, deixava de ir ao cinema para ficar entre caixas de sapatos. Para ela, o sapato significa muito mais do que um simples calçado. “É uma forma de a mulher se afirmar, se sentir mais segura e empoderada”, diz. Antes de entrar oficialmente na companhia em 2016, Gabi cursou publicidade na Faap. Como coordenadora de estilo e marketing, trouxe sua juventude para a marca, considerada tradicional, ajudando a reposicioná-la no mercado. Ao notar que suas amigas não usavam Corello, pensou em estratégias para atrair o público de sua idade. Com o projeto Pumpland, reinventou o clássico Scarpin em cores fresh e vibrantes. Cada sapato foi apadrinhado por uma influenciadora e levou o seu nome. A coleção foi um sucesso. Em março de 2018, no dia internacional das mulheres, foram eleitas sete embaixadoras para a campanha da empresa, sendo que cada uma delas elegeu o sapato da coleção que mais a representasse. Nessa campanha, 50% do lucro do mês foi destinado à ONG Bem Querer Mulher, que atende mulheres vítimas de violência. Outro projeto encabeçado por Gabi foi o Corello Disco, que escolheu três DJs famosas para lançar a clássica coleção de festas em uma balada animada. Novamente sucesso de coleção. Empolgada, Gabi não para. As vendedoras hoje publicam as últimas tendências da marca em um Instagram privado, direcionado exclusivamente aos colaboradores. INDÚSTRIA Bruno Sindona, 30 As histórias pessoal e profissional do CEO da Sindona Incorporadora, voltada à classe C, se mesclam. Bruno cresceu na periferia de Osasco e o pai, mestre de obra, sempre foi empreendedor. A mãe herdou um terreno e, em 2000, o vendeu a uma construtora, que não terminou a obra. A família brigou anos na Justiça, até que, em 2008, retomou o terreno e com R$ 150 mil acabou o edifício de 32 unidades. Em 2011, a empresa contratou 90 pessoas para duas obras simultâneas, com moradias 25% mais baratas. “Em 2012, minha mãe faleceu e, três anos depois, fui baleado em um assalto, o que me fez ressignificar a vida”, conta. “O nosso sonho sempre foi morar bem”, diz ele, alegando entender a periferia. Então a incorporadora passou a oferecer habitações personalizadas. A empresa, que hoje fatura R$ 32 milhões, prevê um grande salto em 2020 ao inaugurar o Sindona Parque.   INDÚSTRIA  Juliana Martinelli, 26 Filha de pai militar e mãe bancária, a carioca e CEO da InovaHouse3D viveu a angústia da escolha da profissão. Foi então que entrou para o Movimento Empresa Júnior, onde aprendeu sobre empreendedorismo.  Fez engenharia elétrica na UnB e estagiou no Senai Nacional e na GIZ, que classifica como “lugares incríveis que abriram sua mente para a inovação”. “Durante esse processo, um problema me escolheu: o alto custo da moradia digna”, conta. Foi quando resolveu fundar a InovaHouse3D, empresa pioneira na América Latina que trouxe a tecnologia de impressão 3D para a construção civil. A ideia surgiu após Juliana ler que na China estavam “imprimindo” dez casas por dia para atender vítimas de desastres naturais.  Nessa época, seu pai comandava a missão de paz do Brasil no Haiti, e surgiu o desejo de reconstruir a pequena ilha. Durante um evento, um dos mentores, Lucas Lo Ami, a desafiou a trazer a tecnologia ao Brasil. E assim o foco passou a ser como transformar favelas e prover moradias para sanar o déficit habitacional do país.  INDÚSTRIA  Guil Blanche, 28 O paisagista estudou arquitetura na Escola da Cidade e artes visuais na Faap. Aos 18 anos, começou a desenhar jardins para amigos e familiares.  Em 2013, fundou o Movimento 90°, projeto que defende aumentar o verde nas cidades e que construiu o primeiro jardim vertical em escala pública da América do Sul, um prédio no Minhocão. O projeto inspirou a prefeitura de São Paulo a fazer o Corredor Verde do Minhocão, primeiro corredor de jardins verticais do mundo.  INDÚSTRIA Flávio Vinte, 25 Flávio se tornou empreendedor aos 19 anos, ao criar dois apps. Dois anos depois, fundou a Vivaçúcar, trading de açúcar que busca reduzir os custos de comercialização e distribuição do produto no país.  Nos últimos três anos, a Vivaçúcar movimentou R$ 31 milhões anuais. Hoje, ele é CEO do Comitê de Gestão Empresarial da Amcham e está no Scale-Up da Endeavor. “Nenhum sonho é grande demais para quem está disposto a realizá-lo”, diz.  INDÚSTRIA  Luiz Eduardo Moreira, 30 Formado em administração pelo Ibmec-RJ e com pós-graduação em gestão de negócios pela Fundação Dom Cabral, Luiz começou na área de Oil & Gas no Rio e, depois, foi transferido para São Paulo.  Em 2009, entrou em uma corretora multinacional de seguros e se apaixonou pelo setor. Após quatro anos, decidiu montar a própria empresa, a Vokan Corretora de Seguros, dedicada 100% ao segmento de aviação executiva.  Hoje é a maior corretora de seguros aeronáuticos para aviões de pequeno porte do país, com mais de 10% das aeronaves do Brasil seguradas. MÚSICA Kevinho, 20 Vinte anos de idade e seis de carreira – se contarmos o primeiro momento, ainda como uma brincadeira despretensiosa. No caso de Kevin Kawan, conhecido como Kevinho, esse tempo já é suficiente para somar milhões, sejam visualizações no YouTube (seu principal meio de divulgação), sejam seguidores em redes sociais. Consequentemente, a agenda de shows é tão concorrida quanto abrangente – num papo breve com o produtor durante a sessão de fotos para esta matéria, histórias de shows em estados diversos como Tocantins, Goiás, Rio Grande do Sul e Paraná apareciam como se esses lugares estivessem a poucos quilômetros de distância entre si. O Brasil é grande, mas é pequeno para o alcance do funk. Carismático, Kevinho se preocupa em ser o que realmente é atrás ou na frente da câmera. Talvez por essa transparência, também seja figura presente em campanhas publicitárias com certa frequência – Netflix e McDonald’s, onde explorou o seu bordão “cê acredita?”, foram as mais recentes e barulhentas. A música que apareceu adaptada na propaganda da rede de fast food é “Olha a explosão”, de 2016, que foi o grande ponto de virada da carreira do artista. E por ser quem realmente é, Kevinho tem voz ativa em todas as atividades da sua carreira. “Eu penso até nos roteiros dos meus clipes. Em ‘O Bebê’, a ideia foi minha com o KondZilla (diretor de clipes de funk, dono do maior canal brasileiro do YouTube e que já esteve no Under 30 em 2017), a gente nem usou os roteiristas da empresa. Sempre dou opinião e me escutam porque vivo isso diariamente. Eu sou real, vivo o funk desde os 13”, conta Kevinho, lembrando do tempo em que a música era apenas uma brincadeira entre amigos. Ainda faltam dez anos para os 30. Mas será que Kevinho já tem planos? “Quero ter o meu escritório para empresariar outros artistas. Mas ainda quero estar cantando também.” Cê acredita? MÚSICA IZA, 28 Este foi um ano agitado para Isabela Cristina Corrêa Lima. Começou com o hit “Pesadão”, parceria com Marcelo Falcão. Em março, veio “Ginga”, com Rincon Sapiência. No mês seguinte, o lançamento do disco de estreia, “Dona de Mim”. Em junho, assumiu o programa “Música boa,” do Multishow, e vem colhendo os frutos dos seus hits em campanhas publicitárias e da forte presença tanto na mídia tradicional quanto nas redes sociais.  Para fechar o ano, IZA anunciou se casar com o produtor musical Sergio Santos “Assinei com a gravadora e quando fui pro estúdio gravar, eu conheci o homem da minha vida. A música mudou tudo. Eu vendi sanduíche com a minha mãe, né, antes de começar a cantar. Da dificuldade com a separação dos meus pais, e tal, vender sanduíche foi uma solução e ali eu decidi cantar, investir nisso. A música mudou tudo e ainda trouxe o amor da minha vida, olha só!”, conta ela, num espacinho de tempo entre sua agenda e os preparativos para a festa. MÚSICA Vitor Kley, 24 “Oh, Sol, vê se não esquece/e me ilumina…”. Se você ligou o rádio numa emissora jovem ou foi a alguma festa nas últimas 24 horas, ouviu essa música. O hit “O Sol” é de Vitor Kley, e só o clipe oficial, lançado em janeiro, já ultrapassou as 100 milhões de visualizações.  Essa música fez, sem trocadilhos, o sol brilhar na carreira desse gaúcho alto astral. “Sou muito tranquilo em relação à vida e procuro carregar sempre uma energia positiva, ver as coisas pelo lado bom”, diz o cantor, que traz esse espírito zen do surf – mesmo sendo filho de um ex-tenista profissional, Ivan Kley.  Depois de algum tempo sem ver a carreira decolar, chegou o Sol: “Nunca tinha terminado um ano com agenda até agosto do ano seguinte. É muita coisa massa acontecendo… uma música gigantesca gerou um movimento pra eu mostrar que tenho mais músicas. Mas até os 30 anos, ainda quero tocar no Rock in Rio”, diz. MÚSICA Zeeba, 25 Pode não parecer, mas “Hear me now”, que apresentou para as massas a voz de Marcos Lobo Zeballos, ou melhor Zeeba, já tem dois anos – e só agora o cantor conseguiu acalmar sua agenda.  “Em 2017 foram 200 shows. Reduzi para uns dez por mês e foquei no meu disco, que sai em março.” Zeeba quer mais hits e mudanças para quando chegar aos 30: “É uma meta, sim, ter mais um hit mundial”. Nascido em San Diego (EUA), o cantor diz que não sabe se irá ficar no Brasil. MÚSICA Cat Dealers, 21 e 27 Com três anos de carreira, os irmãos cariocas Luiz e Pedro Cardoso já garantiram presença em grandes palcos nacionais como Rock in Rio e Lollapalooza e carimbaram passaportes para Espanha (onde abriram para David Guetta), China, Japão, Austrália e Irlanda, entre outros. “Nossa meta é expandir o nosso som e, quem sabe, residir em Los Angeles, onde moram alguns de nossos ídolos”, diz Pedro. Em outubro, a dupla entrou para o top 50 da britânica “DJ Magazine”, a bíblia da música eletrônica. MÚSICA Matheus & Kauan, 24 e 30 Pouco mais de cinco anos mais velho, Kauan Osvaldo, aos 15 anos, já iniciava sua carreira solo, formando duplas sertanejas com outros parceiros. Depois de morar um ano nos EUA, voltou e se deparou com seu irmão mais novo, Matheus Aleixo, já cantando e compondo. Estava dada a deixa para a formação da dupla definitiva: Matheus & Kauan.  Hoje eles alcançam 5 milhões de ouvintes por mês no Spotify e planejam excursionar com sua própria festa pelo Brasil em 2019. TECNOLOGIA Mariana Vasconcelos, 27 Mariana Vasconcelos diz estar vivendo um momento de transição e adaptação para liderar o processo de internacionalização e crescimento de sua startup, a Agrosmart. Em 2014, a empreendedora criou a empresa, que monitora plantações para otimizar a tomada de decisões em agricultura, economizando até 60% no uso da água e 30% no uso da energia necessária para a irrigação da lavoura. Mariana começou a trabalhar aos 16 anos, tocando uma padaria da família, e criou a Agrosmart a partir da observação das pressões exercidas nos pais agricultores, em sua cidade natal, Itajubá (MG). No segundo ano de atividade da startup, que funcionava em um espaço ao lado da padaria e paralelamente ao negócio familiar, veio o primeiro investimento e a subsequente mudança para Campinas (SP). A fundadora está atualmente levantando um novo aporte de capital, com conclusão prevista para fevereiro, com investidores brasileiros e internacionais. “Queremos crescer agressivamente em 2019, começando pela América Latina. Estamos montando times locais no momento,” diz. A fundadora da Agrosmart diz estar vivendo uma realidade muito desafiadora – mas ao mesmo tempo, a recompensa é grande: “É incrível ver algo que criamos tomar grandes proporções”. Para lidar com os desafios, Mariana aponta resiliência como a qualidade principal de um jovem empreendedor. “As pessoas costumam ter uma falta de confiança naquilo que elas podem fazer e acabam não correndo riscos – ou, quando arriscam, acabam se frustrando na primeira derrota. A jornada é difícil e recebemos muitos ‘nãos’, muitas adversidades, mas continuar lutando e acreditando em um propósito é o que leva ao sucesso.” TECNOLOGIA Gustavo Tremel do Valle Pereira, 27 Em uma das maiores negociações envolvendo empresas de tecnologia no Brasil em 2018, Gustavo vendeu a desenvolvedora de software Decora para a nova-iorquina CreativeDrive em março por US$ 100 milhões.  A startup criada por Gustavo e Paulo Orione em 2012 em Florianópolis automatiza a criação de produtos e cenários de decoração em 3D, utilizados por empresas com presença online, como lojas de móveis.  Hoje, Gustavo ainda trabalha na empresa e divide seus dias entre o Brasil e os Estados Unidos. O fundador pensa em empreender novamente, provavelmente na área de tecnologia. “A experiência com a Decora me mostrou que ter a operação aqui e vendas fora do país é um modelo que funciona. Temos mão de obra de alto nível em tecnologia aqui no Brasil e, com a desvalorização cambial, é possível criar produtos globais de qualidade,” aponta. TECNOLOGIA Luciano Bueno, 26 Ainda pré-adolescente, Luciano já vendia desenhos, patins e roupas para juntar dinheiro. Mas a real virada para o paulistano veio quando foi selecionado para estudar na Draper University, no Vale do Silício, em um curso especializado em formar empreendedores.  De lá saiu com a ideia que resultaria na Horvath Co, startup que utiliza nanotecnologia para criar “super-roupas” resistentes a manchas, odor e amassos. “A magia do Vale é que não existe uma ideia muito maluca para ser colocada em prática, você vai lá e faz”, explica. Em 2015, recebeu um aporte do investidor Tim Draper para colocar a ideia em prática.  Radicado em São Francisco, nos Estados Unidos, Bueno agora planeja uma mudança ainda mais radical no mercado têxtil e de moda. “Estamos conversando com alguns fundos por aqui e eu tenho convicção de que será um negócio grande”, afirma. TECNOLOGIA João Gabriel Alkmim, 24 João Gabriel cofundou a Vitta, desenvolvedora de tecnologias integradas para profissionais da área de saúde, com produtos como sistemas de prontuário eletrônico.  A startup criada em 2014 em Uberlândia hoje emprega 80 pessoas entre sua cidade natal e São Paulo e tem nove “sócios-empreendedores” – funcionários que receberam pacotes de ações da empresa como recompensa por alta performance. A ideia é ter 15 sócios em 2019. TECNOLOGIA Lincoln Ando e Raphael Melo, 27 e 29 Fundada em 2017 por Lincoln e Raphael, a IDWall desenvolve uma plataforma de inteligência artificial que identifica documentos falsos, faz verificações de identidade e validação de dados cadastrais.  Os empreendedores buscam continuar a expansão exponencial da empresa em 2019 e estabelecer a startup como “exemplo evidente de como a tecnologia pode gerar um impacto positivo para o país e nossa sociedade”. TECNOLOGIA João Lucas Melo Brasio, 30 O “hacker do bem” João Lucas recebeu medalhas do governo americano por serviços à segurança de sistemas nacionais e fez parte da equipe de auditoria no Tribunal Superior Eleitoral nas eleições presidenciais.  O especialista trabalha em outros projetos de segurança nacional através de sua empresa, a Elytron Security, que pretende transformar em “uma das maiores empresas de segurança da informação no Brasil”. TERCEIRO SETOR Isabelle Drummond, 26 A arte dramática é a face mais conhecida de Isabelle, atriz há 18 anos. Mas a jovem é também empresária e altamente engajada em causas sociais. Em 2017, fundou a Casa 197, organização independente que estuda, desenvolve e executa iniciativas sociocomunitárias.  Para manter os projetos sociais com os quais se envolve, Isabelle se aventurou no mundo empresarial e, no ano passado, junto com uma amiga, fundou a Levê Pocket, especializada em comida natural. Parte dos lucros é destinada ao financiamento das iniciativas da atriz no terceiro setor. “É muito difícil empreender no social e destravar recursos mensais. A Levê nasceu para isso, de maneira que parte da receita servisse de suporte para a continuidade das nossas ações”, diz ela.  A Casa 197 apoia causas variadas. Entre elas, estão os banquetes oferecidos a moradores de rua, que atendem cerca de 80 pessoas por refeição no Rio de Janeiro; o apoio ao Retiro dos Artistas, entidade carioca de amparo a artistas idosos em dificuldades financeiras e emocionais; e uma casa de acolhimento infantil chamada Vila Betânia, em Jaboatão dos Guararapes, Pernambuco. Isabelle, que também é embaixadora da ONG internacional Animal Equality, confessa ter carinho especial pelas iniciativas ligadas a crianças.  Os atuais projetos em estudo, estruturação e implantação envolvem um lar de acolhimento para idosos abandonados, o desenvolvimento de uma comunidade carente sustentável no Rio, com impacto direto em 400 pessoas, e um programa voltado para as artes, que será lançado em 2019. TERCEIRO SETOR Amanda Oliveira, 29 Criada na região com o maior índice de tráfico e prostituição de São José do Rio Preto, interior de São Paulo, Amanda viu sua vida mudar aos 11 anos graças às aulas de música de um projeto social da cidade.  Aos 18 anos, ela resolveu mergulhar no mundo do empreendedorismo social e fundou o Instituto As Valquírias, iniciativa que transforma a vida de meninas e mulheres em situação de risco social por meio da capacitação e da educação.  Amanda acredita que as organizações do terceiro setor precisam se profissionalizar para manter as portas abertas e não depender apenas de doações. Por isso, a fundação, que já atendeu 530 famílias, oferece palestras e shows da banda As Valquírias. “Entre ganhar dinheiro e mudar o mundo, eu fico com os dois”, diz.  Para 2019, a jovem empreendedora prepara o lançamento do livro “Antes Que As Armas Cheguem” e de uma linha de camisetas com frases de empoderamento. TERCEIRO SETOR Philippe Magno, 28 Empreendedor e gestor de marketing, Philippe é cofundador do Instituto HandsFree de Tecnologias Assistivas, criado entre 2014 e 2015 para proporcionar mais autonomia e promover a inclusão e o crescimento pessoal e profissional de pessoas com deficiência física.  O equipamento de mesmo nome, que deu origem à instituição, é totalmente fabricado no Brasil, tem baixo custo e permite o controle de computadores, tablets e smartphones apenas com movimentos da cabeça.  Além de vender o produto para pessoas físicas, a organização implementa programas e parcerias com entidades públicas e privadas, com fornecimento gratuito. “A iniciativa tem cunho social, mas não é fundamentada no assistencialismo. A ideia é que os lucros sejam destinados à pesquisa e desenvolvimento”, conta ele. Em 2018, a empresa faturou R$ 680 mil e impactou 792 pessoas direta ou indiretamente. Em 2019, a previsão é arrecadar R$ 4 milhões e atingir um número três vezes maior de usuários. TERCEIRO SETOR Matheus Cardoso, 24 O criador do Moradigna sentiu na pele o que é viver em condições insalubres na periferia da capital paulista. E foi essa experiência pessoal que o levou a fundar, em 2015, um programa social destinado a oferecer moradia adequada aos cidadãos de baixa renda por meio de reformas a preços acessíveis.  “Se você não se sente bem na sua casa, onde mais vai se sentir?”, pergunta o empreendedor, que também atua como palestrante. Até o momento, cerca de 500 casas foram reformadas, um impacto na vida de 1.300 pessoas. TERCEIRO SETOR Návila Teixeira, 27 Com uma irmã gêmea que nasceu com deficiência, Návila cresceu em um lar pautado pela empatia. Depois de trabalhar como voluntária, a engenheira civil de formação fundou, em 2016, a Porto Social, uma iniciativa que atua como incubadora de projetos das mais variadas áreas e com a capacitação de agentes transformadores.  Em dois anos, já incubou 85 projetos, com impacto direto e indireto em 300 mil famílias. A previsão para 2019 é ter números semelhantes. TERCEIRO SETOR Alexandre Amorim, 29 Depois de constatar a oportunidade de melhoria em instituições de ensino e atendimento a pessoas com deficiência – e também em função da irmã, que nasceu com Síndrome de Down, Alexandre cofundou a ASID – Ação Social para Igualdade das Diferenças.  A iniciativa se propõe a unir empresas, voluntários, instituições e pessoas com deficiência para construir uma sociedade inclusiva. O que começou em 2008 como um projeto universitário e R$ 300 impacta, hoje, 50 mil pessoas, 132 entidades e engaja 3 mil voluntários. VAREJO/E-COMMERCE Victor Fiss, 22 Aos 18 anos, ainda estudante de administração no Insper, ele entendeu que queria ter um negócio com capacidade de impactar a vida das pessoas. Também já sabia de sua afinidade com a área de saúde, adquirida no trabalho no consultório do pai, um pneumologista. Teve então a ideia: por que não montar clínicas particulares por preços acessíveis? Comprou uma passagem para São Luís, no Maranhão, e passou uma semana conhecendo a rede do pai de um amigo que funciona nesse molde. “Voltei com a certeza de que queria fazer em São Paulo algo daquele jeito”. Foi assim que a ideia da Cia. da Consulta nasceu. Victor soube que havia, na Faculdade de Medicina do ABC, algumas salas e equipamentos ociosos. Cooptou um amigo do Insper, João Nasser Gorayb, como sócio, fez uma proposta à instituição para usar o local com a divisão de 50% dos lucros e lá ficou por um ano. Obrigado a sair, começou a fazer cálculos. “Não tínhamos dinheiro para o investimento inicial.” Encontrou um ponto na praça da Sé e avaliou que precisaria de R$ 1,3 milhão para montar seu negócio. E, “na cara de pau”, foi atrás de investidores – conseguiu ótimos representantes do PIB nacional: Claudio Haddad, seu professor no Insper e fundador do Banco Garantia; Eduardo Alcalay, presidente do Bank of America Merrill Lynch; José Victor Oliva, dono da Holding Clube, e Elie Horn, fundador da Cyrela. “Para chegar no Elie, liguei para o rabino e pedi para ir num jantar ao qual ele ia. Sentei ao lado dele, comecei a contar meu projeto e ele se interessou.” Com clínica montada, vieram aprendizados: “Percebemos que um local em que passa muita gente é bem diferente de um local que concentra muita gente. E também que, focando no público das classes D e E, estávamos errando. Nosso público era mais classe B e C”. Fez a lição de casa e, no fim de 2017, pegou mais uma rodada de investimento com seus parceiros. Em 2018, montou mais quatro clínicas em pontos estratégicos. Todas com consultas a R$ 90, que podem ser parceladas em até dez vezes. Victor tem um negócio hoje com 70 funcionários e 110 médicos, que já atendeu mais de 15 mil pacientes em 33 especialidades. Embora não divulgue números, teve um aumento de 15 vezes no faturamento em comparação ao ano anterior. “Conseguimos oferecer um serviço de muita qualidade a um preço acessível.” VAREJO/E-COMMERCE Nader Fares, 27 Há quatro anos ele comanda a empresa da família – a Marabraz – ao lado do primo Abdul, de 35 anos. Apesar da pouca idade com que assumiu um negócio bilionário, com 130 lojas, 2.500 funcionários e instalado num dos maiores centros de distribuição do mundo, Nader conta que o processo foi natural. “Estou na empresa desde os 12 anos e passei por todos os cargos. Todo dia, na volta para casa, eu e meu pai conversávamos sobre o trabalho. Ele viu que podia confiar”, conta.  Formado em administração e com especialização em e-commerce pela UCLA, o jovem CEO não decepcionou. Em plena crise, aumentou o mix de produtos de 3 mil para 15 mil, ampliou os meios de pagamento e criou a Blue Group, que gere os negócios digitais da família.  Em 2019, vão relançar no mercado a marca Mappin, inicialmente para vendas online. Depois de dois anos “estancando a sangria”, 2018 fechou com crescimento estimado em 25%. VAREJO/E-COMMERCE Isabela Matte, 20 Apesar da pouca idade, ela já tem oito anos de mercado. Aos 12, começou a vender as roupas que desenhava para usar por achar que a moda não atendia às suas necessidades – ela já não era uma criança mas ainda não era uma mulher.  O negócio fez tanto sucesso que virar um e-commerce foi o caminho natural. “Meu público cresceu comigo, e hoje a marca tem uma modelagem para ele, mas ainda existe esse gap para as meninas mais novas. Por isso, estudo fazer uma setorização e abrir a Isabela Matte teens”, conta.  A jovem acredita que sua veia empreendedora tem muito de inato, já que aos 7 anos fazia pulseiras para vender. Mas também atribui o sucesso ao apoio dos pais. O investimento inicial foi feito pelo pai e a mãe a acompanhava, aos 13, em reuniões com fornecedores. Grávida de cinco meses, ela planeja expandir seu negócio para os EUA em 2019. VAREJO/E-COMMERCE Augusto Quirós, 28 Quarta geração de uma família que produz cordeiros na Espanha, Guto montou com a irmã em 2009, no interior de SP, a primeira fazenda a produzir essa carne de forma orgânica e sustentável. A Quirós Gourmet é hoje a maior empresa do setor, com mais de 480 clientes, mas também com vendas para o consumidor final pelo e-commerce.  Em 2017, Guto criou o projeto “Descobrindo a Carne de Cordeiro”. “São palestras, workshops e conteúdo em vídeo com a missão de introduzir a carne de cordeiro na rotina do brasileiro.” VAREJO/E-COMMERCE Thiago Brandão e Nara Iachan, 30 e 28 Quando vivia na Argentina, Nara, a exemplo dos cidadãos locais, usava cupons de desconto para fazer compras. Em 2012, de volta ao Brasil e na faculdade de economia, ela e o amigo Thiago decidiram abrir uma empresa do tipo (junto a outro cofundador, Lionardo Nogueira).  A Cuponeria, que recebeu recentemente um aporte do InovaBra, do Bradesco, já ofereceu 22 milhões de descontos. VAREJO/E-COMMERCE Marcos Calazans, 28 De olho em pessoas que queriam investir em franquias de grandes redes, mas não tinham o valor do investimento inicial ou não queriam envolver-se muito no dia a dia dela, o empresário Marcos Calazans criou em 2014, aos 24 anos, o Banco de Franquias, que hoje administra redes de marcas como a KFC e a Adidas.  Seu modelo de negócios inovador chamou atenção no programa “Shark Tank” em 2018: quatro dos investidores que participam da atração pagaram R$ 350 mil por 40% de uma de suas franquias, a Tapiocaria Market. WEB Pyong Lee, 26 Paulistano filho de um casal sul-coreano que veio ao Brasil há três décadas em busca de melhores oportunidades, Jaime Young-Lae Cho, mais conhecido como Pyong Lee, diz que sempre gostou de ser o centro das atenções. Começou dançando break, mas aos 10 anos percebeu que a mágica era um entretenimento mais amplo, capaz de agradar a todos os tipos de público. Participou de programas de televisão e, com o surgimento da internet em larga escala, decidiu criar, em 2013, um canal no YouTube para tratar do assunto.  Em 2016, depois de fazer mais de uma dezena de cursos no Brasil e no exterior sobre hipnose, Pyong Lee passou a abordar o tema na plataforma. Com mais de 5 milhões de inscritos e 280 milhões de visualizações, o canal serve, atualmente, como uma vitrine para algo maior. O jovem inquieto gasta parte do seu tempo preparando cursos online e ministrando versões presenciais sobre hipnose e planeja a abertura, em março de 2019, de um Instituto de Desenvolvimento Humano. “Mergulhei na programação neurolinguística e em todos os tipos de terapias hipnóticas para ajudar as pessoas a lidarem com problemas psicossomáticos, que podem ser tão graves a ponto de levar ao suicídio. Acabou virando uma missão de vida”, diz ele, cujo maior orgulho é ter livrado da depressão uma pessoa que vivia nela há mais de 20 anos.  Atualmente, Pyong Lee – que já lançou livro e virou personagem da Turma da Mônica – revela que seus principais rendimentos ainda vêm de contratos com marcas como LG, Fanta e McDonalds, mas que a incursão no mundo dos cursos está ganhando uma fatia cada vez maior do bolo. “Até agora, são cerca de 2 mil alunos atendidos via internet e 200 presencialmente.” WEB Thássia Naves, 29 Com livre acesso entre avós estilistas e mãe e madrinha antenadíssimas no segmento fashion, Tássia fez do mundo da moda seu hábitat. Aproveitou a onda da tecnologia para levar seus looks inovadores e dicas de moda, beleza e lifestyle a um número cada vez maior de pessoas por meio de um blog que virou site e, hoje, domina o Instagram.  Uma das maiores digital influencers do país no assunto, é conhecida mundialmente: mais de 3 milhões de seguidores a acompanham na rede social. Em seu canal no YouTube, são quase 200 mil inscritos.  “Este ano foi maravilhoso. Cresci muito profissionalmente, reinventei a forma como me comunico e tenho investido cada vez mais em licenciamentos”, conta ela, que lançou uma linha de esmaltes e uma coleção assinada de moda fitness. A mineira tem parcerias com mais de 15 marcas. WEB Gabriel Toledo (FalleN), 27 A história de FalleN se mistura à do Counter-Strike brasileiro, popular jogo eletrônico responsável pela massificação das versões em rede. Mas muita coisa aconteceu até que o jovem de Itararé, interior de São Paulo, conquistasse esse status.  Jogador exímio desde cedo, viveu mais de uma vez o dilema de ter de escolher entre estudar ou continuar com um hobby que poderia virar profissão. “Quando estava no cursinho para engenharia fui convidado a fazer parte do FireGamers, o melhor time do Brasil”, lembra.  Anos mais tarde, achando que estava estagnado, preparava-se para a vida acadêmica quando uma atualização da versão 1.6 o levou de volta às batalhas virtuais. Deu certo. FalleN é considerado um dos melhores AWPers (líderes de jogos) domundo, eleito pela FORBES EUA como um dos jovens abaixo dos 30 anos mais promissores na categoria Games.  FalleN tem, ainda, um lado empreendedor: criou linhas de produtos, possui uma loja online e é proprietário da Games Academy, todos negócios que envolvem o ecossistema dos e-games. WEB Marco Túlio Matos Vieira, 22 Ele é o herói dos fãs de Minecraft, uma das maiores febres adolescentes em videogames. O mineiro começou a gravar seu desempenho no jogo aos 15 anos e a exibir em um canal batizado de AuthenticGames.  De lá para cá, já são quase 16 milhões de inscritos na plataforma, que lhe garantem, mensalmente, 180 milhões de views. O jogo também é tema de cinco livros que lhe renderam o título de um dos maiores vendedores de obras infanto-juvenis do país, com 600 mil exemplares. Além disso, a marca licencia mais de 50 produtos. WEB Mari Saad, 23 Ela fala sobre moda, beleza, nutrição e viagens no blog, nas redes sociais e no YouTube. A jovem de Jales, no interior de São Paulo, pensou em fazer faculdade de medicina antes de se tornar digital influencer.  Com mais de 1,5 milhão de inscritos na plataforma de vídeos e quase 2,5 milhões de seguidores no Instagram, usa o prestígio conquistado no mundo virtual para capitalizar no mundo real.  Tem linha de pincéis e de sombras desenvolvida com a Océane e batons líquidos com a Payot. WEB Lukas Marques e Dani Molo, 23 e 24 Criado em 2013, o canal Você Sabia? apresenta curiosidades sobre os mais variados assuntos. Tão variados quanto listar dez pessoas que morreram de forma inacreditável ou descrever o lugar mais silencioso do mundo.  A apresentação fica a cargo do goiano Lukas e do italiano Daniel, que se mudou para o Brasil aos 15 anos. Bem entrosados, os meninos já têm mais de 19 milhões de inscritos no YouTube e 160 milhões de views por mês.  A performance atraiu contratos de peso, como o fechado com a Gillette. Eles diversificaram e hoje fazem também produção musical, consultoria digital e criaram uma grife.  ARTES & ESPETÁCULOS/ENTRETENIMENTO  Óscar Martins, 29 Depois de tentar carreira na política, no mercado de ações, no agronegócio e na área de comércio exterior, foi com uma festa que Óscar Martins, um dos principais nomes do setor de eventos atualmente do país, encontrou seu caminho. A trajetória do empresário do entretenimento começou com a organização do lançamento de uma cachaça produzida na fazenda de seu pai, em 2014. O evento previsto para 500 convidados ganhou forma, tomou proporções maiores e acabou se tornando a primeira edição da Óscar Party, com a presença de 4.200 pessoas no Goiânia Golf Club (GO). Sem nenhum tipo de investimento, a iniciativa foi inteiramente financiada pela venda antecipada de ingressos. “Quando a festa surgiu, a única coisa que eu já tinha organizado era aniversário. Mas eu precisava fazer dar certo. Peguei minha agenda de telefones e convidei todo mundo que eu conhecia. Depois, liguei para todos eles novamente e pedi os contatos dos seus amigos. Me ofereci para reservar hotel, buscar no aeroporto. O corpo a corpo fez toda a diferença”, lembra. A empreitada fez tanto sucesso que Óscar não parou mais. No mesmo ano, comandou um pré-Réveillon em Trancoso, na Bahia, e, no ano seguinte, fundou a Agência Óscar. “Eu estava com uma equipe muito boa. Não queria perdê-la. Então criei a agência e começamos a realizar eventos paralelos”, conta ele, que incluiu em seu portfólio a festa MÓL, a feijoada SEOROSA e a OSC Airport Party. Apesar dos inúmeros projetos realizados ao longo dos anos, a Óscar Party ainda é o principal produto. “Em Goiânia, os salões de beleza funcionam até de madrugada no dia da festa. A gente lota os principais hotéis e restaurantes. O clima muda. Você sente que existe algo diferente acontecendo na cidade.” *POR ANGELICA MARI, CLÁUDIA DE CASTRO LIMA, GABRIELA ARBEX, GIULIANNA IODICE, JULIANA ANDRADE, KÁTIA MELLO, LUCAS BORGES TEIXEIRA E MARCOS HENRIQUE LAURO. COORDENAÇÃO EDITORIAL JOSÉ VICENTE BERNARDO. FOTOS GUSTAVO ARRAIS. Reportagem publicada na edição 64, lançada em janeiro de 2019 Siga FORBES Brasil nas redes sociais: FacebookTwitterInstagramYouTube  © Forbes 2023. Todos os direitos reservados.", "url": "https://forbes.com.br/listas/2019/04/10-destaques-brasileiros-abaixo-dos-30-anos/", "threshold": 1.0}