{"title": "Como sair na lista Under 30 da Forbes Brasil - Forbes", "content": "Início / Listas / Como sair na lista Under 30 da Forbes Brasil Forbes Under 30: Laiza de Moura, Casimiro, Virginia Fonseca e Ricardo Silvestre estão entra os homenageados de 2022 A lista Forbes Under 30 é publicada no Brasil desde 2014 e já homenageou mais de 550 nomes. Aqui é possível ver os destaques da mais nova edição e ver os homenageados das edições anteriores, como Gil do Vigor, Maju de Araújo, Carlinhos Maia, Anitta, Eduardo Lyra, Kéfera e Neymar. Criada em 2012 pela Forbes norte-americana, a lista elenca empreendedores, criadores e game-changers abaixo de 30 anos que mais se destacaram em seus setores, revolucionando negócios e mudando o mundo. Como faço para entrar na lista? Não há como garantir um lugar. Consideramos vários fatores ao fazer a lista: resolução de problemas, receita, financiamento, tamanho da empresa, histórico e diversidade. As pessoas que chegaram lá provavelmente conseguiram por uma variedade de fatores. Qualquer pessoa pode indicar alguém ou se indicar para a lista Under 30? Sim, as indicações acontecem online, em forbes.com.br/under30, o que permite que nomes com menos destaque na imprensa, de norte a sul do país, sejam conhecidos pela Forbes. É melhor indicar a si mesmo ou ser indicado por outra pessoa? Não faz diferença, de verdade. Se a pessoa que te indicou for o Bill Gates, mas o endosso dele for simplesmente “coloque esta pessoa na lista”, não será muito útil. O melhor tipo de indicação é aquela que fornece detalhes concretos (números, patrocinadores, impacto) sobre você ou seu amigo. Como funciona o processo de seleção? Uma equipe da Forbes avalia todos os materiais enviados nas inscrições e também pede indicações de quem saiu na lista Under 30 em anos anteriores e especialistas de cada categoria. A partir daí, eles identificam os candidatos mais promissores, que são avaliados segundo uma série de critérios e métricas objetivas e subjetivas, como faturamento, criatividade, ineditismo, benefícios sociais reais e projetados, número de pessoas impactadas e potencial em curto, médio e longo prazos. Como sei se entrei na lista? Devido ao volume de inscrições e à natureza do projeto, ninguém descobre que entrou na lista até o dia da publicação. Não tenho certeza de qual categoria escolher e não quero perder minha chance me inscrevendo na categoria errada. Nossa equipe de reportagem é rígida – se houver uma categoria mais adequada, nós faremos a mudança por aqui. Devo incluir a receita da minha empresa? É extremamente útil, mas não é obrigatório. E se eu tiver um sócio? É possível só um de nós entrar? Em caso de seleção, todos os cofundadores com até 30 anos da mesma empresa entram na lista. Qual é o prazo de envio? O prazo será divulgado quando as inscrições forem abertas. É preciso pagar por uma indicação? Uma taxa é cobrada pela indicação de um nome para a lista Under 30. É uma maneira de tornar as indicações mais criteriosas. Nas indicações, também são pedidos links de publicações sobre o nome indicado, entre outros documentos. Porém, de forma alguma essa indicação e o pagamento da taxa garantem a escolha de um candidato. A Forbes cobra para incluir alguém na lista Under 30? Não. A Forbes repudia qualquer comentário diferente disso e classifica qualquer postagem nesse sentido de fake news passível de medidas judiciais. Apenas quem é indicado no site sai na lista Under 30? Não. Alguns nomes que ganham visibilidade por conta própria e chamam a atenção da comissão julgadora podem entrar na lista final sem passar pelo processo de inscrição formal. Quem já foi Forbes Under 30? Lista Forbes Under 30 2022: veja todos os homenageados Lista Forbes Under 30 2021: veja todos os homenageados Under 30 2020: 90 destaques brasileiros abaixo dos 30 anos Under 30 2019: Os 90 destaques brasileiros Under 30 2018: 90 destaques brasileiros abaixo dos 30 anos Under 30 2017: 91 destaques brasileiros abaixo dos 30 anos Under 30 2016: 30 jovens mais promissores do Brasil abaixo dos 30 anos Under 30 2015: 30 destaques brasileiros abaixo dos 30 anos Under 30 2014: 30 destaques brasileiros abaixo dos 30 anos Siga Forbes Brasil nas redes sociais: FacebookTwitterInstagramYouTubeLinkedIn Siga Forbes Money no Telegram e tenha acesso a notícias do mercado financeiro em primeira mão Baixe o app da Forbes Brasil na App Store ou na Play Store     © Forbes 2023. Todos os direitos reservados.", "url": "https://forbes.com.br/listas/2023/03/como-sair-na-lista-under-30-da-forbes-brasil/", "threshold": 0.25134558363287063}