{"title": "Lista Forbes Under 30 2021: veja todos os homenageados - Forbes", "content": "Início / ForbesLife / Lista Forbes Under 30 2021: veja todos os homenageados   Em um mundo desafiado a encontrar novos modelos de produção, de consumo, de convivência sustentável, saudável e justa, de diversão e arte – de sobrevivência, enfim –, mentes jovens, visionárias e generosas se destacaram nos mais diversos setores, nos mais diversos cantos do país. A equipe de jornalistas da Forbes, com a colaboração de especialistas, selecionou seis representantes (que por vezes são formados por duplas ou trios) de cada uma das 15 categorias – com exceção de Esportes, que, graças à boa atuação da delegação brasileira na Olimpíada de Tóquio, teve 11 homenageados. Eles foram avaliados e escolhidos entre aqueles que se inscreveram (ou foram indicados por terceiros) na plataforma online Under 30, entre aqueles sugeridos pelos especialistas consultados e entre os que emergiram do trabalho de pesquisa e curadoria da equipe Forbes. Cada candidato é avaliado segundo critérios e métricas objetivas e subjetivas, como faturamento, valor de mercado, aportes recebidos, número de seguidores nas redes sociais, alcance e impacto social, criatividade, ineditismo, disrupção e relevância no respectivo setor, entre outros. As categorias são as seguintes: Arquitetura, Design e Urbanismo; Artes dramáticas; Artes plásticas e Literatura; Ciência e Educação; Esportes; Finanças; Gastronomia; Indústria; Marketing e Publicidade; Moda; Música; Tecnologia e Inovação; Terceiro setor e Empreendedorismo social; Varejo e E-commerce; Web e E-sports. Os especialistas e profissionais consultados para a elaboração desta Lista Forbes Under 30 2021 foram os seguintes: Amanda Pinto (empresária), Barbara Soalheiro (fundadora da Mesa Company), Beatriz Bevilaqua (jornalista especializada em startups e empreendedorismo), Camila Farani (investidora e jurada do “Shark Tank”), Chico Tattini (CCO na GoGaming/Rensga Esports), Cristina Naumovs (consultora de criatividade e inovação), Eduardo Tironi (jornalista esportivo da BandSports e UOL), Emilio Fraia (escritor e editor da Companhia das Letras), Evaristo Martins Azevedo (crítico de arte, membro da APCA e jurado do Prêmio Shell de Teatro), Fernando Jaeger (designer), Gian Oddi (jornalista esportivo da ESPN), Helena Bertho (head de diversidade do Nubank), Ian Uviedo (escritor), Jarid Arraes (escritora), Josimar Melo (crítico de gastronomia na “Folha de S.Paulo” e curador do canal Sabor&Arte), Larissa Januário (apresentadora do canal Sabor & Arte), Leonardo Dias (arquiteto e urbanista), Marcela Bacchin (consultura de sustentabilidade e impacto social), Maria Prata (jornalista e produtora de conteúdo de empreendedorismo e inovação), Marllos Silva (ator, diretor e dramaturgo, idealizador do Prêmio Bibi Ferreira), Maure Pessanha (diretora executiva da Artemísia Negócios Sociais), Monique Evelle (consultora de inovação e diversidade), Natalia Mota (professora do Instituto de Psiquiatria e criadora do SciGirls), Nicolle Merhy (CEO da Black Dragons), Nilson Xavier (autor do livro “Almanaque da Telenovela Brasileira” e colunista do site TV História), Renato Pedigoni (diretor executivo de tecnologia do Grupo Boticário), Ricardo Cavallini (especialista em tecnologia e cultura maker), Ricardo Perrone (colunista esportivo do UOL), Ricardo Rocha (professor de finanças do Insper), Robson Braga de Andrade (presidente da Confederação Nacional da Indústria), Rodrigo Silveira (designer), Ronaldo Bressane (escritor), Rosenildo Ferreira (fundador do coletivo 1 Papo Reto), Stephanie Ribeiro (arquiteta e apresentadora do GNT), Sylvia Werneck (crítica de arte), Tuca Reinés (fotógrafo e colaborador da editora alemã Taschen) e Yasmin Nigri (crítica literária). Conferir a seguir a lista completa, apresentada por SingularityU Brazil com patrocínio de Reserva e Volvo. O ator Christian Malheiros Ele foi uma criança estudiosa, ativa e dedicada. Aos 9 anos, realizou seu primeiro curso de teatro, na escola. Quando as aulas chegaram ao fim, percebeu como atuar tinha lhe deixado uma marca. Filho da periferia de Santos, fez cursos gratuitos e, quando já estava mais velho, teve diferentes empregos para poder bancar os estudos. Aos 15, estreou no cinema em “Sócrates”. Pelo papel, foi indicado a Melhor Ator no Spirit Awards, considerado o Oscar do cinema independente nos Estados Unidos. “Mudou totalmente minha cabeça como ator, para todos os trabalhos que faço no teatro e no cinema. Saio mais humano de cada personagem que interpreto”, conta o ator, que afirma ter aprendido sobre a função social do cinema no Brasil e a responsabilidade de se comunicar com tantas pessoas com essa experiência. Desde então, protagonizou a série “Sintonia” e o filme “7 Prisioneiros”, da Netflix, e participou da série “Sessão de Terapia”, da Globoplay. Para o futuro, quer continuar emprestando a si mesmo para “contar boas histórias e humanizar figuras que nem sempre são vistas além de estereótipos”. O ator Paulo Vieira Um dos grandes nomes do humor, Paulo Vieira começou a carreira no teatro, em Palmas, no Tocantins. Depois, descobriu o stand-up comedy e, para ampliar os horizontes, mudou-se para São Paulo. Ganhou popularidade ao trabalhar ao lado de Fábio Porchat no programa que o humorista comandava na TV Record, onde ganhou o público com suas histórias divertidas sobre os perrengues que já tinha passado na vida com o quadro “Emergente Como a Gente” – contar o cotidiano da sua origem humilde virou marca registrada do seu trabalho. O sucesso chamou a atenção da TV Globo, que o contratou para o núcleo de humor da emissora. Entre os projetos realizados estão o quadro “Como Lidar?”, do “Fantástico”, e o programa “Fora de Hora”, que satirizava noticiários. Atualmente, ele comanda o programa culinário “The Rolling Kitchen Brasil”, da GNT. Multifacetado, já lançou um EP de músicas infantis com composições próprias, em 2017, e se prepara para lançar seu primeiro livro infantil em parceria com a HarperCollins. Além da carreira artística, Vieira é empresário: ele é sócio da empresa de turismo Viva Jalapão e planeja abrir uma casa de shows no Tocantins em 2022. A atriz Nicole Rosemberg A carreira de Nicole começou por acaso: apesar de sempre ter gostado de arte, ela acabou sendo descoberta em 2012, quando estudava moda e recebeu o convite para participar de um show de calouros no SBT. O segundo lugar no concurso a levou a reconsiderar o futuro e investir na formação em teatro. Para dar vazão às suas maiores paixões, a atuação e o canto, ela fez musicais, como “Zorro, Nasce Uma Lenda”, quando viveu a protagonista Luisa, papel que lhe rendeu o Prêmio Bibi Ferreira de Atriz Revelação. Em 2021, integrou o elenco da novela bíblica “Gênesis”, da Record. Para 2022, além de já estar escalada para a novela “Reis”, ela pretende lançar o primeiro projeto oficial como cantora, com composições autorais. O ator Filipe Bragança Natural de Goiânia, o jovem conquistou o primeiro grande trabalho aos 12 anos, quando atuou no remake da novela infantil “Chiquititas”, produzida pelo SBT. Depois disso, engatou outros trabalhos na TV, como a novela “Órfãos da Terra”, da Rede Globo, mas também marcou presença no cinema (“Eu Fico Loko!” e “Cinderela Pop”, da Netflix) e no teatro, chegando a ganhar o prêmio de Ator Revelação no Prêmio Bibi Ferreira em 2017 por sua atuação como Marius em “Os Miseráveis”, adaptação da Broadway. Em 2021, integrou o elenco de “Dom”, série original brasileira da Amazon Prime Video, em que interpreta o pai do protagonista na fase que se passa na década de 1970. Bragança estreou na dublagem na produção “Aba e sua Banda”, 100% nacional, e também teve a chance de dar voz ao personagem Camilo, na animação da Disney “Encanto”. Em 2022, estará presente na segunda temporada de “Dom” e na série “Só Se For Por Amor”, da Netflix. A atriz Jeniffer Nascimento Crescida na Cohab 1, na Zona Leste de São Paulo, Jeniffer iniciou os estudos em teatro aos 5 anos. Após começar a carreira com trabalhos publicitários, ela descobriu o mundo do teatro musical, onde construiu boa parte de sua trajetória, participando das adaptações brasileiras de clássicos da Broadway como “Hairspray”, “Mamma Mia!” e “Hair”. ​​Sua grande estreia na TV aconteceu em 2014, quando interpretou Sol na novela “Malhação – Sonhos”. O ano de 2021 foi especial para a artista: ela interpretou Donna Summer no auge da carreira no musical biográfico sobre a rainha da disco music, integrou o elenco das séries “Não Foi Minha Culpa”, da Star+, e “Só Se For Por Amor”, da Netflix, produções com previsão de estreia em 2022, apresentou os bastidores do “The Voice Brasil” pelo terceiro ano e deu voz à personagem Dolores, da nova animação da Disney “Encanto”. Também em 2022 Jeniffer retornará às novelas como parte do elenco de “Cara e Coragem”, nova trama das 7 da Rede Globo. O ator Tauã Delmiro Tauã demonstra versatilidade ao atuar, dirigir, roteirizar e compor canções originais para espetáculos. Nos últimos anos, destacou-se como parte do elenco de musicais como “Madagascar – Uma Aventura Musical”, em que viveu o Rei Julien, e “‘70? Década do Divino Maravilhoso – Doc. Musical”, pelo qual recebeu indicação ao Prêmio Cesgranrio como Melhor Ator em Teatro Musical. Entre os trabalhos que dirigiu, a peça “[nome do espetáculo]” ganhou o prêmio de Melhor Espetáculo no Prêmio do Humor RJ em 2018. O monólogo “Dois Pais”, apresentado em português e libras simultaneamente, ganhará adaptação literária em 2022 pela editora Urutau.   O escritor Evandro Cruz Silva Evandro nasceu em São Vicente (SP), filho de um motorista de ônibus e uma faxineira diarista, vindos de Abaíra (BA). Ele é mestre em sociologia pela Universidade Federal de São Carlos e doutorando em ciências sociais pela Universidade Estadual de Campinas, além de professor de sociologia da Universidade Estadual de São Paulo. Em 2020, ficou em segundo lugar no Prêmio Nacional de Ensaios da Revista Serrote; este ano, entre mais de 1.200 textos, ficou com a primeira colocação com o ensaio “Orfeu Enfrenta o Genocídio Negro”. Lançado em novembro, “Praia Artificial” (editora Patuá) é sua estreia na literatura de ficção. O escritor tem como atuais referências literárias nacionais: Paulo Scott (“Marrom e Amarelo”), Michel Laub (“Solução de Dois Estados”) e Adriana Lisboa (“Hanói”). “A meta para 2022 é vencer a barreira do sucesso momentâneo e dar maturidade à minha carreira, vivendo-a no presente e não em sucessos passados ou expectativas futuras. Para um garoto negro que nasceu de pais retirantes até que cheguei longe, mas tenho certeza de que dá para fazer mais”   Samuel de Saboia Desde a primeira exposição solo em 2018, na Ghost Gallery, em Nova York, esse recifense da comunidade de Totó não parou mais de viajar mundo afora. Morou nos Estados Unidos, no Marrocos, na Suíça, em Londres, em Berlim e em Paris, onde se encontrou. “Aprendi francês em um mês e meio, indo para bares”, comenta ao voltar ao Brasil, em dezembro, após sua segunda individual (“Incubation – A Spell to Wake You Woke”), na capital francesa, resultado da inédita residência artística da marca Comme des Garçons, em Marais. Samuel é o único artista brasileiro a brilhar na campanha global Proud in My Calvins, da Calvin Klein. São dele também as ilustrações de “Quincas Borba”, clássico de Machado de Assis (editora Antofágica), e a capa do disco “Gracinha” (versão orquestrada), de Manu Gavassi (Under 30 2020), lançado em dezembro. “Minha criação e minha existência não têm fronteiras”, diz o filho de pastores da Igreja Batista Peniel em Cavaleiro. “É Deus quem vem em primeiro lugar.” Gabriela Soutello Autora do livro de contos “Ninguém Vai Lembrar de Mim” (Jandaíra), a paulistana que cresceu em vários endereços do Jabaquara, Ipiranga e Ana Rosa venceu o Prêmio Mix Literário, em 2019. Gabriela conversou com mais de 130 brasileiras para fazer a curadoria da antologia “Antes que Eu Me Esqueça – 50 Autoras Lésbicas e Bissexuais Hoje” (Quintal, 2021). Filha única de pais separados, a escritora e jornalista formada na Cásper Líbero perdeu o chão em 2014 com a morte do pai alcoólatra. “Ele me levava para a padaria, me dava um picolé e um gibi… e bebia.” Ela se inscreveu e conseguiu um estágio na Deutsche Welle Brasil na Alemanha, onde ficou por seis meses. “Não tenho raízes, posso estar em muitos lugares, mas há uma carga de solidão embutida nisso.” Ao lado da namorada Poly, ela saiu de carro há nove meses, rumo ao Nordeste. Passam temporadas de um mês em diferentes casas. “Há dez anos quero sair de São Paulo.” O home office imposto pela pandemia ajudou a colocar o pé na estrada. Amanda Miranda “Comecei a desenhar quando era criança, mas não achei que trabalharia com isso. Venho de uma família de professores metalúrgicos, pensei que fosse para esse lado”, diz Amanda Miranda, finalista do Prêmio Jornalístico Vladimir Herzog de Anistia e Direitos Humanos (categoria Arte, 2020), com as ilustrações de “Máquina de Moer Preto” (The Intercept Brasil). “Ler literatura fantástica me fez querer começar a escrever”, conta ela. Vivendo em polo têxtil do interior de São Paulo e tendo começado a desenhar estampas para a indústria, a quadrinista foi selecionada pelo edital do MIS SP (2019) e publicou a HQ “Sangue Seco Tem Cheiro de Ferro”. Com “Juízo”, chegou à final da HQMix 2020. A história faz parte da coletânea “Tabu” (editora Mino), e o tema escolhido foi aborto. “Conto a história de uma mulher que vai abortar, sem dizer o motivo; afinal, é uma questão de autonomia básica sobre o próprio corpo.” Para a Netflix ilustrou peças para o lançamento de duas séries: “Cursed” e “Lúcifer”. Rafael Sanches Artista multidisciplinar, com a infância ancorada no ABC paulista, Rafael mescla pintura, arquitetura e moda, com a marca Filadelfio. As primeiras telas com temas focados em tipografia – influenciado pelo grafite – surgem no terceiro ano de arquitetura na Faculdade Belas Artes (SP). Além de vender as telas, seus traços o levam a assinar murais nos EUA, na Irlanda e na Holanda; e a realizar trabalhos para marcas como BMW e Nike. Desde 2019, realizou três exposições individuais. Interessado em pavimentar caminhos para outros artistas, abriu a Galeria Nós (SP). E, na pandemia, criou a Casa Vista: uma instalação artística em Extrema (MG) com paredes de vidro e energia solar, que propõe uma conexão entre arte e natureza, valorizando práticas sustentáveis e contemplação. Jéssica Macedo A mineira Jéssica Macedo escreve histórias desde os 9 anos e, aos 14, lançou seu primeiro livro. Aos 20, abriu a própria editora. Hoje, aos 25, conta já ter publicado mais de 100 obras, com 100 mil e-books e 10 mil livros físicos vendidos, além de 250 milhões de páginas lidas no Kindle Unlimited, programa de assinatura da Amazon. Em 2021, ajudou a adaptar um de seus livros para um filme lançado na plataforma Cinebrac. Seus romances sobre casais têm como leitores principalmente mulheres, de todas as idades. “Comecei a fazer sucesso quando consegui identificar o que o público queria ler e entregar esse conteúdo”, diz. “O faturamento da editora tem girado entre R$ 150 mil e R$ 180 mil mensais, a maior parte em função dos meus livros (ela também publica outros autores).”   Gabriel Granjeiro Sócio fundador e CEO do Gran Cursos Online, Gabriel Granjeiro começou a trajetória no setor de educação na escola do pai, em Brasília, onde, ainda adolescente, ajudava em atividades que iam da portaria ao almoxarifado. Aos 18 anos, foi estudar em Nova York pensando em atuar no mercado financeiro. Mas, dois anos depois, de férias no Brasil, teve a ideia que o manteve no ramo de negócios da família. “Percebi uma oportunidade de criar algo que pudesse impactar a vida de pessoas sem as limitações do físico”, diz. “Convidei o Rodrigo Calado, meu sócio, que é um gênio da tecnologia, e montamos um projeto voltado para preparação online para concursos e provas”. Segundo Granjeiro, hoje a Gran tem 379 mil alunos ativos pagantes, 688 funcionários e mais de 600 professores parceiros. Faturou R$ 150 milhões em 2020 e tinha R$ 215 milhões previstos para 2021. Nesse último ano, recebeu um aporte de R$ 150 milhões do fundo de impacto ESG do BTG Pactual. “Temos uma frente social e inclusiva forte. Mais da metade do nosso público é formada por pretos e pardos, e grande parte tem renda de até três salários mínimos.” Katarine Emanuela Klitzke A menina de Timbó (SC) que gostava de ver estrelas no acampamento de escoteiros decidiu se dedicar à astronomia no dia em que soube da morte de seu ídolo, o físico Stephen Hawking. Nessa época, 2018, Katarine já tinha se destacado em olimpíadas científicas e recebido uma oferta para estudar com bolsa em uma escola de Fortaleza. No ano seguinte, ingressou no Georgia Institute of Technology, nos Estados Unidos, onde cursa engenharia da computação, astrofísica e inteligência artificial. Pagou o primeiro ano com uma vaquinha virtual; no segundo, recebeu bolsa da Fundação Estudar e bolsa parcial da universidade, além de ser remunerada como assistente em pesquisas. Com colegas do Georgia Tech, em 2020 foi premiada em uma competição da Nasa que propõe a jovens em graduação trazer inovações para o programa espacial. “Desenvolvemos uma missão para Marte, desde o design dos foguetes e dos veículos de superfície até a parte de pesquisas, com estruturação do tempo e formas de proteger a saúde dos astronautas”, diz a estudante. “Trouxemos tecnologias que brilharam os olhos da Nasa quando apresentamos o projeto no Ascend, que é uma conferência de pesquisas aeroespaciais.” Rômulo Leão Silva Neris No início de 2020, ele era pesquisador visitante na Universidade da Califórnia, com bolsa Fulbright, concedida pelo governo americano. “Eu estudava chikungunya, meu vírus de interesse no doutorado”, diz. Estava nos EUA quando começou a ouvir notícias sobre um vírus respiratório que avançava no mundo. Acabou mudando o foco de seu estudo para a Covid-19 e se tornou uma voz importante na divulgação de informações relacionadas à pandemia. O lado comunicador de Rômulo ganhou força com um tweet em fevereiro de 2020, quando o Brasil registrou o primeiro caso confirmado da doença. “Compilei uma série de informações que poderiam ser relevantes para os brasileiros no enfrentamento ao coronavírus”, conta. “Minhas caixas de mensagem lotaram de gente querendo tirar dúvidas.” Hoje ele atua como pesquisador na Universidade Federal do Rio de Janeiro, estudando os mecanismos que levam o corpo a desenvolver imunidade contra o SARS-CoV-2 e as razões para complicações da doença. Também faz parte da equipe Halo, iniciativa da ONU que destaca cientistas no combate à pandemia. “Espero que no futuro eu possa contribuir para que o mundo dê respostas mais rápidas, mais precisas e menos letais para eventos pandêmicos”, diz. Carolina Utimura Carolina é CEO da Eureca, startup que atua na inclusão produtiva de jovens no mercado de trabalho. Também já foi delegada brasileira no Y20 2019 no Japão, fórum de juventude dos países do G20, e participou da fundação do Pacto da Juventude pelos ODS (Objetivos de Desenvolvimento Sustentável), que lançou o Atlas das Juventudes, com dados para embasar políticas públicas. Na Eureca, as ações passam tanto pela formação de candidatos a vagas de emprego como pela transformação do ambiente das empresas. “Conversamos com os líderes das organizações para quebrar filtros que não fazem mais sentido, como o de só ter aquelas top universidades”, diz. “Existem pesquisas que mostram que não há uma diferença de performance quando se treina bem dentro de casa. Acreditamos em trazer um arquétipo diferente de talento para os negócios. Pessoas que tiveram dificuldades, que muitas vezes precisaram trabalhar e deixar os estudos para mais tarde, têm uma sequência de competências que não são fáceis de desenvolver no mercado de trabalho.” Nina da Hora Quando se questionava sobre a própria carreira, a cientista da computação Nina da Hora começou a listar em um caderno as histórias de cientistas negros. A iniciativa acabou dando origem a um podcast, o Ogunhê. Também partiu de uma experiência pessoal o tema de seu projeto final na graduação em computação pela PUC-Rio em 2021: o racismo algorítmico. “É uma continuidade do racismo que já estrutura nossa sociedade, só que é potencializado por ferramentas computacionais.” Em 2017, o tema surgiu para Nina quando trabalhava em uma startup de robótica e, atuando em um projeto de reconhecimento de expressões faciais, percebeu que o sistema não funcionava com ela, única pessoa negra na equipe. Hoje Nina faz parte do conselho de segurança do TikTok Brasil e atua como divulgadora científica – e, como se autodenomina, como “hacker antirracista”. Amaral Medeiros “A educação transformou minha vida, e hoje eu empreendo na área para continuar esse impacto”, diz Amaral Medeiros, sócio fundador da ChatClass, que usa inteligência artificial para criar cursos no WhatsApp. “Minha avó limpava o banheiro da escola pública onde comecei, depois ganhei bolsa em escolas privadas de Goiânia. Com isso consegui entrar na Universidade de São Paulo para estudar engenharia mecatrônica.” Foi trabalhando com inovação no Instituto Ayrton Senna que veio o estalo para a criação da edtech. “Viajando pelo Brasil, notei que a tecnologia ainda não chegou às escolas, mas as pessoas nas escolas já tinham um celular com WhatsApp, Instagram e aplicativos de chat.” Acelerada por Google, Facebook e Endeavor, a ChatClass já atingiu 550 mil alunos desde 2019.   Alan Chusid O ano de 2021 consolidou o Pix como um dos meios de pagamento mais usados no país. Somente em novembro foram mais de 1,2 bilhão de transações. E o sucesso do Pix garantiu excelentes negócios para Alan Chusid, CEO e um dos fundadores da Spin Pay, fintech especializada em pagamentos instantâneos que disponibiliza suporte para compras via Pix no comércio eletrônico. Em agosto, ele vendeu a empresa para o Nubank e, apesar de os valores não terem sido revelados, a negociação foi uma das mais comentadas do ano, devido às possibilidades de crescimento e impacto no e-commerce. A Spin Pay foi fundada em 2019 por Chusid e os sócios Felipe Park e Marcelo Mingatos e ganhou projeção rapidamente atuando com mais de 200 varejistas entre lojas de departamento, eletrônicos e companhias aéreas. “Meu objetivo é transformar a experiência e a cadeia de pagamentos. Para isso há uma longa jornada pela frente, e a união com o Nubank permite que esse objetivo se torne mais próximo”, comenta o executivo, que também foi um dos fundadores do banco Neon, em 2015. Chusid começou a trabalhar cedo: já teve marca de óculos, restaurante, imobiliária e uma empresa de tecnologia até se apaixonar pelo mundo das fintechs, no qual desponta como um dos principais expoentes. Luana Lara A engenheira Luana Lara conseguiu a proeza de se destacar na lista Under 30 da Forbes USA – e agora também na do Brasil – ao fundar a plataforma de apostas Kalshi junto com o colega de MIT (Instituto de Tecnologia de Massachusetts) Tarek Mansour. A Kalshi movimentou US$ 10 milhões em apostas desde que foi lançada, em julho de 2021, e tem tanto potencial de crescimento que recebeu US$ 40 milhões em investimentos do fundo de capital de risco Sequoia e dos bilionários Charles Schwab e Henry Kravis. A ideia do negócio é interessante: assim como se faz com eventos esportivos, com a Kalshi é possível apostar sobre qualquer acontecimento, como “quantos norte-americanos tomarão vacina contra a Covid-19”, “se vai haver Carnaval no Rio este ano” e assim por diante. “Ainda estamos no comecinho da jornada. Os planos são transformar ‘event contracts’ em uma ferramenta de uso amplo onde qualquer um possa investir diretamente em um eventos, como fazem atualmente com ações e títulos”, explicou Luana, que pretende tornar os “event contracts” (apostas) em mainstream e construir um ecossistema inteiro ao redor deles. Antes de descobrir seu amor pelos números e pela matemática, Laura era uma criança apaixonada por balé – seu primeiro emprego foi como bailarina profissional em Salzburg, na Áustria. Daniela Miari Ele participa de campeonatos profissionais de kart desde os 8 anos de idade. Esse e outros esportes deram a ele disciplina e garra para vencer – características que, somadas à vontade precoce de empreender, duas faculdades simultâneas, uma boa ideia e amigos parceiros deram origem ao sucesso chamado Inco. Fundada em 2018 por Daniel e os sócios Bruno Patrus, Leonardo Belisário e Rafael Patrus, a Inco é uma fintech que atua no mercado de crowdfunding imobiliário. A ideia de arrecadar dinheiro do investidor comum – os aportes começam com R$ 500 – para aplicar em empreendimentos imobiliários, antes acessíveis apenas aos grandes investidores e fundos, ganhou mercado. No início de 2020 a fintech foi acelerada pelo C6 Bank e bateu recordes no segmento ao alcançar R$ 2 milhões em 15 minutos em uma rodada de crowdfunding. Desde a fundação, a Inco atraiu mais de 8 mil investidores, financiou mais de 100 projetos e contabiliza R$ 185 milhões transacionados. Thiago Waddington Achatz Thiago está construindo com os sócios João Pedro Thompson, Mateus Craveiro e Sophie Secaf um banco digital para a Geração Z (jovens nascidos entre 1995 e 2012) com a missão de ajudar os adolescentes a alcançarem a independência financeira sem percalços no meio do caminho. O projeto está em ritmo acelerado e tem recebido apoio de grandes aceleradoras. Com recursos de fundos como Maya Capital, Y Combinator, Homebrew, Kaszek e outros, a fintech Z1 aposta em educação financeira para jovens, um mercado potencial formado por 49 milhões de brasileiros que movimentam cerca de R$ 76 bilhões por ano mas que não têm dinheiro guardado (68% dos adolescentes) e nem R$ 200 poupados para uma emergência (55% deles). “Para mim, inovação e empreendedorismo significam mudança, avanço. É desafiar o status quo para transformar comportamentos”, afirma Thiago. Nesse sentido, a Z1 atua fortemente nas redes sociais – é o banco digital brasileiro mais seguido no TikTok. Vinícius Motta Nascido em Magé, na Baixada Fluminense, o engenheiro Vinícius Motta cresceu com o exemplo de empreendedorismo do pai, dono de uma pizzaria. A oportunidade de passar por boas escolas o ajudou a olhar a engenharia em uma perspectiva mais ampla. “Vi que o real problema do cliente não era projeto, não era terreno, era dinheiro”, afirma, explicando a origem da startup Minha Casa Financiada, uma espécie de marketplace que conecta pessoas interessadas em construir sua casa própria a construtores profissionais e linhas de financiamento para a obra. Junto com o sócio Diego Carielo, Motta calcula ter viabilizado R$ 1,67 bilhão em créditos para aquisição de terrenos e construção de casas e, em menos de dois anos de operação, faturou R$ 27 milhões. Mario de Lara Ele tinha 28 anos quando montou com o sócio Lucas de Lima a Caravela Capital, uma gestora de venture capital focada em empresas tecnológicas ainda no estágio inicial. Em dois anos, a empresa soma R$ 200 milhões sob gestão e investimentos em 48 projetos que saíram do papel – como Fazenda Futuro (carnes vegetais), Mottu (aluguel de motos), Caju (benefícios) e Logcomex (big data para comércio exterior), entre outras. Mario acredita que apoiar o empreendedorismo no Brasil é a melhor forma de melhorar o país. “Boas ideias são importantes, mas a execução é o que interessa. E nosso papel é ajudar o empreendedor nessa jornada.”, afirma. Vindo de uma família de empreendedores, ele foi daquelas crianças que vendiam balas para os colegas no intervalo da escola.   Filipe Soares Ele foi criado em um bairro periférico de Limeira, no interior de São Paulo, e desde cedo se dedicou de forma intensa ao trabalho e aos estudos. Vendeu doces pelas ruas da cidade, foi garçom e pizzaiolo. Em 2014 entrou na faculdade Unimep, em Santa Bárbara d’Oeste, para cursar engenharia química. Tornou-se especialista em processos cítricos e gestão empresarial. Aos 22 anos, era o gerente industrial mais jovem de uma indústria cítrica, com 290 funcionários. E já impressionava por seu conhecimento da área.  Aos 25 anos abriu sua primeira empresa, a JFO Citrus, e ganhou espaço – inclusive fora do país – como consultor. Logo de saída, suas dicas de processos lhe renderam um faturamento de R$ 1,5 milhão. Filipe investiu então em sua própria linha de pesquisa, desenvolvendo produtos naturais de alto valor agregado usando a casca de laranja e resíduos das fábricas de suco para criar outros processos alimentícios e fibras prebióticas. Em janeiro de 2021, apresentou seu processo para a KR Capital, grupo de investidores especializado em estruturar negócios. Juntos construíram o projeto Fiber Citrus, com a proposta de desenvolver uma linha de produtos de fibras funcionais com propriedades espessantes, emulsificantes e nutritivas com aplicações em panificações, carnes ou substitutos e bebidas, entre outros segmentos da indústria alimentícia. A planta da Fiber Citrus está em construção “no coração” do estado de São Paulo, região conhecida pela grande produção de laranjas, e fica pronta em setembro de 2022. Deve gerar R$ 100 milhões em receitas anuais.  “A indústria alimentícia continuará a crescer pela própria demanda de mercado”, diz o jovem empresário. “Mas as inovações necessárias para acompanhar as exigências ecológicas, de conservação de energia e de funcionalidade serão fundamentais nos próximos anos. Nosso projeto, além de atender esses princípios, também se dedicou a construir produtos para que nossos clientes possam ter o chamado ‘rótulo limpo’ ou ‘clean lable’”,finaliza. Tyler Eldridge Nascido nos EUA e residente no Brasil, Tyler Eldridge formou-se na Universidade de Georgetown (Washington DC) e veio para cá definitivamente aos 26 anos para desenvolver projetos no setor de energia solar. Criou a empresa Brasol, hoje uma referência no mercado de energia limpa. Ty Eldridge, como é conhecido, atua no segmento de energia solar em 13 países. Suas operações movimentaram cerca de US$ 1 bilhão. Em 2020, a alemã Siemens adquiriu uma participação minoritária da Brasol com um dos maiores investimentos estrangeiros diretos do setor. O empresário lidera um projeto social para levar energia limpa a comunidades carentes. Luiz Felipe Hernandez Junto com o irmão, Ruy, Luiz Felipe atuou por mais de dez anos no setor de empreendimentos imobiliários, administrando a carteira de imóveis da família em Brasília, até criar, em 2018, a empresa Lótus, que tem faturamento anual estimado em R$ 310 milhões. A Lótus cresceu rapidamente “graças à inovação, design e agilidade na entrega dos empreendimentos”, com financiamento 100% próprio, em Brasília e em Miami. A empresa alcançou, nos últimos três anos, um faturamento de R$ 792 milhões. O VGV (Valor Geral de Vendas) desde a fundação da Lótus é de R$ 3,1 bilhões. Em 2021, a empresa vendeu um prédio em Brasília para a sede do Banco Mundial. André Albuquerque A Suplax, empresa do jovem André, produz itens nutracêuticos, suplementos e alimentos com foco na terceirização de produtos saudáveis para grandes marcas. O faturamento estimado é de R$ 120 milhões. Antes de abrir a Suplax, em 2017, ele teve empresas nos EUA e na Índia, onde adquiriu experiência no setor de alimentação saudável e na terceirização da produção. Sua empresa tem 140 funcionários em uma fábrica de 22 mil metros quadrados em São Paulo. William Sorensen O engenheiro formado pela USP William Sorensen abriu a SWA Reality em 2014. Depois de passar a infância como um garoto de classe média baixa no Jardim Peri, na nZona Norte de São Paulo, hoje ele desfruta o faturamento anual de R$ 52 milhões. Sua empresa conta com 70 funcionários diretos e, segundo o empreendedor, “se destaca pela criatividade no processo de desenvolvimento dos projetos que reduzem os prazos de entrega e aumentam as margens de lucro”. Otimista, William projeta um crescimento de 80% nos próximos três anos.   João Gomes A ascensão do cantor e compositor João Gomes à fama foi meteórica. Em maio de 2021, entrou pela primeira vez em um estúdio de gravação. Na semana seguinte, lançou seu disco de estreia. Ele é o exemplo vivo do poder das redes sociais – mais recentemente, do TikTok – para alçar nomes ao sucesso. Natural de Serrita, cidade do sertão pernambucano com menos de 20 mil habitantes, Gomes é filho de uma agricultora e de um vaqueiro e se descobriu cantor no coral da igreja, aos 7 anos. Mesmo tímido, começou a gravar vídeos cantando em festas de amigos e nos intervalos das aulas do Instituto Federal de Pernambuco, onde fazia curso técnico em agropecuária. Acreditava que seu destino era o campo até que viralizou nas redes com sua voz grave, suas letras de amor e a batida do piseiro, gênero musical derivado do forró. Em menos de um ano, tornou-se o artista mais ouvido do país, emplacou hit nas paradas globais do Spotify – onde tem quase 7 milhões de ouvintes mensais – e seu primeiro sucesso, “Meu Pedaço de Pecado”, já ultrapassou a marca de 166 milhões de plays. Priscilla Alcantara Priscilla começou a carreira ainda na infância, aos 2 anos, cantando na igreja que frequentava com os pais. Aos 9, sua desenvoltura a garantiu vaga como apresentadora do “Bom Dia & Cia”, programa infantil do SBT que comandou por oito anos, ganhando reconhecimento nacional. Mas a música sempre falou mais alto: aos 19, assinou contrato com a Sony Music como cantora gospel e chamou atenção por trazer uma sonoridade mais pop ao gênero. Em 2018, conquistou uma indicação ao Grammy Latino pelo álbum “Gente”. Em 2021, Priscilla ganhou nova projeção nacional ao participar da primeira edição brasileira do reality competitivo “The Masked Singer”, da Rede Globo. Fantasiada de unicórnio, ela foi a grande vencedora do programa. Para coroar a vitória, ela lançou seu primeiro disco fora do segmento gospel, “Você Aprendeu A Amar?”. No Spotify, acumula 1,4 milhão de ouvintes mensais. No Instagram, é acompanhada por mais de 6 milhões de seguidores. Any Gabrielly Talvez você não saiba quem seja Any Gabrielly, mas se tiver crianças e adolescentes na família, é bem possível que eles a adorem. Ela é a representante brasileira do megagrupo pop Now United, formado em 2017 pelo produtor britânico Simon Fuller (criador das Spice Girls) com 18 integrantes. A jovem artista, que iniciou a carreira aos 8 anos, já acumula conquistas importantes no currículo: deu voz à personagem Moana, da Disney, e interpretou a leoa Nala na versão brasileira do musical da Broadway “O Rei Leão”. Ela retornou às cabines de dublagem para dar vida a Nooshy na animação “Sing 2”, que chega aos cinemas brasileiros em janeiro de 2022. Na sequência, entrará em turnê internacional com o Now United, com passagens pelos EUA, Rússia e Portugal, além do Brasil, onde os ingressos esgotaram em 24 horas. Any também é uma sensação na internet, com mais de 6 milhões de seguidores no Instagram e 9 milhões no TikTok. Marina Sena “Eu não nasci, eu estreei”, escreveu Marina Sena na legenda de uma foto do Instagram. Natural de Taiobeiras, cidade mineira com pouco mais de 30 mil habitantes, ela conta que era vista (e se sentia) como a doidinha da região até entender que era artista. Após integrar as bandas A Outra Banda da Lua, onde diz ter aprendido a ser artista, e Rosa Neon, que fez barulho na cena indie brasileira, ela partiu para a carreira solo durante a pandemia com o lançamento do disco “De Primeira”, em agosto. O projeto ganhou certificado de platina pelas mais de 28 milhões de execuções nas plataformas digitais e arrancou elogios da crítica, despontando como um dos melhores discos do ano. Marina é um dos expoentes do pop alternativo, fazendo uma versão moderna da MPB, e conseguiu furar a bolha do mainstream brasileiro, tomado por artistas de funk, sertanejo e piseiro. Com o desejo de ser internacional, exportando sua “brasilidade formada por tudo o que ouvia no rádio, de Gal Costa a Anitta”, ela emplacou o hit “Por Supuesto” na liderança da lista Top Viral Global do Spotify. Agnes Nunes A música entrou para a vida de Agnes Nunes aos 12 anos de idade, quando ela passou a utilizá-la como válvula de escape para o bullying que sofria na escola: suas primeiras composições nasceram de poemas, forma que encontrava para desabafar. Ela aprendeu a cantar e a tocar teclado sozinha, reproduzindo músicas de outros artistas. E começou a chamar atenção quando publicou seus covers nas redes sociais, recebendo elogios de Caetano Veloso e Elza Soares – ela chegou a dividir o palco com Elza e Seu Jorge em 2020, mesmo ano em que seu primeiro EP, “Romaria”, foi lançado pela Baguá Records em parceria com a Universal Music. Com 1,3 milhão de ouvintes mensais no Spotify, a jovem pretende lançar seu álbum de estreia no primeiro semestre de 2022. Marcelo Rodrigues Natural de Codó, cidade no interior do Maranhão, o músico se mudou com a família para São Paulo ainda na infância, em busca de melhores condições de vida. Conheceu e se apaixonou pelo contrabaixo acústico aos 13 anos, quando participou de um projeto social do Instituto GPA, em Osasco, região metropolitana paulistana. Entre 2018 e 2021, integrou a Orquestra Jovem do Estado de São Paulo e leva no currículo apresentações em países como Estados Unidos, França e Argentina. Em setembro de 2021, mudou-se para Manchester, Inglaterra, após conquistar bolsa de estudos para cursar o bacharelado em Música da Royal Northern College of Music, conceituada instituição que recebe o selo da Realeza Britânica.   Leonardo Zanatta A mãe professora e o pai agricultor fizeram o pequeno Leonardo zanzar um bocado: nasceu em Nonoai (noroeste do Rio Grande do Sul), depois foi para o Mato Grosso, Pará e retornou ao Sul. “Essas idas e vindas me ajudaram a conhecer realidades fora dos grandes centros. Desde criança, sempre fui bastante curioso. O desejo pela arquitetura, no entanto, nasceu do fascínio de materializar coisas que só existiam na minha cabeça.” Como referências atuais, ele cita: Iris Van Herpen, Dieter Rams e Virgil Abloh. Ele tem o próprio ateliê de mobiliário (ELZ_DSGN) desde 2020 e é o arquiteto à frente do núcleo de design do escritório Arquitetura Nacional. “O papel do arquiteto não se resume ao aspecto estético e funcional: a gente precisa de forma urgente questionar como estamos construindo. A construção civil se acostumou a consumir de maneira ilimitada, e isso não é sustentável.” Leonardo já foi laureado por três vezes no Prêmio Saint-Gobain de Arquitetura e tem cerca de 20 premiações e menções nacionais e internacionais em arquitetura e design industrial. Vitor Daher “A demanda é cada vez maior de gente que nos procura em busca de uma casa o mais sustentável possível, de preferência com pegada de carbono negativa”, conta Vitor, diretor fundador do Estúdio Ubuntu, do setor de incorporação, com soluções de arquitetura especializada em sustentabilidade e compromisso bioclimático. De origem africana, a palavra “ubuntu” significa união: “Eu sou porque nós somos”, resume, sobre o escritório que em 2021 fechou 12 grandes projetos. Vitor ficou em dúvida entre direito e medicina – e se formou em arquitetura no Mackenzie, com extensão na Universidad Politécnica de Madrid. Paulistano da Barra Funda, libanês por parte de pai e italiano da mãe, ele também fundou e dirige a Muda Social, organização do terceiro setor que conduz grandes marcas a reverterem parte dos impostos em ações ESG, requalificando espaços públicos. Em 2021, teve três projetos premiados na 2ª edição do guia IAB (Agenda 2030 ONU de Objetivos de Desenvolvimento Sustentável). Leandro Assis Conhecido com Lebassis, atua como artista de lettering, tendo como principais referências Keith Haring, Kaws, Virgil Abloh e Nina Chanel, além de Aries Moross, do Studio Moross, para quem assinou criações para a Ru Paul’s Drag Race. Carioca nascido na comunidade de Catrambi (Tijuca), Leandro cresceu no quintal cheio de primos. Foi a primeira geração que teve chance de ir para a faculdade (Design, com ênfase em marketing na ESPM) após o sucesso do Beleza Natural, salão aberto pela tia Zica Assis. No mercado internacional desde 2019, fez trabalhos para Apple, Google, Netflix, Facebook, Twitter e Amazon. Já foi premiado três vezes pelo Latin American Design Award, além do Young Guns, ADC Awards e D&AD. Casado com o designer Wendel Amorim, Leandro mudou-se para São Paulo em dezembro e planeja lançar livro de stickers em 2022. Marcelo Caruso Paulistano radicado em Curitiba, Marcelo fabrica móveis de madeira desde 2018, tendo Sergio Rodrigues (1927-2014) como sua principal referência. “As peças dele têm personalidade própria, como se contassem uma história, e eu tenho isso também”, conta o marceneiro. Seu primeiro interesse na faculdade era desenho automotivo, mas se desencantou e acabou abraçando a criação mobiliária. Terminou o curso com mais de 100 peças desenhadas, quando entrou para estagiar no ateliê de Rodrigo Silveira (da marca Rodrigo Que Fez), onde passou dois anos aprimorando técnicas tradicionais em madeira maciça, acabamento primoroso e encaixes sem ferragem ou parafuso. Privilegiando o uso de madeiras como tauari, Marcelo assina peças como a Banqueta Pedrita, a Cadeira Violeta e a Poltrona Beta. “De 2019 pra cá, a gente mais que dobrou a produção.” Naiara Bogo Mal o dia tinha amanhecido e Naiara já estava em pé, ao lado do pai Amarildo, arrumando as tralhas para sair de Indaial (SC) rumo ao litoral. Programa: pescar em Balneário Camboriú. “Adorava ver os barcos, mas a gente não tinha dinheiro pra isso, e pescava no meio das pedras”, recorda a designer de interior náutico da Azimut Yachts Brasil desde os seus 20 anos, hoje vivendo em Itajaí. Naiara começou a trabalhar aos 14 anos, com recursos humanos. Sem poder pagar uma faculdade de arquitetura, migrou para design de interiores na Univali (SC). Entrou em uma empresa que fornecia material de decoração para a Azimut – e logo recebeu uma proposta do estaleiro. “Nunca vou esquecer quando vi de perto, em Viareggio, o galpão dos megaiates. Passei um mês na matriz para finalizar um barco de 88 pés de clientes brasileiros.” Na folga, adora beach tennis, tocar piano e ler. “Mas meu sonho era ser jogadora de vôlei.” Douglas Lopes Foi analisando capas de discos de hip hop norte-americanos e como a pele negra é iluminada no filme “Moonlight” e na série “Insecure” que esse paulista de Itu se inspirou para desenhar a ilustração de capa do especial Afrofuturo, publicado pela Forbes em junho de 2021. O trabalho rendeu a ele o Brasil Design Award (categoria Craft for Design), entre 1.600 projetos inscritos. Douglas (hospedado em darkstream.cc) cursou publicidade na UFPR, em Curitiba e, como trabalho de conclusão, fez a HQ “Existe Outro Caminho” sobre a história do rap nacional e que compôs a short list do Troféu HQ Mix 2020. Trabalhando com ilustração desde 2017, ele faz HQ desde os 8 anos, quando vendia seus trabalhos para amigos de escolas pelo preço da tarifa de ônibus (na época, R$ 1,50).   Rebeca Andrade Tirar carteira de motorista e começar a faculdade de Psicologia. São essas as metas da ginasta paulista, de Guarulhos, que encantou o mundo com a coreografia ao som de “Baile de Favela” nos Jogos de Tóquio. Não satisfeita em conquistar uma medalha olímpica inédita para a ginástica artística feminina do Brasil, Rebeca foi logo trazendo duas: ouro no salto e prata no individual geral. O desempenho ímpar a catapultou à posição de porta-bandeira da delegação brasileira na cerimônia de encerramento. No Campeonato Mundial de 2021, em Kitakyushu, também no Japão, Rebeca repetiu a dose e se tornou a primeira brasileira a conquistar mais de uma medalha em um campeonato mundial de ginástica artística: ouro no salto e prata nas barras assimétricas. “Uma medalha olímpica é resultado de muito trabalho, e não apenas o meu. Nessas medalhas há um pedacinho de muita gente: de toda a minha equipe, da minha família, dos fãs e de todo mundo que torceu por mim. Estou muito feliz, vivendo um momento bastante especial.” Ana Marcela Cunha Quem assistiu à final olímpica da maratona aquática em Tóquio deve ter ficado sem ar, tamanho o equilíbrio e a troca de liderança durante os 10 quilômetros da prova. Só a partir dos 8,6 quilômetros que a baiana de Salvador assumiu a ponta e acelerou para vencer com 1h59min30seg08, pouco mais de um segundo à frente da campeã olímpica no Rio, a holandesa Sharon Van Rouwendal. Assim, trouxe o ouro inédito para o Brasil e colocou um ponto final no trauma acumulado nas três olimpíadas anteriores (5º lugar em Pequim-2008; fora de Londres-2012 e 10º no Rio-2016, quando havia grande expectativa por medalha). Detentora de cinco ouros em campeonatos mundiais e ouro no Panamericano de 2019 (Lima), Ana Marcela desabafou com um “finalmente!” após sair vitoriosa da água no Odaiba Marine Park e dedicar o título à namorada Maria Clara Fontoura. “As coisas acontecem na hora certa. Cada metro da prova estava planejado e treinado à exaustão. Agora é continuar batalhando. Paris 2024 é logo ali”. Mariana D’Andrea Depois do ouro nos Jogos Parapan-americanos de Lima (Peru) e do vice-campeonato mundial em Nur-Sultan (Cazaquistão), ambos em 2019, era grande a expectativa para um bom resultado da paulista de Itu no halterofilismo dos Jogos Paralímpicos de Tóquio. E a promessa se confirmou em uma medalha de ouro inédita para o Brasil: Mariana levantou 137 kg na categoria até 73 kg para atletas com deficiência nos membros inferiores e/ou paralisia cerebral. Ela começou com 130 kg, depois passou na segunda tentativa por 133 kg e arrematou o topo do pódio ao levantar 137 kg. A chinesa Xu Lili ainda tentou superar 138, mas não conseguiu. Mariana competiu na Rio-2016 só com um ano na modalidade – entre os dois ciclos, ficou fora de apenas dois pódios em 12 competições internacionais. Matheus Cunha Jamais esse paraibano de João Pessoa vai esquecer o ano de 2021. A começar pela glória de marcar um gol na final do futebol em Yokohama: o Brasil bateu a Espanha por 2 a 1 e chegou ao bicampeonato olímpico. “Sem dúvida, uma conquista que ficará eternizada na minha vida”, diz o atacante que, em agosto, foi comprado pelo Atlético de Madrid por 30 milhões de euros do Hertha Berlim. Antes disso, jogou no RB Leipzig (em 2019, concorreu ao Prêmio Púskas – gol mais bonito –, graças ao tento anotado contra o Bayer Leverkusen), e no Sion, da Suíça. No início de dezembro, outro momento inesquecível: vitória por 3 a 1 fora de casa, sobre o Benfica, e a classificação para as oitavas de final da Champions League. Com uma carreira iniciada no CT Barão, em Recife, e fã de Ronaldinho Gaúcho, Matheus tem como principal objetivo em 2022 a disputa da Copa do Mundo do Qatar. “Quero me firmar cada vez mais na seleção principal.” Herbert Conceição Após os dois primeiros rounds da decisão do ouro da categoria peso-médio (69 kg a 75 kg), Hebert já sabia: ou ele vencia por nocaute ou teria que se com a prata. Afinal, era unânime que o boxeador ucraniano Oleksandr Khyzhniak, bicampeão europeu, campeão mundial de peso-médio e invicto havia 62 lutas, tinha levado por pontos os dois primeiros assaltos da finalíssima nos Jogos de Tóquio. A um minuto e meio do fim, veio o golpe de esquerda que levou Oleksandr à lona. Pupilo do treinador Luiz Dórea, que forjou pugilistas de ponta como Acelino Popó Freitas, Hebert já havia chamado a atenção na comemoração da vitória nas quartas, que lhe garantiu o bronze. Ao vencer o favorito cazaque Abilkhan Amankul, gritou a plenos pulmões: “É Brasil, é Bahia, é Salvador!”. Rayssa Leal Foi “na brincadeira” que Rayssa levou a prata no skate street em Tóquio. “No campeonato, estou com minhas amigas, é um momento divertido para mim, fico confortável, uma incentiva a outra a acertar”, explica a Fadinha, sensação mundial da modalidade. “E tem a minha mãe, que sempre me ajuda, falando quais manobras eu preciso. Aí eu respiro fundo… e pronto!” Com a mesma manobra da prata na última Olimpíada (flip no corrimão), Rayssa venceu a atual campeã mundial, Pâmela Rosa, no início de dezembro no Oi STU Open. A maranhense de Imperatriz recebeu da Confederação Brasileia de Skate o prêmio de melhor skatista do ano. Em 2022, ela vai estrear como atriz na série “Tá Tudo Certo”, na Disney+. “A principal dica é não desistir dos seus sonhos.” Yeltsin Jacques Os Jogos Paralímpicos de Tóquio 2020 foram marcantes para o Brasil por vários motivos. A começar pelo recorde de ouros (22), superando os 21 de Londres (sendo o atletismo a modalidade mais “dourada”, com oito topos de pódio). E também por alcançarmos a 100ª medalha de ouro do país. Foi Yeltsin quem grafou seu nome nessa página da história. “A medalha de ouro nos 5.000 metros T11 foi a primeira da equipe no Japão e o ouro dos 1.500 metros T11 foi a centésima do país, com recorde mundial”, lembra o sul-mato-grossense de Campo Grande, que pratica atletismo há 15 anos. “Nasci com uma patologia chamada amaurose congênita de Leber, que me trouxe a baixa visão. Desde cedo, meus pais me incentivaram para a prática esportiva. Eu treinava judô quando um colega totalmente cego me pediu para ajudá-lo nos treinos de corrida. Foi assim que comecei – e logo consegui bons resultados”, comenta o bicampeão parapan-americano (Toronto-2015 e Lima-2019) e vice-campeão mundial (Paris-2103). “O foco agora é trazer o tri no Parapan de Santiago, em 2023.” Kelvin Hoefler Paulista de Itanhaém, Kelvin chegou a Tóquio na quarta colocação no ranking mundial. E voltou dos Jogos Olímpicos com a prata no skate street. A prática da modalidade começou aos 8 anos, em uma pista improvisada, no quintal de casa, no Guarujá. Antes disso, infernizava os pais, da cozinha para a garagem, passando na frente da televisão. Campeão mundial de street em Chicago (2015) e vice no Rio de Janeiro (2018), ele acredita que foco foi tudo para conseguir a medalha em Tóquio. “Viemos de um adiamento dos Jogos e da incerteza se seria possível sua realização”, lembra o skatista que gosta de jogar videogame, viajar de trailer e construir rampas de skate. “Quero evoluir meu skate e me preparar bem para Paris 2024 – as qualificações já começam no meio de 2022.” Alison dos Santos Não foi “só” um bronze na Olimpíada de Tóquio – foi a terceira melhor marca da história dos 400 metros com barreiras: os três primeiros colocados pulverizaram o recorde mundial de Kevin Young, registrado em Barcelona (1992). Piu, como é conhecido o paulista de São Joaquim da Barra, cravou 46s72, o novo recorde sul-americano. Vencedor da prova, o norueguês Karsten Warholm marcou o novo recorde mundial, com 45s94, sendo o primeiro a baixar os 46 segundos na prova. “Foi emocionante, foi único, foi especial. A oportunidade de viver nessa época, de presenciar e fazer parte do momento mais forte da história da prova”, celebra Piu. Para 2022, o atleta, que em 2019 conquistou o ouro no Pan de Lima com 48s45, quer ser ainda mais rápido. Alguém duvida? Laura Pigossi A primeira medalha olímpica para o tênis brasileiro na história dos Jogos veio de forma inesperada – duplamente. Primeiro porque as paulistanas Luisa e Laura foram chamadas para Tóquio a uma semana da estreia. Segundo porque, na disputa do bronze contra as russas, elas tiveram que salvar quatro match points. “Sinceramente, eu não achava iríamos aos Jogos, nem sabia que estava inscrita. Fiquei sem chão ao saber que ia; ria e chorava ao mesmo tempo”, confessa Laura. “Eu tinha fé”, rebate Luisa. “Receber a notícia foi êxtase total.” Para virar o jogo no final, ela diz que foi fundamental o “sangue frio” e “sentimento de flow, de estar presente e jogar com garra”. Em novembro, Luisa ficou no top 10 do ranking de duplas da WTA, feito atingido por apenas seis brasileiros até hoje. Tamara Klink Ser filha do navegador Amyr Klink e da fotógrafa Marina Bandeira Klink ajudou a povoar a imaginação de Tamara Klink com mares sem fim, icebergs, baleias e pinguins. Também a levou para viagens em família em lugares pouco usuais, como a Antártida. Mas a paulistana quer escrever as próprias linhas na história da navegação. Em novembro de 2021, concluiu a travessia do Atlântico em solitário, no Sardinha, um barco de 8 metros, após três meses de calmarias e tempestades – e depois de muita preparação para zarpar, sem o apoio dos pais. “Eles se recusaram a ajudar. Disseram que eu deveria ir atrás dos meus próprios recursos. Sou grata pelos nãos. Precisava me descobrir capaz de tomar minhas próprias decisões, porque meus pais não estariam comigo no meio do mar.” Em dezembro, ela estava no porto de Lorient, na França, pesquisando a próxima missão. “Estou me organizando para fazer travessias mais longas. É parte de um projeto de vida, de navegar em lugares extremos.”   Isabella Scherer Antes de participar do “MasterChef 2021”, Isabella Scherer achava que não seria levada a sério como cozinheira. Até então, a filha do ex-nadador Fernando Scherer (o Xuxa) era mais conhecida como atriz, tendo estreado na TV aberta em “Malhação”, da Globo. Também se dedicava à moda, com a marca Serê. Mas a cozinha era um interesse de Isabella desde a infância, quando acompanhava a mãe, Vanessa Medeiros, no preparo das refeições da casa. Desde os 16 anos, cozinhava por conta própria. “No começo, o que eu mais gostava de fazer eram curries, comida indiana”, diz. “Hoje são molhos e carnes de longa cocção.” Aparecer no reality show da Band foi um jeito de entrar publicamente no território da gastronomia – e Isabella avançou a passos largos, vencendo a competição com um prato vegano, virando trending topic no Twitter e recebendo elogios dos jurados. Atualmente, compartilha conteúdos de comida com 1,2 milhão de seguidores no Instagram e se prepara para viver o dia a dia de um restaurante: “Pedi um estágio para a Helena Rizzo [jurada do “MasterChef” e chef do Maní] e ela me aceitou.” Leticia Cruz Na infância, em Bangu, no Rio, Leticia gostava de fazer bolos quando a família se reunia. Na hora de escolher uma profissão, optou pela confeitaria. E já foi longe. Em janeiro de 2019, representou o Brasil na Coupe du Monde de la Pâtisserie em Lyon, na França, depois de vencer a etapa brasileira da competição. Sua sobremesa vitoriosa: mousse de cumaru, centro de maracujá, cubos de manga e alecrim, cremoso de chocolate ao leite e crumble de castanha-do-pará. Para chegar lá, Leticia estudou gastronomia na Anhembi-Morumbi, em São Paulo, e fez especialização em confeitaria em Buenos Aires. Trabalhou na Pâtisserie Douce France, na capital paulistana, e, no Rio, nos Sofitel Copacabana e Ipanema – neste tornou-se chef-confeiteira. Assumiu a mesma posição no Fairmont Copacabana em julho de 2019 e ficou lá até agosto de 2021. Partiu então para Lucerna, na Suíça, emendando seis meses de curso na Culinary Arts Academy com um estágio no hotel de luxo Bürgenstock. “Não foi uma decisão fácil [deixar o Fairmont], mas enxerguei como um passo importante para uma carreira internacional.” Geraldo Maia O engenheiro de produção Geraldo Maia é cofundador e CEO da Pink Farms, fazenda vertical urbana que começou em 2016 com testes em uma espécie de frigobar no apartamento de um dos sócios e hoje ocupa um galpão na Vila Leopoldina, em São Paulo. A empresa fornece hortaliças prontas para o consumo em 110 pontos de venda, atendendo restaurantes e supermercados de São Paulo, como Carrefour, Pão de Açúcar e Natural da Terra. O plantio em estruturas verticais, com iluminação artificial em ambiente fechado, traz ganhos em produtividade. “Ela é 170 vezes maior do que no cultivo tradicional”, diz Maia. O ambiente controlado também reduz o consumo de insumos, diminui as perdas e permite cultivar produtos de diferentes climas. “O plano é ter 400 SKUs nos próximos cinco anos.” Em 2022, deve ser construída uma nova unidade que vai multiplicar a capacidade de produção, hoje em três toneladas por mês. “Queremos chegar a 1.200 toneladas por ano.” Carolina Neugebauer Nascida na família que fundou a primeira fábrica de chocolate do Brasil, a Neugebauer, Carolina, CEO da Cacau Noir, brinca que não teve escapatória: foi para o ramo de chocolate também. Começou na adolescência, na loja da mãe em Porto Alegre. “Depois fui trabalhar com o meu pai na Harald, a antiga empresa dele, e lá passei por todas as áreas”, conta. Quando a família adquiriu a Cacau Noir, ela se ofereceu para cuidar da operação. “Era uma rede de quatro lojas de shopping, hoje tem 20 e um plano de expansão de franquias grande: em 2022, a previsão conservadora é abrir mais 40 franquias.” Também foram iniciadas vendas em supermercados como Pão de Açúcar e St Marche. A receita foi de R$ 7,2 milhões, em 2020, para R$ 17 milhões, em 2021. “A gente está em um processo de deixar o produto mais democrático e a marca, mais escalável”, diz. “Quando eu entrei, a Cacau Noir queria transformar o chocolate em uma joia, a intenção era ser uma Louis Vuitton do chocolate. Mas tenho o sonho de levar um chocolate de qualidade para todo mundo.” Bruno Sindicic Bruno Sindicic trabalhava no mercado financeiro quando resolveu empreender em um negócio que tinha a ver com um gosto pessoal: em 2016, com duas sócias, criou a Olga Ri, foodtech de entrega de comida saudável. “Sempre fui apaixonado por salada”, conta. “Além disso, por trabalhar com investimentos, eu analisava os setores de uma perspectiva financeira, estratégica, e o de alimentação me chamava muita atenção.” Em 2019, a empresa fez a primeira rodada de investimentos, liderada pela Kaszek e com participação da Arbor Capital; em 2020, houve um novo aporte, com investidores como o cineasta Fernando Meirelles e Patrice Etlin, managing partner da Advent International. Hoje a Olga Ri opera cinco dark kitchens em São Paulo, com 165 funcionários, e atende mais de 10 mil clientes ao mês. Faturou R$ 10 milhões em 2020 e previa fechar 2021 em R$ 21 milhões.   Beatriz Mansberger Fundadora do Chef Aprendiz, Beatriz Mansberger não é cozinheira, mas encontrou na gastronomia um meio para melhorar a vida de jovens em situação de vulnerabilidade. O projeto surgiu em 2014 quando, estudante de gestão de políticas públicas na USP, ela ouviu de moradores de Paraisópolis a sugestão de criar um “MasterChef Paraisópolis”. “Falei que MasterChef não ia rolar, mas a gente poderia fazer uma competição com um processo de aprendizagem significativo independentemente da carreira que a pessoa escolhesse seguir”, lembra. Já foram nove edições, em diferentes comunidades. Em cada uma, um grupo é selecionado para cinco meses de oficinas que preparam para o mercado de trabalho, mas também focam no desenvolvimento emocional. No fim, há uma competição, acompanhada por chefs que julgam os pratos e empregam os cozinheiros em lugares como Palácio Tangará, Emiliano e Tartuferia San Paolo.   Levis Novaes O publicitário Levis Novaes é diretor de estratégia e um dos fundadores da Mooc, ou Movimento Observador Criativo. A agência e produtora audiovisual surgiu em 2015 como um coletivo de criadores negros e hoje trabalha com marcas globais como Netflix, Budweiser e Nike. Faz parte do ecossistema da Flagcx, que tem entre suas unidades de negócio Cubocc, Soko e Obvious e foi indicada ao Prêmio Caboré 2021 na categoria Serviços de Marketing.  Entre os cases recentes, Levis destaca trabalhos com a Meta (ex-Facebook) no programa Ads for Equality, atuando com empresas como L’Oréal; a campanha #NaMinhaPelePreta, parceria com o TikTok; e a ação Caras & Cores, em que a Faber-Castell lançou lápis com diferentes tons de pele. “A Mooc acabou se tornando uma das maiores referências criativas do Brasil em termos de negócios desenvolvidos por pessoas pretas, e isso para a gente é surreal”, diz o publicitário. “Ela atua como um decodificador. Hoje uma das principais coisas que a gente faz é localizar em qual território a marca está falando e como atuar de forma autêntica.” Bernardo Mendes Ele não jogava videogame quando criança, mas acabou se tornando cofundador da Druid Creative Gaming, agência que conecta marcas ao universo gamer. O caminho de Bernardo no segmento começou quando trabalhava para a agência MCI e esta fez uma joint venture com a produtora de esportes eletrônicos ESL. A partir de 2016, ele atuou no desenvolvimento da nova empresa no Brasil, com ações como o lançamento de conteúdos gamers para a TV, nos canais ESPN e SporTV. Só então comprou seu primeiro videogame, um XBox One.  Em 2019, participou da criação do núcleo de games da agência Cheil Brasil. Um exemplo de projeto com o jogo Fortnite, da Epic Games: “A gente fez um mapa de aniversário, patrocinado pela Hasbro, para que as crianças, logo no início da pandemia, pudessem comemorar com os amigos”. A Epic Games foi o primeiro cliente da Druid, lançada em janeiro de 2021. “Logo de cara a gente fez campanha do Pelé e do Neymar dentro do Fortnite”, conta. Outros clientes vieram, como Itaú e B2W. “Fechamos o ano com R$ 43 milhões de faturamento”, diz Bernardo. Julio Beltrão Julio entrou na Mynd, agência especializada em marketing de influência e entretenimento, em janeiro de 2020. No mesmo ano, em novembro, criou o Black Squad, time de criadores negros que hoje lidera. Como head artístico, ele é responsável por 35 agenciados fixos, incluindo nomes que somam milhões de seguidores nas redes, como Camilla de Lucas, Tia Má, Yuri Marçal, João Pedrosa e Gil do Vigor – este último já contou à Forbes que, desde o fim do BBB, faturou mais de R$ 15 milhões em campanhas para empresas, entre elas Santander e Vigor. Com o Black Squad, Julio quer não só aumentar a presença de negros na publicidade, mas expandir a atuação deles para além de temas relacionados a negritude e racismo. “Não tem preço, fazer esse aquilombamento digital de pessoas e, principalmente, fazer com que elas entendam que podem falar de outras coisas e que vão trabalhar o ano todo e não só em novembro [mês da Consciência Negra].” Em 2021, o jovem talento também liderou o prêmio Potências!, que homenageou personalidades como Gilberto Gil e Mano Brown e teve shows de Preta Gil e Negra Li, entre outros. Dener Lippert de Almeida Aos 17 anos, quando criou a V4 Company com a ideia de fazer comunicação digital para empresas, Dener Lippert de Almeida era estagiário da área comercial de uma indústria e tinha na bagagem a organização de festas e excursões divulgadas via Orkut e MSN Messenger. Começou operando na cozinha da mãe, em Canoas (RS).  Em 2017, já com sede própria, 30 funcionários e 80 clientes, decidiu adotar o modelo de franquia. Hoje são 1.600 pessoas trabalhando em 200 escritórios franqueados com foco em otimização de vendas pela internet. As demandas vêm da empresa-mãe, que faz a negociação com cerca de 3 mil clientes – alguns grandes, como Arezzo, Smart Fit, Porto Seguro e Sorridents, e muitos pequenos e médios.  Em 2021, a V4 Company anunciou ter vendido uma participação de 10% para o Grupo Dreamers, detentor de marcas como Artplan e Rock in Rio. Segundo Dener, fechou o ano com faturamento de R$ 130 milhões. Caio Beleza Nascido em Recife, criado em Belo Horizonte e hoje vivendo em Las Vegas, Caio Beleza é COO global da Neil Patel Digital, consultoria de marketing digital listada em 21º lugar entre as empresas de crescimento mais rápido nos EUA em 2021 pelo ranking Inc. 5000. A trajetória de Caio na companhia começou em 2015, quando era desenvolvedor na agência de inbound marketing 5seleto e foi chamado para iniciar, como sócio, a Neil Patel Brasil. Em 2019, resolveu passar três meses na operação americana. Envolveu-se na divisão de pequenas e médias empresas, que naquele momento estava deficitária, e colocou-a no azul. Acabou ficando em solo americano e conquistou a posição de COO global. “Focarei em expandir internacionalmente e replicar os processos que fizeram sucesso no Brasil e nos Estados Unidos.” Luiza Baffa A carioca Luiza Baffa passou pela startup de educação Perestroika e pela consultoria de tendências Box1824 antes de entrar para a AKQA, estúdio criativo presente em mais de 20 países. Há três anos lidera a operação no Brasil e desenvolve projetos de alcance global. Com Luiza, o escritório da AKQA em São Paulo passou de 20 para 100 colaboradores, foi premiado em Cannes e trabalhou com marcas como Nike, Netflix e Free Fire e artistas como Elton John, Criolo, Emicida e Baco Exu do Blues. Também lançou uma joint venture com o Coala.Lab, braço de conteúdo do festival de música Coala, e uma área de impacto com foco em diversidade e sustentabilidade. “Começamos a explorar lugares que outras agências não exploravam”, diz ela. “E crescemos três dígitos nos últimos três anos.”   Maju de Araújo A carioca Maria Júlia de Araújo Dias (ou Maju, como se tornou conhecida) é a primeira modelo brasileira com síndrome de Down a desfilar em uma Semana de Moda nacional – depois ela repetiu a dose nas passarelas de Milão. É também a primeira a ser embaixadora de uma marca internacional de beleza (a gigante francesa L’Oréal) e a assinar uma coleção de joias (em collab com a joalheria AHMI). Tudo isso em apenas dois anos de carreira. “Sempre soube o que queria ser, só precisava acreditar e trabalhar para tornar o sonho possível”, declara com firmeza e outro tanto de doçura. Também influenciadora (@majudearaujo) e ativista da inclusão social, a jovem tem como projeto futuro seguir a carreira de atriz. “Hoje é tempo de mudar! Quero que as pessoas me vejam e saibam que tudo é possível”, declara. Para 2022, Maju já está escalada para desfilar nas próximas Semanas de Moda de Milão e Paris, além de mais uma participação, em junho, na Brasil Eco Fashion Week, o evento responsável por levá-la para as passarelas internacionais. Vitor Alves dos Santos Da divulgação nas redes sociais e negociações nas catracas do metrô de São Paulo, em 2011, a uma rede de 21 lojas presenciais em todo o estado e uma loja online atendendo todo o Brasil, em 2021: esse é o percurso da Overcome, marca de streetwear criada pelo empresário paulistano Vitor Alves dos Santos, que diz sonhar com uma grife própria desde que, aos 12 anos, trocava tênis, bonés e mochilas com os amigos. A primeira loja, na icônica Galeria do Rock, no Centro de São Paulo, estabeleceu desde o início a ligação entre estilo e cultura urbana (skate, grafite, hip-hop…). Vestindo artistas, celebridades e influenciadores como Anitta, Larissa Manoela, Felipe e Vinícius Leal e Lucas Selfie, a marca atinge milhares de usuários das redes sociais através de campanhas como a Essentials, que promove a diversidade, e collabs. Segundo Vitor, a estratégia é fazer uma marca omnichannel aliando e-commerce e lojas físicas. “Pretendo desenvolver mais marcas em um grupo consolidado nacional e internacionalmente”. Ele também lembra que “overcome”, em inglês, significa superar. Cecília Gromann “Um olhar revisitado e casual sobre a alfaiataria tradicional”, resume Cecília Gromann sobre a Anacê, marca criada por ela em parceria com a amiga e sócia Ana Clara Watanabe, em 2019, quando ela ainda cursava design de moda na Faap, em São Paulo. Investindo “no design, na atemporalidade e na não definição de gênero das peças”, a marca entrou para o line up da São Paulo Fashion Week nas duas edições de 2021, está na plataforma internacional Not Just a Label e foi convidada para participar da feira Who’s Next, de novos designers, em Paris, além de fazer parte da curadoria de multimarcas brasileiras como Gallerist e Shop2Gether e ter sua própria loja online. Paralelamente, desenvolve a marca que leva seu nome na criação de figurinos para séries e comerciais e projetos com grandes marcas como Calvin Klein e Lacoste. Hisan Silva Santos À frente da marca Dendezeiro, como CEO e diretor criativo, Hisan “pensa e cria a moda abrangente, diversa e inclusiva”. Além de peças agênero (sem a distinção binária masculino e feminino), elas também utilizam diferentes tipos de amarrações capazes de abraçar corpos de diferentes tamanhos e formas. Segundo o estilista baiano, seu propósito é reinserir o Nordeste como potência da moda nacional, trazendo o protagonismo das pessoas pretas como referência de corpos e de criação. “Somos a primeira marca de moda a fazer uma collab com um grupo de pagode”, faz questão de lembrar, além de citar a criação de figurinos para o Festival Afropunk, o maior festival de cultura negra do mundo, e para o filme “Devassa Brasil Tropical”, com a cantora Iza. Outras colaborações da Dendezeiro incluem o Instagram, a Nestlé e a americana Converse. “Construímos nossa marca pensando na singularidade de cada um.” Felipe Matayoshi Com apenas quatro anos, a Pace já é referência no mercado digital de moda. Seu criador, o paulistano Felipe Matayoshi – que já atuou como  consultor para marcas do porte de Grupo Arezzo e Alpargatas –, a princípio se concentrou na produção de calçados e acessórios. Ele considera o mercado brasileiro “carente”. Com o lançamento da linha de vestuário, produziu uma coleção em Portugal que foi apresentada em um showroom durante a Semana de Moda de Paris. Com vendas online no próprio site (pacecompany.com.br) e na Farfetch, os produtos da marca estão presentes nos EUA,  Portugal, Canadá, Inglaterra, México, Arábia Saudita e China, entre outros. No final de 2021, lançou colaborações com as marcas americanas New Balance e Akila e a japonesa Asics. Felipe celebra suas raízes com referências nipônicas em suas coleções. Isabela Chusid Sustentabilidade se aprende em casa. Pelo menos foi assim com Isabela Chusid, fundadora e CEO da Linus, desenvolvedora e produtora da primeira sandália de plástico vegana nacional. Aos 4 anos, ela perguntou à mãe o que fazer com os resíduos domésticos. Na adolescência, descobriu o impacto ambiental causado pela indústria da moda. E, aos 23 anos, diagnosticada com frouxidão ligamentar – que exige o uso de calçados com curvas de apoio para os pés –, enxergou uma oportunidade de negócios, criando sua própria marca de lifestyle sustentável que cresceu 700% durante a pandemia e até já desfilou em Nova York. “A Linus é uma “love brand”. As pessoas são embaixadoras da marca. Geramos identificação pelo nosso propósito”, define .   Rafaela Frankenthal, Giovanna Sasso e Natalie Zarzur Problemas de comportamento sempre existiram nas empresas. Diferentemente do passado, no entanto, as políticas corporativas são cada vez mais rígidas. Para garantir que um ambiente de trabalho seja seguro, é importante contar não só com o olhar vigilante do RH, das lideranças e dos colegas, mas também da tecnologia. Foi para atender a esse desafio que, em março de 2020, Rafaela Frankenthal, Giovanna Sasso, Natalie Zarzur e Claudia Farias lançaram a SafeSpace. A startup oferece uma plataforma de denúncia de casos de assédio, discriminação e fraudes no trabalho. Tem mais de 50 clientes, entre eles a fintech Creditas e o Petlove, supermercado online para pets e já é utilizada por 15 mil pessoas em sete países. Em novembro, recebeu um aporte de R$ 11 milhões liderado pelo fundo ABSeed Ventures e a DGF, além de alguns investidores-anjo. O primeiro investimento havia sido em outubro de 2020, feito pela Maya Capital, fundo de Lara Lemann, no valor de R$ 2,4 milhões. “Não vamos parar até que todas as empresas tenham um SafeSpace e consigam garantir um ambiente de trabalho ético e inclusivo”, diz Natalie. “Empresas no mundo todo estão sendo pressionadas a se tornarem mais éticas, diversas e inclusivas. Investir em cultura organizacional, proteger reputação e marca nunca foram elementos tão importantes”, ressalta Rafaela. “O maior desafio das empresas de tecnologia é atrair e reter pessoas talentosas e comprometidas”, diz Giovanna. “Para isso, um ambiente seguro e transparente é fundamental.” Rafael Vasto e Rodrigo Maroja Como se tornar um unicórnio com menos de um ano de vida? Essa é uma das perguntas que os fundadores da Daki, plataforma de delivery de supermercados criada em janeiro, mais respondem desde o início de dezembro de 2021. Para Rafael Vasto e Rodrigo Maroja, os sócios que não passaram dos 30 anos, o encontro de uma solução de tecnologia versátil com uma demanda cada vez maior por conveniência digital são só alguns dos motivos. A Daki anunciou, em dezembro, sua segunda rodada de investimentos no valor de US$ 260 milhões, passando a valer US$ 1,2 bilhão. O aporte foi apoiado por Activant Capital, Balderton, Greycroft, G-Squared, HV Capital, Kaszek, Mirae Asset, Monashees, Moving Capital, Tiger Global e outros. O investimento será utilizado para expandir as atividades da Daki e da JOKR, startup mexicana que participou de uma fusão com a empresa e vai atuar com foco em demais países da América Latina. Já são mais de 60 lojas espalhadas por São Paulo, Campinas, Guarulhos, região do ABC Paulista, Rio de Janeiro e Niterói. Capitalizada, a meta da empresa é ultrapassar 100 unidades até fevereiro. “Receber o título de unicórnio é um marco importante e somos muito gratos por termos chegado até aqui, mas também sabemos que a nossa trajetória como empreendedores está apenas começando.” Cristian Rocha No ano de 2016, Cristian Rocha, que acabara de chegar ao Brasil vindo de uma temporada na Austrália, conheceu o analista de sistemas Jacson Fressatto. À época, após perder a filha com 18 dias de vida por falta de um diagnóstico preciso, Jacson estava decidido a impedir que outras pessoas passassem pelo mesmo drama. Ambos se uniram para criar a Laura, empresa com sede em Curitiba. A startup possui um sistema que, por meio de inteligência artificial, detecta pacientes em risco de forma antecipada. A tecnologia já ajudou a salvar mais de 24 mil vidas no Brasil presente em 40 instituições e 10 milhões de atendimentos em 4 anos. Em maio deste ano, recebeu aporte de R$ 10 milhões em uma rodada liberada pelo fundo GAA Investments. “As instituições têm dificuldade de escalar o atendimento para mais pessoas e, consequentemente, os pacientes podem ter dificuldade no acesso aos serviços de saúde.” Rodrigo Terron Em 2014, Rodrigo abandonou a carreira de coordenador de planejamento estratégico para empreender. Fundou a Horizon Four, especializada em desenvolvimento para startups. Ela deu origem à Shawee, que se fundiu, em 2020, com a Rocketseat, focada na formação de desenvolvedores de software. Em 2021, a empresa fez um dos maiores M&A voltados para educação de desenvolvedores com a argentina Digital House, em uma operação de R$ 150 milhões que deu origem à maior comunidade de desenvolvedores da América Latina. Neste ano, Rodrigo aceitou o convite do influenciador El Gato para formar e integrar o conselho da Los Grandes, segunda maior organização de e-sports da América Latina. “Em todos os negócios que fundei ou contribuí, sempre pensei em formas de gerar valor, de criar comunidade e crescimento para todos os envolvidos”, diz Terron. Jade Utsch Filizzola Ao identificar, em 2017, que uma das causas da falta de atividades para grande parte das pessoas era a ausência de recompensas imediatas, Jade, junto com suas sócias Jennifer de Faria e Tatiany Ribeiro, todas de Belo Horizonte, lançaram a RadarFit, uma plataforma de games fitness que motiva os usuários a se exercitarem. Em setembro, a empresa recebeu R$ 3 milhões em aporte da Domo Investimentos com investidores-anjo e a Startup Farm. A RadarFit finaliza 2021 com 5,9 milhões de acessos. “O maior desafio foi entender que o fracasso é parte da trajetória do sucesso. Os obstáculos deixaram de me paralisar, e passei a visualizar caminhos em que qualquer desafio é certamente superado.” Frederico Tonietto Que investidor não gostaria de sair de um programa como o “Shark Tank” tendo Camila Farani e Caio Castro como sócios? Isso se tornou realidade para Frederico Tonietto e Luiz Fernando Leite Ribeiro, que fundaram a Styme, plataforma de gestão de fila em bares e restaurantes. O aporte de R$ 3 milhões vindo do programa ajudou no impulsionamento da empresa que, até então, já havia recebido R$ 700 mil de investidores-anjo. Em agosto de 2021, Frederico e seu sócio venderam a Styme para a concorrente Oi Menu. “Estou muito feliz em perceber e concretizar que os jovens são realmente capazes de impactar a vida de tantas pessoas. O principal ensinamento que tive é que tudo deve ser feito de e para pessoas”, diz Frederico.   Flávio Generoso Valiati Dos 6 aos 19 anos, Flávio jogou futebol profissionalmente, com passagem inclusive pelo time do São Paulo. Criado em uma família de mórmons, sentiu que queria experimentar o trabalho social e religioso. Largou a bola para dedicar dois anos da vida ao voluntariado. Depois dessa fase, cursou marketing e migrou para o mundo corporativo. Trabalhou na Santo Digital, parceira da Google, de onde entrou na área de vendas e saiu como sócio aos 23 anos. Hoje é head de educação do Zoom – e para retribuir a ajuda dos mentores que teve no início de carreira criou a Vamos Subir, uma startup social sem fins lucrativos que nasceu para ajudar jovens em início de carreira por meio da mudança socioemocional, os “soft skills”, que aumentam as chances de empregabilidade. Desde 2015 o projeto já orientou 100 mil pessoas e ajudou a empregar mais de mil. “Entendi cedo que queria usar 10% do que ganho em prol do outro. Se você não tem dinheiro para bancar um projeto, pode doar tempo. Seu conhecimento pode fazer alguém decolar.” Gabriela Augusto Depois de se descobrir uma mulher trans em 2016 enquanto cursava a faculdade de direito na PUC-SP, Gabriela Augusto passou a vislumbrar a dificuldade de ingressar no mercado de trabalho. Foi então que decidiu pela educação. Elaborou sozinha o “Manual Empresa de Respeito” com dicas para ajudar a combater a transfobia, o racismo e a homofobia nos ambientes corporativos. Distribuiu os livretos pela Zona Oeste de São Paulo – e esse foi o embrião do que viria a ser seu atual negócio. A Transcendemos é uma consultoria que oferece apoio a empresas que se preocupam com diversidade e inclusão e que acreditam que a diferença é uma riqueza e não um problema. Entre os clientes mais importantes de seu portifólio estão marcas como Arcor, Kraft-Heinz, Natura, Facebook e Google. Hoje Gabriela é uma das maiores referências na área: foi citada em um prêmio internacional da consultoria McKinsey direcionado a ações em prol da comunidade LGBTQIA+ e indicada como Top Voice no Linkedin. Anna Luísa Santos Aos 15 anos, Anna Luísa leu “Vidas Secas”, de Graciliano Ramos, e se deu conta de que aquela ainda era a realidade de milhares de brasileiros. Inconformada, a soteropolitana passou a pesquisar formas de tratamento de água até criar o Aqualuz, que usa a luz do Sol para tratar a água de cisternas em zonas rurais de clima quente com um custo de R$ 0,05 a cada 10 litros de água tratados. Sem apoio, ela abriu uma startup para viabilizar o projeto. Assim surgiu a Safe Drinking Water For All, um negócio de impacto social que desenvolve tecnologias de acesso a água e saneamento em zonas rurais do Brasil. O projeto já impactou 13.700 pessoas no semiárido. Anna foi a brasileira mais jovem formada em lideranças de novos empreendimentos pelo MIT, única brasileira premiada pelos Jovens Campeões da Terra da ONU, está entre os 20 Jovens Inspiradores nos Seus 20 pela McKinsey & Company e é a primeira brasileira finalista do prêmio mundial Green Tech Award, além de Linkedin Top Voice de sustentabilidade. Rhayann Vasconcelos Aluno de escolas públicas e formado com auxílio do ProUni, o recifense Rhayann entende bem a importância do apoio à educação no Brasil. Depois de trabalhar na Secretaria da Juventude do Governo de Pernambuco, viu que as dificuldades sofridas pelos estudantes em outras regiões do estado eram ainda maiores. Em 2020, com a pandemia, percebeu o agravamento da situação e criou o Acelere no Enem, uma plataforma que oferece, de forma gratuita, preparação voltada ao Enem com aulões ao vivo, simulados, exercícios, aulas tira-dúvidas e apoio psicológico. No primeiro ano, o Acelere impactou 84 mil estudantes. Em 2021, 507 mil alunos estiveram conectados à iniciativa. O projeto foi reconhecido como uma das 30 melhores iniciativas do país pela Brazil Conference Harvard & MIT. Bruno Bordon Aos 24 anos, o arquiteto foi ao sertão do Piauí com um grupo de jovens para prestar apoio social na região. Depois de 12 dias, voltou a São Paulo com uma missão: transformar a moradia de uma família que conheceu na viagem e que vivia em extrema miséria. Foi então que nasceu a Construide, uma organização não governamental que tem como propósito impactar vidas por meio da construção de moradias. Em quatro anos de projeto, eles já realizaram mais de 40 obras sociais em São Paulo, Sergipe, Rio de Janeiro, Amazônia, Brumadinho (MG), Belém do Pará e Moçambique. Hoje Bruno é CEO de um grupo de startups sociais que existem como um ecossistema para dar mais sustentabilidade à Construide e que tem faturamento de 2021 estimado em R$ 2,2 milhões. Aira Beatriz A jovem cientista mais premiada do Amapá foi também por dois anos seguidos o primeiro lugar na maior feira de ciências da América Latina. Em 2015, começou a dividir as experiências e conquistas em palestras nas escolas públicas, e esse movimento deu origem ao que pode ser um verdadeiro celeiro de cientistas (62% mulheres) no país. Criou o Leva Ciência, um instituto que conta com mais de 30 especialistas, mestres e doutores voluntários com o objetivo de incentivar e promover a iniciação científica. Para garantir a permanência dos estudantes no programa, ela trabalha com cestas básicas, material didático, vale-transporte e ajuda de custo para os eventos. A iniciativa já impactou mais de 2 mil estudantes da rede pública e conta com 25 alunos premiados nacional e internacionalmente. Aira é embaixadora da Juventude pela ONU, liderança do programa Amazon Scientists, patrocinado pela Embaixada dos Estados Unidos no Brasil, e parceira da Nasa Education   Gianlucca Nahas e Marco Fragali Em 2017, Gianlucca e seu amigo Marco, então no último ano do ensino médio, ajudavam os pais a comprar passagens aéreas quando perceberam a quantidade de milhas que eles deixavam expirar. Entenderam que o padrão se repetia em milhares de famílias, principalmente entre os idosos. Viram ali uma oportunidade de negócio e largaram os planos de estudos no exterior para apostar na ideia. A Flyby é uma empresa focada em vendas de passagens aéreas executivas que usa um banco de milhas como base. Hoje a empresa conta com 54 funcionários e cresce 35% ao mês sobre uma base relevante: negociou mais de 15 bilhões de milhas (aproximadamente R$ 78 milhões) e declara faturamento anual de R$ 57 milhões. Rodrigo Miranda Assim que se formou em engenharia mecânica na Universidade Federal do Espírito Santo, Rodrigo resolveu se unir a outros colegas de faculdade para empreender. Em cinco anos, fundou três startups no varejo brasileiro. A primeira, Zaitt, surgiu em 2016 e foi pioneira em lojas autônomas na América Latina. A segunda foi a Shipp Delivery, criada em 2017, como um app de delivery “de tudo”. A terceira, a Packk, foi lançada em 2020 como um delivery com soluções de digitalização para grandes empresas, que conquistou clientes como Nestlé e Hortifrutti em apenas seis meses. Em 2019, a Zaitt e a Shipp foram adquiridas pela Sapore, gigante da alimentação corporativa. Em 2020, após a criação da Packk, atraíram a atenção da Americanas S.A., que fez uma aquisição completa tanto da Shipp, que agora se chama Americanas Delivery, quanto da Packk. Atualmente, Rodrigo é CEO da Zaitt, com a missão de criar a maior rede de lojas autônomas do mundo e a pretensão de chegar a mil lojas até o fim de 2024. Alexandre Capella, Antonio Delli Paoli Neto e Otto Guarnieri Após a formação na FGV, Antonio fez um curso de extensão em business na UCLA e se surpreendeu com os canais de vendas nos quais encontrava bebidas proteicas prontas. Ao lado de Otto (CEO) e Alexandre, fundou uma empresa de alimentos, bebidas e suplementos, a Mais Um. Mas o trio não queria que ela se parecesse com nada do que via nas prateleiras do país e nem com a experiência de compra daquele produto. Começaram a empresa com uma aposta ousada de comunicação descontraída em um segmento que, até então, contava com produtos posicionados de forma agressiva e focados em performance. As primeiras vendas foram feitas em lanchonetes universitárias e bombonieres. Logo depois começaram as vendas online. A empresa deve fechar 2021 com 45 colaboradores, 60 produtos, faturamento de R$ 35 milhões e um crescimento de 100%. Hoje são mais de 6 mil pontos de vendas espalhados pelo Brasil, e eles acabam de iniciar as exportações. Guilherme Brunhole Em 2018, Guilherme, que é formado em ciência da computação pela Unicamp, trabalhava com machine learning quando resolveu estudar mercados de personalização. Viu que fora do Brasil o nicho de beleza atendia esse modelo e decidiu apostar no segmento. Não entendia sobre tipos de pele, mas sabia classificar as necessidades dos clientes e os produtos buscados por eles com a ajuda de dados. Criou então a UAUBox, um clube de assinatura que envia kits de cosméticos e skincare em domicílio com produtos para o tipo de pele específico do cliente por um terço do que os mesmos produtos valem no varejo. O negócio emprega 60 funcionários, que trabalham para enviar 300 mil caixas por ano. Em 2021, a UAUBox faturou R$ 17 milhões e já planeja uma marca própria de beleza. Daniela Lacerda Filha de um representante comercial autônomo, Daniela já brincava de vender desde os 7 anos de idade. Preocupado com a instabilidade da profissão, seu pai a desencorajava a seguir o mesmo caminho. Por insistência dele, ela cursou alguns períodos da faculdade de direito. Mas o dom do comércio falou mais alto. Entre as aulas, vendia bijuterias e bolsas aos colegas e professores. Seu primeiro negócio formal foi uma loja de roupas importadas em um ponto que o pai pretendia alugar. O sucesso foi tanto que, aos 20 anos, ela abriu uma distribuidora de bebidas com o marido e teve a ideia de anunciar preços melhores do que as conveniências durante a madrugada. Sucesso outra vez. Com baixo movimento durante o dia, ela passou a vender também alimentos. Nascia assim o Corujão, uma rede com sete lojas em Feira de Santana, uma em Salvador e 130 em processo de franquia em cidades do Nordeste para 2022. A rede emprega 513 pessoas e faturou R$ 285 milhões em 2021. Chiara Luzzati Ao voltar para o Brasil depois de estudar no Manhattan Institute of Management, em Nova York, e apaixonada pelo mercado de wellness, Chiara Luzzati percebeu um segmento não explorado no país, o de sexual care. Notou que a experiência de compra não agradava, que os produtos eram mais focados no prazer masculino e que era difícil encontrar lubrificantes de qualidade com ingredientes naturais, embalagens com design sofisticado e uma comunicação sem tabus, diversa, sem gênero e inclusiva. Criou a Lubs depois de dois anos de pesquisa – e hoje conta com uma comunidade fiel que, além dos produtos, também usufrui de conteúdo educativo gerado pela marca em seus canais para normalizar o prazer. A Lubs teve uma receita de R$ 4 milhões em 2021.   Carlinhos Maia Muito mais do que tornar nacionalmente conhecido o bairro Senhor do Bonfim, em Penedo, no estado de Alagoas, Luiz Carlos Ferreira dos Santos, ou apenas Carlinhos Maia, transformou sua origem em uma lucrativa plataforma de negócios. O empresário calcula que mais de 100 influenciadores saíram da Vila do Carlinhos Maia e alcançam milhões de pessoas diariamente. Ele conta que isso só foi possível pela determinação em transformar o Instagram, plataforma onde tudo começou, em 2016, em um ambiente qualificado. “Desde o início, eu valorizei meu perfil como plataforma de negócios, entendi que era importante que eu fosse maior para que hoje pudesse trabalhar com muito mais empresas”, reforça. Após vários recordes, inclusive de ter o Stories mais visualizado de 2018, Carlinhos se aproxima de 24 milhões de seguidores somente no Instagram. Sua prioridade agora é potencializar marcas regionais e torná-las conhecidas nacionalmente. “Esse foi um objetivo muito claro para mim, atuar com empreendedores da minha região que não eram grandes em termos de visibilidade, mas tinham um potencial financeiro importante. Isso ocorreu, por exemplo, com a Baška, grife que apresentamos na São Paulo Fashion Week, em novembro.” Carlinhos lembra que a estratégia de atuar com marcas regionais já o fez faturar até R$ 8 milhões apenas com três posts, o que para ele, é a prova de que dá para ter retorno com parceiros que estão além do Sudeste. O empresário também é sócio da B-Burguer, hamburgueria que deve fechar o ano com 400 lojas que faturam R$ 200 mil por mês cada uma. Seus negócios somados geram empregos para 5 mil pessoas, e a meta é que esse número chegue a 15 mil até março de 2022. Aos 30 anos, Carlinhos Maia tem uma definição clara sobre seu futuro: tornar-se bilionário até os 35 anos: “Esse é meu maior propósito, construir algo que me possibilite impactar um número cada vez maior de pessoas e faça valer minha origem.” Gil do Vigor Existe um caminho a ser percorrido entre participar de um reality show de grande audiência como é o BBB, da TV Globo, e rentabilizar essa visibilidade no médio e longo prazos. No caso de Gilberto José Nogueira Junior, o Gil do Vigor, essa distância foi alcançada com maestria. Mesmo não tendo vencido o reality, seus ganhos com publicidade e projetos especiais superaram o de muitos campeões de outras edições. Em entrevista recente à Forbes, Gil estimou que, seis meses após sua participação, já teria faturado R$ 15 milhões. Dentre os contratos estão Santander, o mais rentável, chegando a R$ 2 milhões, além de Vigor, iFood e Lacta, para mencionar os maiores. Além disso, Gil ganhou um quadro especial de finanças no programa de Ana Maria Braga e participações em outras atrações da Globo. Formado em economia pela Universidade Federal de Pernambuco (UFPE), com mestrado pela mesma instituição, Gil tem 14,7 milhões de seguidores no Instagram. Um de seus sonhos, compartilhado com o público do BBB, inclusive, tornou-se realidade: atualmente ele faz doutorado na Universidade da Califórnia em Davis (UC Davis). “Muita coisa mudou de um rapaz que não tinha oportunidade para alguém que hoje tem a sua voz ouvida e consegue utilizar as ferramentas que possui para atingir as pessoas e ajudar, ou pelo menos influenciar, de alguma forma, para que o Brasil possa melhorar um pouquinho”, comenta Gil. Recentemente, ele também foi eleito uma das 100 personalidades afrodescendentes mais influentes do mundo na categoria Mídia e Cultura pela iniciativa internacional da sociedade civil Most Influential People of African Descent (Mipad), que tem apoio da ONU. Para o futuro, Gil trabalha em duas frentes. Quer continuar investindo nas participações na TV e no mercado de influenciador digital, mas também faz planos para a carreira de economista. “Empreendedora é aquela pessoa que consegue inovar, ter ideias e colocar as coisas para a frente”, diz. Bruno Goes Nascido no Jardim Novo Oriente, em São Paulo, Bruno tinha um sonho: tornar-se jogador do Corinthians. Ele o realizou, mas não nos gramados. Nobru, como hoje é conhecido, foi eleito, em 2019, o melhor jogador do mundo de Free Fire pelo Timão. Com mais de 13 milhões de inscritos no YouTube e 3,6 milhões de seguidores na Twitch, fundou, junto com o também streamer Cerol, a organização Fluxo, em janeiro de 2021. E aliou-se à 3C Gaming, empresa de games e e-sports criada pelo empresário Renan Philip. “Nossa equipe tem mais de 25 talentos, além de mais de 40 colaboradores. Só a Copa Nobru, criada por mim, conta com mais de 200 profissionais”, diz. Também em 2021 ele foi campeão da Liga Brasileira de Free Fire (LBFF) pelo Fluxo e eleito Personalidade do Ano pelo Esports Awards. No Prêmio eSports Brasil 2021, foi escolhido como o Craque da Galera. Dentre as marcas que o apoiam estão Casas Bahia, NEXT e TikTok. Rafael Chalub Ao publicar em seu perfil no Instagram, em junho, a sátira sobre a vinda da vacina da Pfizer ao Brasil, o humorista Rafael Chalub, conhecido como Esse Menino, alcançou mais de 16 milhões de pessoas. O ator decidiu ser humorista aos 18 anos. Em 2018, transformou as redes sociais em seu palco principal, onde compartilha suas produções humorísticas e projetos colaborativos. Apesar de reconhecer o papel que o vídeo teve em sua carreira, Chalub faz questão de reforçar sua formação como humorista e a veia empreendedora. Nos últimos meses, desenvolveu projetos com mais de 30 marcas, entre elas Skol Beats, 99 e Avon. Lançou, em agosto, o especial de comédia Poodle que vendeu 14 mil ingressos online. Também estreou o programa “EsseMenino.Mp3” no Multishow. “Viver de comédia já tinha deixado de ser um sonho e virado um plano faz tempo. A missão sempre foi conseguir um público que fosse participativo a ponto de investir nos meus projetos.” Lucas Hang Como se dar bem em uma indústria que está apenas começando no Brasil? Lucas Hang, fundador da Havan Liberty e responsável pelo desenvolvimento de novos negócios na Havan – varejista comandada pelo pai, Luciano Hang, que fatura mais de R$ 10 bilhões ao ano –, não só estabeleceu a formação de um time profissional de e-sports como entendeu a importância de investir no cenário. Em 2021, as receitas cresceram 15%. Para 2022, o objetivo é ultrapassar R$ 20 milhões em investimentos. “O desafio no início foi a falta de profissionalismo do setor, uma oportunidade que enxergamos ao criar a Liberty”, diz Lucas. Também para 2022, a organização planeja inaugurar seu novo gaming office, em São Paulo, com área de 2.500 metros quadrados, 38 dormitórios e dez salas de treino. João Sampaio O catarinense João Sampaio, conhecido como Flakes Power, dedica-se aos jogos eletrônicos como streamer desde 2016. Hoje tem mais de 6 milhões de inscritos no YouTube e 1,1 milhão no Instagram. Em 2021, assinou um contrato histórico com o Itaú Unibanco, marca que se tornou patrocinadora oficial da Hero Base, área de treinamentos e produção de conteúdo localizada em Joinville, Santa Catarina. É dono de cinco empresas que atuam em 15 segmentos distintos, gerando mais de 40 empregos diretos e 150 indiretos. Sua marca licenciada, Flakes Power, chega a mais de 20 mil pontos de venda no Brasil. “São muitos os desafios de empreender em um mercado novo. Em apenas 10 anos, o que era só um joguinho se tornou a maior indústria de entretenimento do mundo.”   A edição 93 da Forbes está disponível nos aplicativos na App Store e na Play Store. Outros destaques da edição são a lista das mulheres mais poderosas do mundo, as previsões do agronegócio para 2022 e mais: Tendências tecnológicas para 2022 O charme francês com o acolhimento canadense Os top 4 escolhidos por quem entende Visitamos o berço da Land Rover e testamos as novidades da marca Loft integra o visitante à terra, ao céu e ao mar Artista seleciona 10 obras emblemáticas Under 30 2020 Under 30 2019 Under 30 2018 Under 30 2017 Under 30 2016 Under 30 2015 Under 30 2014   Siga FORBES Brasil nas redes sociais: FacebookTwitterInstagramYouTubeLinkedIn Siga Forbes Money no Telegram e tenha acesso a notícias do mercado financeiro em primeira mão Baixe o app da Forbes Brasil na Play Store e na App Store. Tenha também a Forbes no Google Notícias.  © Forbes 2023. Todos os direitos reservados.", "url": "https://forbes.com.br/forbeslife/2021/12/lista-under-30-de-2021-e-destaque-da-nova-edicao-da-forbes/", "threshold": 1.0}