{"title": "Lista Forbes Under 30 2022: veja destaques das 15 categorias - Forbes", "content": "Início / ForbesLife / Lista Forbes Under 30 2022: veja destaques das 15 categorias Casimiro, Ricardo Silvestre, Virgínia Fonseca, Marina Ruy Barbosa e Laiza de Moura estão na capa da edição Under 30 de 2022 Eles não param de nos surpreender. Em 2022, as geniais e jovens mentes espalhadas pelo país (e pelo mundo) alcançaram feitos grandiosos em ousadia, inovação, talento, superação, criatividade e generosidade. Foi um desafio afunilar tanta gente boa inscrita na plataforma Forbes Under 30 até chegar aos seis representantes de cada uma das 15 categorias preestabelecidas – e ainda reservar espaço para unanimidades sugeridas por nosso timaço de consultores. Entre os destaques do ano, estão o streamer Casimiro, 29, e a influenciadora digital Virgínia Fonseca, 23, na categoria web e e-sports, Ricardo Silvestre, 26, na categoria Marketing e Publicidade, a empresária e atriz Marina Ruy Barbosa, 27, e a modelo Laiza de Moura, 22, na categoria Moda. Para comprar a revista, clique aqui. A variedade de temas, propostas e abordagens da turma 2022 causou espanto no time Forbes durante o trabalho de pesquisa e apuração, assim como o incrível mix de origens e trajetórias de vida dos participantes – tudo contado pelos próprios eleitos. Cada candidato foi avaliado segundo métricas e critérios objetivos e subjetivos, como faturamento, valor de mercado, aportes recebidos, alcance (número de clientes, de beneficiados ou de seguidores nas redes sociais, conforme a categoria), impacto (na respectiva cadeia ou na sociedade, conforme a categoria), criatividade, ineditismo, disrupção e relevância, entre outros. As categorias são as seguintes: Arquitetura, Design e Urbanismo; Artes dramáticas; Artes plásticas e Literatura; Ciência e Educação; Esportes; Finanças; Gastronomia; Indústria e Empreendedorismo; Marketing e Publicidade; Moda; Música; Tecnologia e Inovação; Terceiro setor e Empreendedorismo social; Varejo e E-commerce; Web e E-sports. Acesse a edição 104 da Forbes Brasil, já disponível nos aplicativos na App Store ou na Play Store e pode ser comprada aqui.   ARQUITETURA E DESIGNMateus Ferrareto, 25, e Rubens Stuque, 28 De chefe e estagiário a sócios na Eco Flame Garden, a parceria entre Rubens e Mateus evoluiu no desejo comum de empreender. Em 2020, lançaram ao mercado sua proposta para a decoração de ambientes externos: peças que “tropicalizam” a experiência de “fogueira no jardim”. Para casar versatilidade e sofisticação com praticidade e conforto, os acabamentos foram desenvolvidos com tecnologias para facilitar a limpeza, pérolas drenantes no enchimento e tecidos resistentes a raios UV, fungos e mofo. Para acompanhar o processo de inovação, a Eco Flame Garden foi a primeira empresa brasileira nativa digital do segmento com controle sobre todo o ciclo do produto, da fabricação à venda. O trabalho da marca já foi reconhecido por referências da arquitetura, como João Armentano e Paulo Jacobsen, e foi destaque em duas edições Casacor. Entre seus principais clientes, estão grifes de hospitalidade, como a Fazenda Boa Vista e a rede Six Senses Botanique. Em 2022, a receita da companhia saltou 160%, e a perspectiva é triplicar esse faturamento em 2023, para R$ 115 milhões, baseado no seu crescimento no mercado com novos produtos e lojas. Hoje, a Eco Flame Garden tem cinco lojas físicas e 15 espaços de revendas, inclusive no Uruguai e no Paraguai. Agora, os empresários se preparam para inaugurar lojas da marca em Dubai e Miami. Sobre o futuro, a resposta da dupla é uníssona: “Ser a maior marca de lifestyle outdoor do mundo”. Motivação que já está até no código de cultura da empresa. ARTES DRAMÁTICASGiulia Bertolli, 25 A atriz carioca começou seus estudos de teatro aos 13 anos. Após se formar em língua portuguesa pela PUC-RJ e em artes cênicas pela CAL (Casa de Artes das Laranjeiras), Giulia estreou profissionalmente nos palcos com a peça “E se Mudássemos de Assunto?”. Depois disso, debutou na televisão vivendo a personagem Valentina na primeira fase da novela “O Sétimo Guardião” – papel que coube à sua mãe, Lilia Cabral, no restante da trama. Em 2019, fez parte do elenco principal de “Malhação: Toda Forma de Amar”. No cinema, fez o curta-metragem “A Lista”, pelo qual ganhou o prêmio de melhor atriz no South Film and Arts Academy Festival, do Chile, além de ter escrito, dirigido e produzido o curta “Só Mais uma Frase”, que foi indicado a 11 festivais e ganhou quatro prêmios, três deles na categoria melhor roteiro. Desde 2020, Giulia está em cartaz com a peça “A Lista”, que rendeu a ela a indicação de melhor atriz coadjuvante no Prêmio Bibi Ferreira 2022. “Essa indicação foi muito especial, não apenas pelo prêmio em si, mas por tudo o que ele simboliza. Cresci nas coxias dos teatros e foi assim que aprendi a estar preparada para o inesperado e, talvez a lição mais importante de todas, a ter coragem de recomeçar todos os dias”, diz a atriz, que, em 2023, levará a produção para os palcos do Rio de Janeiro. Ela também escreveu o longa “Me Leve Para Ver o Mar”, previsto para ser rodado no segundo semestre. ARTES PLÁSTICAS E LITERATURALuiza Romão, 30 Paulista de Ribeirão Preto, Luiza escreveu o livro de poesias “Também Guardamos Pedras Aqui” (editora Nós), que recebeu o principal prêmio literário do Brasil, entre 4.290 obras inscritas: o Jabuti, de Livro do Ano (a conquista rendeu R$ 100 mil). Ela recebeu a notícia em Madri, onde estuda interpretação para cinema. “Na noite do prêmio, via a transmissão pelo celular. Era madrugada quando saiu o resultado. Estava sozinha em meu quarto e as três pessoas com quem divido apartamento dormiam –comemorei sem acordar ninguém. Chorei muito, não só no momento do anúncio do resultado, mas principalmente com as fotos e mensagens das amigas, amigos e amigues que estavam no Brasil. Sem dúvida, foi, ou melhor, está sendo dos momentos mais emocionantes da minha vida.” Mais velha entre quatro irmãos (Chico, Caetano e Bethania) e filha de professores, Luiza cresceu estimulada a ler, escrever, dançar, encenar. “Aos 9 anos escrevi uma série de poemas, imprimi e saí para vender na escola. Amava as histórias seriadas, como Harry Potter e a coleção Vagalume.” Aos 17 anos, trocou o interior pela capital para estudar Artes Cênicas na ECA/USP. Voltou a escrever em 2013, após conhecer os slams (batalhas de poesias autorais) e saraus. Foi ali que se descobriu poeta e conheceu os nomes que se tornariam suas referências na literatura nacional. Entre eles, Emerson Alcalde, Mel Duarte e Daniel Minchoni. Entre suas predileções estrangeiras, ela cita o trio: Bertolt Brecht, Elena Ferrante e Gloria Anzaldúa. Luiza também escreveu os livros “Sangria”, “Coquetel Molotove” e “Nadine”. Para o futuro, deseja apresentar o espetáculo “Garotas Mortas” (baseado em obra de Selva Almada) e assistir aos jogos do Palmeiras, na rua Caraibas. CIÊNCIA E EDUCAÇÃOTaciana Pereira, 28 Então estudante de bioengenharia em Harvard, a curitibana Taciana Pereira recebeu aplausos e 2 milhões de visualizações no Facebook quando discursou, como copresidente da Brazil Conference at Harvard & MIT de 2017, sobre a expressão “tinha que ser brasileiro”. “Quero desafiar a vocês e a mim a mudar o sentido dessa frase”, disse. “Quero ver pela primeira vez um prêmio Nobel de um de nós. E, quando isso acontecer, eu quero ouvir no fundo: ‘tinha que ser brasileiro’.” O prêmio, o Brasil ainda não ganhou. Mas Taciana avançou vários passos em sua trilha na ciência. Um dos mais recentes: levantou US$ 15 milhões para a Systemic Bio, empresa voltada para a criação de miniórgãos humanos bioimpressos. “O principal objetivo é reduzir drasticamente o tempo de descoberta e aprovação de medicamentos, além de eliminar a necessidade de utilizar animais para testes em laboratório”, diz a brasileira, que é sócia e CEO da companhia. Taciana se mudou para os Estados Unidos em 2013, para estudar em Harvard com uma bolsa de 90%. Na faculdade, atuou em pesquisas com base em imunoterapia em busca da cura do câncer – doença que acometeu seus quatros avós. Ao se formar, entrou para a startup de bioimpressão 3D Allevi e, em quatro anos, se tornou chief scientific officer, ampliando sua participação societária. Liderou a venda da startup para a 3D Systems, pioneira em impressão 3D com rendimento anual de US$ 600 milhões, e tornou-se vice-presidente e gerente geral de bioimpressão da empresa compradora. Em 2022, apresentou o plano de abrir a subsidiária Systemic Bio, que tem faturamento estimado em US$ 100 milhões em cinco anos e a ambição de trazer escala para a produção de miniórgãos. ESPORTESBia Haddad, 26 Quando criança, a paulistana estava dividida entre ser jogadora de tênis ou professora de matemática – pelo jeito, deu certo optar pela primeira alternativa: em agosto de 2022, com vice-campeonato do WTA 1000 de Toronto, ela saltou do 82º lugar do ranking para o 15º, a melhor colocação da história de uma brasileira. “Um momento muito especial do ano foi quando ganhei meu primeiro WTA em Nottingham, não somente pelo título, mas pela forma como eu e minha equipe estávamos lidando com o dia a dia, trabalhando muito duro.” Em seguida, a jogadora, que tem entre suas principais armas o saque e o forehand, venceria outro WTA 250, em Birmingham. Com esses excelentes resultados, em dezembro, a tenista foi premiada pelo jornal britânico Daily Express por ter apresentado a melhor evolução no ranking mundial na temporada. Bia cresceu dentro do clube Sírio, em São Paulo, onde frequentou a escola e teve contato com várias modalidades: judô, ginástica artística, natação, futebol e tênis. “Fisicamente, Bia sempre foi diferenciada, um pouco maior que as crianças da mesma idade”, analisa Laísa, sua mãe e professora de tênis. Quando não está jogando, Bia gosta de tocar violão e piano, além de ler e conhecer a cidade por onde está passando. Para 2023, a meta é “seguir evoluindo para chegar entre as 10 melhores do mundo.” Bia tem o sonho de ganhar um Grand Slam. “Mas, mais do que isso, quero contribuir de alguma forma para a vida de pessoas, especialmente as crianças.” FINANÇASLucas Chamadoiro, 30Chamadoiro é um “private banker”, profissional que orienta investidores com muito dinheiro a cuidar de seu capital. A carreira nasceu dos estudos. Ambicioso, o soteropolitano percebeu logo cedo que teria de procurar seu próprio caminho. Ele poderia estudar administração de empresas na UFBA, mas não se animou com a ideia. “Eu queria um lugar mais orientado ao mercado”, diz ele. Daí a decisão de vir para São Paulo e cursar a Fundação Getulio Vargas (FGV). Após se formar, foi trabalhar no Credit Suisse, onde atualmente é responsável por R$ 15 bilhões em recursos de clientes. Chamadoiro diz estar otimista com as perspectivas do setor. Segundo ele, os projetos mais bem-sucedidos serão os que conseguirem avançar para além do eixo Rio-São Paulo. “É preciso criar uma ‘awareness’ no Brasil sobre o que é o mercado de private bank”, diz Chamadoiro. “Esse será um negócio de customização, eu costumo dizer que não é ‘high tech’, é ‘high touch’, e o desafio é ganhar escala sem perder esse sentimento de exclusividade que hoje é oferecido para o cliente.” GASTRONOMIAAmanda Albaricci de Angelis, 26, e Fábio Munno, 30 Fast food funcional, vegetal e carbono neutro. Essa é a proposta da Bloom Fast Good, startup que recebeu R$ 10 milhões da holding Nutramerica. “A marca reinventa o junk food e clássicos da indústria F&B (food and beverage), transformando-os em nutritivos, funcionais, 100% plant based e mantendo as características sensoriais já adoradas e culturalmente consumidas pelas pessoas”, diz Fábio Munno, CEO e cofundador da Bloom. Amanda Albaricci de Angelis, sócia e CMO, complementa: “Ela é sustentável, com a maior redução possível de resíduos, embalagens em PLA (plástico biodegradável), composteira e compensação da pegada de carbono.” O desenvolvimento das fórmulas, com a proposta de entregar diferentes funções, como auxílio no foco, no relaxamento e na imunidade, foi feito em parceria com a Atlhetica Nutrition, empresa de suplementos alimentares da Nutramerica que foi fundada pelo pai de Amanda. Há ainda uma parceria de marketing com a Incrível, linha plant-based da JBS. “A gente quer construir junto uma categoria, afinal é um conceito novo”. diz Amanda. Com uma loja aberta no shopping JK Iguatemi, em São Paulo, em junho de 2022, a Bloom deve inaugurar mais quatro unidades no início de 2023 – com o plano de chegar a 35 lojas ao longo do ano. INDÚSTRIADaniel Steinbruch, 30 Ele mora em uma fazenda no município de Americana, a cerca de 140 km da capital paulista, metrópole que ele pouco frequenta. Em vez de seguir os caminhos da família, que tem a principal atividade na indústria têxtil, ele literalmente fez o “caminho da roça” com destino a Mogi Mirim, a 60 km de Americana, onde está outra fazenda, a Querência. É lá que Daniel montou um negócio próprio, que começou do zero e que hoje é referência na pecuária. A decisão pela criação de bovinos não começou ontem. Desde muito cedo, ele sabia que estaria ligado à terra, produzindo alimentos e vivendo do seu projeto de vida. Daniel se tornou um criador da raça de bovinos wagyu, de origem japonesa, para vender carne premium em butiques e restaurantes de alta gastronomia. A criação começou em 2006; em 2013 ele criou a marca Guidara Meat &Co. A família tem fazendas que já estão na terceira geração, em um processo iniciado pelo avô. Foi esse ambiente que influenciou a decisão de Daniel de ter seu próprio negócio. Desde criança ele acompanha as transformações da pecuária brasileira, um setor que somente com exportações deve fechar 2022 com um crescimento da ordem de 20%, ficando acima de US$ 12 bilhões. Daniel achou seu espaço, não pensando em exportação – pelo menos, por ora –, mas apostando em carne que pode ser comparada a uma iguaria na cozinha. Seu negócio rende em média R$ 3,5 milhões por mês. MODAMarina Ruy Barbosa, 27  Quando estava na escola, Marina brincava que era dona de uma marca. Ela não sabia o que venderia, mas o negócio já tinha nome, Ginger. O desejo de empreender seguiu guardado até que a pandemia chegou. Os trabalhos de atriz desaceleraram e deram espaço para a materialização do sonho antigo. Em julho de 2020, ela lançou sua marca de roupas. “A Ginger nasceu da minha paixão por moda e de uma vontade de não fazer o que está dentro da caixa. Não quero seguir uma fórmula do sucesso. Gosto de ter uma marca que assume riscos, que traz ousadia no modelo de negócio, na comunicação e nas peças”, diz ela. Sua primeira coleção esgotou em menos de 12 horas e, nos primeiros dias, reuniu quase 100 mil seguidores no Instagram. Ainda naquele ano, a Ginger teve crescimento de 1.010% em seu faturamento e lançou uma collab com a Schutz, do Grupo Arezzo&Co. Em 2021, a Ginger abriu no Shopping JK Iguatemi, em São Paulo, e, no ano seguinte, no Shopping Leblon, no Rio. Hoje ela está também em Curitiba e em 39 diferentes multimarcas do país. “Quando comecei, nunca tinha feito um business plan, mas me cerquei de pessoas competentes e descobri que o segredo é vender o que você acredita.” Em 2022, a empresa apresentou crescimento de 512% no faturamento dos seis primeiros meses comparado ao mesmo semestre do ano anterior. “Foi tudo muito rápido, mas aprendi a conciliar minha carreira de atriz com a de empreendedora. Entendi que podemos ser múltiplas. Quem foi que disse que a gente tem que ser uma coisa só durante a vida toda?.” MARKETING E PUBLICIDADERicardo Silvestre, 26 Fundador e CEO da Black Influence, Ricardo Silvestre passou 10 anos convivendo com o racismo no mercado publicitário até chegar ao estopim: um burnout. “Não foi apenas a exaustão por excesso de trabalho, mas por estar em ambientes que me violentavam enquanto pessoa e profissional. Na minha recuperação, entendi que eu não tinha outra opção a não ser empreender.” Em 2019, fundou a Black Influence, referência em criadores e influenciadores negros na América Latina. Com uma agência antirracista, seu objetivo é gerar impacto social e aumentar a representatividade de pessoas negras na publicidade. “O mercado está evoluindo, mas a passos lentos. Ainda há muitas marcas com discursos superficiais e que se posicionam só para cumprir protocolo.” Ainda assim, o trabalho da Black Influence ganhou notoriedade. A agência tem projetos com Uber, Amazon Prime Video, Spotify, Pão de Açúcar e outras. Já Ricardo foi eleito uma das 100 personalidades negras mais influentes do mercado lusófono em 2021 pela Bantumen. Em 2022, figurou entre os 100 negros mais influentes do mundo pela MIPAD, iniciativa da ONU com a African Union, e foi indicado ao Caboré como profissional de negócios do ano, sendo o mais jovem da história do prêmio entre os nomeados da categoria. “O que me motiva é saber que esse trabalho, de fato, impacta pessoas como eu, que de alguma forma se sentem mais representadas e pertencentes a esses espaços, sentimentos que nos faltam em muitos aspectos.” MÚSICADjonga, 28 Gustavo Pereira Marques estudou até o último semestre do curso de História na Universidade Federal de Ouro Preto, mas não se formou porque o seu som estourou Brasil afora e ele caiu na estrada para fazer shows. Desde 2017, o rapper nascido em Belo Horizonte (MG) lança discos anualmente, sempre no dia 13 de março: “Heresia” (2017), “O Menino que Queria Ser Deus” (2018), “Ladrão” (2019), “Histórias da Minha Área” (2020) e “NU” (2021). Esses trabalhos resultaram em indicações e premiações importantes – Djonga foi o primeiro rapper brasileiro indicado ao americano BET Awards. Em 2022 ele lançou, no dia 13 de outubro, o álbum “O Dono do Lugar”, que esteve recentemente entre os 10 mais ouvidos no mundo tanto no Spotify quanto no Deezer, além de ter sido destaque em um telão na Times Square, em Nova York. Djonga é também o fundador do selo musical A Quadrilha, que visa potencializar e profissionalizar o trabalho de artistas independentes de Belo Horizonte. TECNOLOGIA E INOVAÇÃOCallebe Mendes, 25 Em 2014, aos 17 anos, Callebe Mendes criou sua primeira empresa. O apetite pelo empreendedorismo não parou por aí. Três anos depois, em 2017, fundou a Zapay, em Brasília, fintech que propõe soluções para economizar tempo e dinheiro dos proprietários de veículo. O ano de 2022 foi especial para a startup, que, além de manter parcerias com empresas como Sem Parar, Porto Seguro, Picpay, ConectCar, Itaú e Santander, viu o volume de transações crescer 150% chegando a mais de R$ 600 milhões. “Nosso objetivo é finalizar o ano de 2024 sendo o primeiro unicórnio do Cerrado. O foco por trás desse valuation é a quantidade de pessoas que iremos impactar: mais de 2,5 milhões de clientes por ano e uma base de usuários muito superior”, afirma. Atualmente, a Zapay está avaliada em centenas de milhões de reais. “Quando fundei a Zapay, tinha em mente que o principal valor dela deveria estar em concordância com meu principal objetivo de vida: impactar positivamente a vida das pessoas. Neste ano, eu e meus sócios Victor Mahon e Pedro Vogado orientamos nosso time a continuar seguindo firme com esse objetivo”, destaca. E o empreendedor quer ir além do crescimento da Zapay tornando-se referência no segmento de fintechs. “Estou ajudando empresários e futuros empreendedores a desenvolverem suas próprias fintechs por meio do programa: ‘Construa sua fintech do Zero.’” TERCEIRO SETOR E EMPREENDEDORISMO SOCIALAlexandre Vasserman, 28 O administrador de empresas paulistano Alexandre Vasserman é o fundador da Infineat, uma filantech que oferece um serviço de gestão que coordena o processo de doação de alimentos de ponta a ponta, sendo o elo entre a empresa e as instituições parceiras, permitindo acesso diário a comida de qualidade para quem mais precisa. “Logo que comecei essa jornada de empreender a primeira filantech do Brasil, em dezembro de 2020, escrevi um objetivo pessoal: ser a maior referência nos temas fome e desperdício no Brasil em quatro anos e, no mundo, em 10 anos”, afirma o CEO. A Infineat já conseguiu redirecionar 1.070 toneladas de alimentos, correspondentes a 1,8 milhão de refeições complementadas. Atualmente, são 80 toneladas redirecionadas por mês, com crescimento de 12 vezes no último ano. Ao todo, já foram mais de R$ 10 milhões em valor de produtos. O objetivo de Alexandre é se tornar a maior plataforma de redirecionamento de alimentos e, assim, gerar mudança social e estabelecer um novo equilíbrio para o sistema alimentar global. “Quero usar meu conhecimento para ajudar a resolver um problema histórico inaceitável, que poucos tentaram e ainda ninguém conseguiu: a fome.” VAREJOPedro Favery Costa, 30 As palavras para definir a trajetória de Costa são relacionamento e diferenciação. Nos anos 1950, sua família fundou a rede Caçula de Pneus. Isso deu a Costa a oportunidade de conhecer a vida de empresário de perto. Ele começou a trabalhar na empresa aos 16 anos. Passou por diversos setores e, em 2013, aos 21 anos, optou pelo setor de alto desempenho: pontos bem localizados que atendiam marcas de luxo e veículos esportivos. Os negócios foram bem até 2018, quando, após alguns anos de pressão, a fabricante de pneus Pirelli, principal fornecedor, comprou o negócio. “Vendemos a empresa, mas mantivemos os imóveis; o negócio da família passou a ser a gestão do patrimônio imobiliário, e isso continua.” Costa aproveitou o relacionamento com os clientes e abriu outra oficina de alto padrão, a Stradale. “O chão não tem graxa, tem mármore travertino”, diz ele. A experiência em vários departamentos da Caçula, do comercial à logística, passando pelo back office, lhe permitiu conseguir eficiência e rentabilidade. “Costumo dizer que sou quase um pediatra, cuido de carros que são quase como filhos para os meus clientes”, diz. Do relacionamento nasceu a diversificação. “Eu sei o que os clientes gostam de fazer nos fins de semana, e desenvolvi um condomínio de luxo sob medida”, diz. O Villa Stradale fica em Piracaia, no interior de São Paulo, às margens da represa de Joanópolis. Segundo Costa, o lançamento em 2023 deverá elevar o faturamento para R$ 60 milhões, ante os R$ 16 milhões em 2022. WEB E E-SPORTSCasimiro, 29 Muito além da consagração de craques como Messi e Mbappé, a Copa do Catar também foi de recordes para um brasileiro em especial: Casimiro Miguel Vieira da Silva, também conhecido apenas como Casimiro ou Cazé. O streamer brasileiro acumulou destaques ao protagonizar um feito histórico: a transmissão da Copa do Mundo para o YouTube e a Twitch. Em parceria com a LiveMode, que fechou com a Fifa a transmissão dos jogos do mundial em redes sociais, Casimiro tem cinco das 11 lives mais assistidas da história do YouTube no mundo. O jogo entre Brasil e Croácia, por exemplo chegou a 8 milhões de pessoas. Ele também se destacou em número de novos seguidores. Durante a Copa, o canal CazéTV no YouTube chegou à marca de 86,5 mil inscritos em apenas um minuto, recorde que era do MrBeast, maior youtuber do mundo, cuja marca era de 72 mil inscritos. O projeto mais importante da carreira de Casimiro lhe rendeu contratos com marcas como McDonald’s, Coca-Cola, iFood, Nubank e Unilever – e estima-se que ele tenha arrecadado mais de R$ 1 milhão somente com esse projeto. No início de 2022, Cazé já havia registrado outro feito histórico quando transmitiu, de forma exclusiva pela Twitch, o primeiro episódio do documentário “Neymar – O Caos Perfeito”, lançado pela Netflix. ARQUITETURA E DESIGNMateus Ferrareto, 25, e Rubens Stuque, 28 De chefe e estagiário a sócios na Eco Flame Garden, a parceria entre Rubens e Mateus evoluiu no desejo comum de empreender. Em 2020, lançaram ao mercado sua proposta para a decoração de ambientes externos: peças que “tropicalizam” a experiência de “fogueira no jardim”. Para casar versatilidade e sofisticação com praticidade e conforto, os acabamentos foram desenvolvidos com tecnologias para facilitar a limpeza, pérolas drenantes no enchimento e tecidos resistentes a raios UV, fungos e mofo. Para acompanhar o processo de inovação, a Eco Flame Garden foi a primeira empresa brasileira nativa digital do segmento com controle sobre todo o ciclo do produto, da fabricação à venda. O trabalho da marca já foi reconhecido por referências da arquitetura, como João Armentano e Paulo Jacobsen, e foi destaque em duas edições Casacor. Entre seus principais clientes, estão grifes de hospitalidade, como a Fazenda Boa Vista e a rede Six Senses Botanique. Em 2022, a receita da companhia saltou 160%, e a perspectiva é triplicar esse faturamento em 2023, para R$ 115 milhões, baseado no seu crescimento no mercado com novos produtos e lojas. Hoje, a Eco Flame Garden tem cinco lojas físicas e 15 espaços de revendas, inclusive no Uruguai e no Paraguai. Agora, os empresários se preparam para inaugurar lojas da marca em Dubai e Miami. Sobre o futuro, a resposta da dupla é uníssona: “Ser a maior marca de lifestyle outdoor do mundo”. Motivação que já está até no código de cultura da empresa.     *Colaboraram: Adriana Cardillo Gaz, Beatriz Pacheco, Kátia Lessa e Lígia Nogueira. Edição: José Vicente Bernardo *** A elaboração da Lista Forbes Under 30 2022 contou com a colaboração dos seguintes especialistas, a quem agradecemos: Allex Colontonio (diretor de conteúdo da ForbesLife Design); Augusto Mariotti (cofundador e Publisher do site de moda FFW); Diego Matos (curador do MuBE); Donata Meirelles (diretora geral da ForbesLife Fashion); Eduardo Gouveia (conselheiro e investidor); Eduardo Tironi (jornalista esportivo da BandSports e UOL); Emilio Fraia (escritor e editor da Companhia das Letras); Evaristo Martins de Azevedo (crítico de arte, membro da APCA e jurado do Prêmio Shell de Teatro); Ferdinando Martins (professor da ECA-USP e jurado dos prêmios Shell SP, Bibi Ferreira e APCA); Gian Oddi (jornalista esportivo da ESPN); Guilherme Junqueira (fundador e CEO da Gama Academy); Jonas Freire (diretor de Esportes de Alto Rendimento do Comitê Paralímpico Brasileiro); Katia Rubio (professora da EEFE-USP e coordenadora do Grupo de Estudos Olímpicos); Larissa Januário (chef e apresentadora do canal Sabor & Arte); Marllos Silva (diretor, dramaturgo e idealizador do Prêmio Bibi Ferreira); Miguel Arcanjo Prado (crítico de artes); Raul Penteado (diretor geral da ForbesLife Design); Ricardo Perrone (jornalista esportivo do UOL); Roberta Martinelli (radialista e apresentadora); Ronaldo Bressane (escritor, jornalista e professor de literatura); Saulo Barreto (conselheiro do Instituto de Pesquisas em Tecnologia e Inovação); Sérgio Martins (jornalista musical, apresentador e professor de jornalismo cultural); Sylvain Justum (redator chefe da ForbesLife Fashion); Tiago Alves (CEO Brasil da Regus & Spaces). Capa da edição 104 da Forbes Brasil, de dezembro de 2022 Lista Forbes Under 30 2021: veja todos os homenageados Under 30 2020: 90 destaques brasileiros abaixo dos 30 anos Under 30 2019: Os 90 destaques brasileiros Under 30 2018: 90 destaques brasileiros abaixo dos 30 anos Under 30 2017: 91 destaques brasileiros abaixo dos 30 anos Under 30 2016: 30 jovens mais promissores do Brasil abaixo dos 30 anos Under 30 2015: 30 destaques brasileiros abaixo dos 30 anos Under 30 2014: 30 destaques brasileiros abaixo dos 30 anos Siga Forbes Brasil nas redes sociais: FacebookTwitterInstagramYouTubeLinkedIn Siga Forbes Money no Telegram e tenha acesso a notícias do mercado financeiro em primeira mão Baixe o app da Forbes Brasil na App Store ou na Play Store    © Forbes 2023. Todos os direitos reservados.", "url": "https://forbes.com.br/forbeslife/2022/12/lista-forbes-under-30-2022-veja-destaques-das-15-categorias/", "threshold": 1.0}