{"title": "Sobre - Forbes Brasil", "content": "Início / Sobre Forbes, a mais conceituada revista de negócios e economia do mundo, chegou ao Brasil em agosto de 2012 seguindo o mesmo padrão editorial que fez da marca sinônimo de seriedade e credibilidade, com 100 anos de história. Desde sua chegada, a revista retrata o que há de melhor no mundo empresarial econômico. Em suas capas figuram nomes como o ex-presidente Fernando Henrique Cardoso, o empresário Abilio Diniz e o homem mais rico do Brasil, Jorge Paulo Lemann. Forbes traz reportagens nacionais e internacionais abordando os principais assuntos do mercado e as tendências da economia, além de entrevistas que mostram um panorama exato do mundo dos negócios. Tudo isso sem deixar de lado a seção de lifestyle que apresenta os mais exclusivos produtos e serviços para seus leitores. CEO/PublisherAntonio Camarotti Editor-chefe de conteúdoJosé Vicente Bernardo Head de conteúdos digitaisDaniel Tozzi Editores de conteúdoClaudio Gradilone (Forbes Money)Décio GalinaFabiana Corrêa (Carreira e Forbes Mulher)Luiz Gustavo Pacete (Tech)Mariana WeberRodrigo Mora (Forbes Motors)Vera Ondei (Forbes Agro) Subeditora de conteúdos digitaisIsadora Tega ReportagemAndressa Barbosa (estagiária)Fernanda AlmeidaGabriela Guido (estagiária)Giovanna SimonettiLívia Della Volpe (estagiária)Naty FallaMonique LimaVitória Fernandes Redes sociaisKyra Piscitelli (head de redes sociais)André AguiarCaroline de Tilia Fernandes (estagiária)Laura de Luca Pereira Lima (estagiária) AudiovisualMatheus Perazzo Diretor de criaçãoCiro Girard DesignPedro Nascimento Head de produtoAlexandre Mercki Web DesignGuilherme Lima BI e Analytics Rafael Marinho ArticulistasAndré FelicíssimoArthur GuerraCaio PenidoCarla BollaCarolina Schoof CentolaCarmen PerezClaudio LottenbergDonata MeirellesEduardo MiraEduardo RauenFernanda AbilelFernando MalufFlávia CamanhoFlávio AugustoFlávio RochaJosé Carlos SemenzatoJu FerrazJurandir Sell Macedo Jr.Helen JacinthoIona SzkurnikIsabela MatteDra. Letícia NanciLygia PimentelLuciana RodriguesMárcio CrisóstomoMario GarneroNelson WiliansPaula Drumond SetubalRafael AzziRoberto RodriguesSteve Forbes TraduçãoCesar Sarkis Guludjian RevisãoPatrícia Scaravelli Sbrissa Head comercialCarol Wehba[email protected] ComercialAudrey Rodrigues Santos (assistente)Fernanda Karine Ramos Botega (Executiva de negócios)Diogo Yukio Uehara (estagiário)Madalena Biancardi (Executiva de negócios)[email protected]Maria Stella Abreu (Executiva de negócios)[email protected]Rosemere Marques (assistente)Silvana Recchia (Executiva de negócios)[email protected] Head de operaçõesGilmar Von Dörff[email protected] OperacionalIngrid Bydlowsky (analista financeiro & operações)Lucimar Maróstica (supervisora financeiro & assinaturas) Head de comunicaçãoCécilia Saint-Viteux Head de eventosLaura Speggiorin ImpressãoLog&Print Gráfica e Logística Contato[email protected][email protected][email protected] Telefone+55 (11) 3797-6777 Forbes Brasil© é publicada pela FRBS Participações S.A. sob acordo de licenciamento da Forbes Media LLC, 60 Fifth Avenue, New York, New York 10011. A ©2022 Forbes é uma marca registrada e usada sob a licença da FORBES LLC. Todos os direitos reservados. ©2023 FRBS Participações S.A. Os artigos assinados são de responsabilidade exclusiva dos autores e não refletem, necessariamente, a opinião de Forbes Brasil e de seus editores.  © Forbes 2023. Todos os direitos reservados.", "url": "https://forbes.com.br/sobre-2/", "threshold": 0.8321828102541555}