{"title": "Under 30 2017: 91 destaques brasileiros abaixo dos 30 anos - Forbes", "content": "Início / Listas / Under 30 2017: 91 destaques brasileiros abaixo dos 30 anos Em diferentes lugares do país, em diferentes áreas de atuação, essas pessoas têm duas coisas em comum: primeiro, são jovens (têm no máximo 30 anos); segundo, eles fazem a diferença. O perfil de todos os eleitos está na revista, que chega hoje às bancas. LEIA MAIS: 20 maiores bilionários do mundo em 2017 PARA COMPOR ESTA LISTA, CONTAMOS COM A AJUDA DE VALIOSOS CONSELHEIROS, A QUEM AGRADECEMOS:Act10n, Andrea Chamma, Associação Brasileira de Startups, Bia Granja, Billboard, Caio Ribeiro, Camila von Holdefer, Cubo Coworking Itaú, Daniel Castro, Desenvolve São Paulo, Fátima Pissarra, Fernanda Gentil, Gloria Kalil, InovaBra, Isabela Boscov, João Armando Vannucci, João Marcelo Bôscoli, Juca Kfouri, Kyra Piscitelli, Lilian Pacce, PR Newswire, Rede Mulher Empreendedora, Rick Bonadio, Sérgio Xavier e Think Olga ESPORTE Daniel Dias Ele é uma máquina de bater recordes e acumular medalhas. Daniel de Faria Dias nasceu em 1988 em Campinas (SP) com limitações nos dois braços e na perna direita. Filho único, passou a infância em Camanducaia (MG). “Quando vi pela TV a Paralimpíada de 2004, descobri que existia esporte para pessoas como eu. Pensei: ‘Quem sabe um dia eu também não possa fazer isso?’.” Tinha 16 anos. Logo depois, seu pai assistiu a uma palestra de Steven Dubner, presidente da Associação Desportiva para Deficientes (ADD). “Viemos a São Paulo para conhecer o esporte adaptado. Foi meu primeiro contato com aulas de natação.” A professora da ADD ficou espantada: em apenas oito aulas, Daniel aprendeu os quatro estilos da natação (borboleta, peito, costas e crawl). Ela sugeriu que ele se dedicasse ao esporte, e para isso a família mudou-se para Bragança, no interior paulista. Logo na primeira competição, em 2005, ao lado de paratletas experientes, os mesmos que via na TV, ganhou dois bronzes. “Costumo dizer que essa foi minha braçada inicial.” Em 2006, em seu primeiro Mundial, ganhou duas medalhas de ouro e não parou mais. Em 2009, recebeu o troféu Laureus, o “Oscar do esporte”, honra que divide com outros três brasileiros: Pelé, Ronaldo Fenômeno e Bob Burnquist. Na Rio 2016, Daniel ganhou quatro medalhas de ouro (nove no total). Tornou-se o nadador com o maior número de medalhas paralímpicas (24) da história. ESPORTE Bruninho Bruno Mossa de Rezende, 30 anos, não poderia ser outra coisa na vida. Filho do técnico e ex-jogador Bernardinho e de Vera Mossa, musa da seleção brasileira nos anos 80, ele diz que começou a jogar vôlei “na barriga da mãe”. Aos 14 anos, começou a levar o esporte a sério. Aos 17, profissionalizou-se e rodou o mundo. Depois de duas grandes frustrações nas Olimpíadas de 2008 e 2012, Bruninho (que se acha “baixinho” com seu 1,90 metro) alcançou a glória na Rio 2016, vencendo a Itália na final. Ao colocar a medalha de ouro no pescoço, superou os próprios pais. E ainda foi eleito o melhor levantador da competição. “Representar meu país foi a coisa mais emblemática e emocionante que eu pude experimentar. Ouvir o hino nacional quando a gente está no alto do pódio dá muito orgulho, é a coisa mais bacana que pode acontecer para um atleta”, diz. Carioca, ele conta que ganhar a medalha de ouro no Maracanãzinho teve um sabor especial. “Foi como jogar no quintal de casa. Ter tantos amigos e familiares ao meu lado deixou a conquista ainda mais importante depois de tudo o que a gente passou. Eu vinha de duas medalhas de prata, e a redenção em casa foi o script perfeito.” Depois de três anos jogando na Itália, hoje ele defende o Sesi de São Paulo. ESPORTE Kahena Kunze & Martine Grael Para muita gente, o ouro inédito na vela feminina brasileira, conquistado por Martine Grael, 26 anos, e Kahena Kunze, 25, foi, de longe, o resultado mais inesperado do país nos Jogos Olímpicos do Rio de Janeiro. Uma surpresa até para a própria Martine. “Claro que eu sempre sonhei com uma alta performance no esporte, mas nunca imaginei uma medalha de ouro”, conta. O que poucos sabem, porém, é que a dupla construiu um caminho sólido até a competição, com títulos desde as categorias de base. Ainda adolescentes, faturaram o Mundial Júnior na classe 420. Em 2014, subiram de patamar com o título mundial no 49er FX em Santander, na Espanha. O auge acabaria por chegar em 2016. “Conseguimos chegar ao ‘Everest’ da modalidade. Meu sonho está realizado”, diz Kahena, que garante a manutenção da parceria com Martine por, pelo menos, mais um ciclo olímpico. “Quero disputar em outro país. Uma coisa é ganhar no Brasil. Agora estamos mais visadas pelas adversárias, então teremos que mudar um pouco a nossa estratégia de treinamento.” As jovens campeãs olímpicas tentam fazer planos para o futuro. Ambas começaram o curso de engenharia ambiental, precisaram parar em função do esporte, mas, garantem, pretendem concluí-lo. “Eu também gostaria de dar a volta ao mundo velejando. Competindo ou não. Espero, ainda, ajudar a difundir a vela para os mais jovens por meio de algum projeto social. Mas não sei, por enquanto, como nem quando fazer”, confessa Kahena. ESPORTE 1.\tRafaela Silva Nada como um dia depois do outro. Em 2012, Rafaela Silva foi desclassificada nos Jogos Olímpicos de Londres nas oitavas de final, por causa de um golpe considerado irregular. Logo após a luta, foi vítima de injúrias raciais vindas das redes sociais. Pensou em abandonar o esporte, mas logo foi dissuadida da ideia, para sorte do esporte brasileiro. No Rio, a peso leve venceu todas as suas adversárias, coroando uma campanha impecável diante da mongol Dorjsürengiin Sumiyaa. 2.\tBruno Schmidt Sobrinho de Oscar Schmidt, Bruno foi testar seus predicados no esporte em outra praia. Mais precisamente, no vôlei de praia. Ao lado de Alison, faturou nos Jogos do Rio o único prêmio que lhes faltava: o ouro olímpico. 3.\tCasemiro Com Dunga ainda no comando da seleção, Casemiro cavou seu espaço como primeiro volante. Apesar do fiasco na Copa América Centenário, ele não comprometeu. No fantástico Real Madrid, deu a sustentação que faltava ao meio-campo. Titular incontestável de Zidane, foi um dos melhores jogadores do time no título da Liga dos Campeões 2015/2016. 4.\tThiago Braz  Até os Jogos do Rio, Fabiana Murer era a única esperança brasileira de um pódio no salto com vara. Era. Thiago Braz saltou 6,03 metros, bateu o superfavorito Renaud Lavillenie, da França, e faturou um inédito ouro para o país. 5.\tIzaquias Queiroz Izaquias é um predestinado. Afinal, o que esperar de um rapaz que nasceu em uma cidade chamada Ubaitaba, cujo significado em tupi-guarani é “cidade das canoas”? No seu debute em Olimpíadas, o canoísta subiu ao pódio em três oportunidades, número que o deixa isoladamente como o maior medalhista do Brasil em uma única edição dos Jogos. 6.\tGabriel Jesus Gabriel Jesus fez “barba, cabelo e bigode” em 2016. Pelo Palmeiras, venceu o Campeonato Brasileiro sendo o principal artilheiro do time. Com a camisa da seleção, foi ouro na Olimpíada. E marcou cinco gols em seis jogos pelas Eliminatórias para a Copa do Mundo. Por fim, teve sua venda para o Manchester City confirmada por R$ 121 milhões. 7.\tRobson Conceição Baiano de nascimento, Robson começou a dar seus primeiros socos em Salvador, terra que também mostrou ao mundo Acelino “Popó” Freitas. Depois de uma prata no Pan de 2011, atingiu seu ápice físico e técnico na Olimpíada do Rio. Na decisão pelo ouro, contra o francês Sofiane Oumiha, venceu por unanimidade dos jurados. CINEMA, TELEVISÃO & TEATRO Caio Castro Ao vencer um concurso no programa Caldeirão do Huck, na TV Globo, em 2007, que lhe deu o direito de integrar o elenco da novela adolescente Malhação, Caio Castro não imaginava que sua ascensão fosse tão rápida. “Superou as expectativas”, afirma, ao relembrar sua trajetória. Hoje, aos 28 anos, coleciona participações e protagonismos em novelas de sucesso na emissora. Em 2012, Caio se deu o direito de tirar um ano sabático após cinco anos de trabalho ininterrupto. “Larguei contrato de longo prazo e bem remunerado para fazer um balanço”, conta, classificando a decisão como fundamental para uma guinada na carreira. Direcionou todo o foco para seu aperfeiçoamento. Dessa forma, obteve maior liberdade para escolher papéis que lhe rendessem mais sucesso. De quebra, ainda lançou um livro sobre esse período, com fotos e textos escritos durante as viagens que realizou. Caio está prestes a estrear Novo Mundo, novela de época na qual interpretará seu primeiro personagem histórico, o imperador dom Pedro I. “Estou encantado, é muito diferente das outras novelas”, diz. Também estará no cinema em 2017 interpretando Júlio no filme Travessia, com estreia em 23 de março. Para completar um ano intenso, prepara o lançamento de seu segundo livro, que vai divulgar fotos e relatos sobre uma viagem de carro da Califórnia a São Paulo. CINEMA, TELEVISÃO & TEATRO Sophia Abrahão Segundo a velha tradição, quando uma garota completa 15 anos, ela passa a ser vista como mulher pela sociedade. Enquanto algumas fazem festas animadíssimas e outras preferem viagens ao exterior, Sophia Abrahão teve um presente inusitado: sua estreia na televisão, na novela Malhação. Hoje, dez anos depois do início, a atriz e cantora pretende surfar menos as ondas que a vida traz e analisar melhor cada oportunidade. “A palavra do ano é ‘planejamento’. Quero avaliar mais – 2016 foi meu melhor ano profissional e agora tenho maturidade para fazer escolhas.” A paulistana, que já passou pela Record, onde fez parte da novela Rebelde – que lhe trouxe fama nacional –, agora trabalha na Globo. Na emissora, participou das novelas Amor à Vida, Alto Astral e A Lei do Amor. Ao fazer uma análise da década de trabalho e do que já conquistou, a atriz acredita que ainda há muito pela frente. “Já consigo viver em paz. As incertezas da profissão passaram e vivo sem me preocupar muito com o amanhã.” Em 2017, Sophia tem projetos como apresentadora e aguarda respostas de testes para novos personagens na TV. Seu desejo profissional para o futuro? “Quero chegar a um ponto em que possa escolher papéis mais desafiadores, que me tirem da minha da minha zona de conforto.” CINEMA, TELEVISÃO & TEATRO Bruno Gissoni, Rodrigo Simas & Felipe Simas Nascer em um ambiente artístico contribuiu para que Bruno, 30 anos, Rodrigo, 25, e Felipe, 24, escolhessem a carreira na dramaturgia. “Tivemos apoio total”, diz Bruno, fi lho da produtora Ana Paula Sang e enteado do ator Beto Simas, pai de Rodrigo e Felipe. Era Beto quem levava os meninos, ainda crianças, para suas peças de teatro, como Péricles, o Príncipe do Tiro, marcada na memória do trio. “O cheiro do teatro fi cou guardado em mim”, lembra Rodrigo. Beto também os influenciou no esporte, já que é instrutor de capoeira. Os três praticam a modalidade e a adotam como fi losofi a de vida. “Ela faz parte do nosso ser, seja no palco, seja no set de fi lmagem”, diz o caçula. Bruno e Felipe tentaram ser jogadores de futebol, mas o lado artístico falou mais alto. “O teatro chegou para preencher a desistência do sonho de ser atleta profi ssional”, afi rma Bruno, enquanto Felipe reforça que uma atuação, em 2012, foi primordial para que abraçasse de vez a profi ssão. Já Rodrigo decidiu pela carreira aos 15 anos. Com o inglês fl uente devido aos quase dez anos que morou nos Estados Unidos com a família, o jovem chegou a fazer testes para participar da saga Crepúsculo. “Quero fazer personagens que me desafi em como ator”, diz, explicando que seu primeiro objetivo é aprimorar a atuação, e depois tentar a carreira internacional. Em 2016, Rodrigo viajou pelo Brasil para encenar Dois Perdidos Numa Noite Suja, peça de Plínio Marcos que estará em cartaz neste ano no Rio e em São Paulo. Em paralelo, o irmão do meio estará no elenco da nova novela das 6 da Globo, Novo Mundo. Bruno começou 2017 com muita emoção: o mais jovem dos irmãos foi pai pela segunda vez. Sentimento que o primogênito Bruno vai experimentar em meados do ano. Ele também planeja produzir uma peça de sua autoria. CINEMA, TELEVISÃO & TEATRO 1.\tIsabella Santoni Logo em seu primeiro papel de destaque na TV, na novela A Lei do Amor, Isabella Santoni arrebatou. Na pele de Letícia Bezerra, ela viveu, no início do folhetim, o sofrimento de uma portadora de leucemia. Por causa disso, precisou raspar a cabeça. Antes, já havia mostrado o talento e a beleza em Malhação e Ligações Perigosas. 2.\tFiuk Cantor, compositor e ator, encarou no fim de 2016 uma nova empreitada, dublando o filme Sing – Quem Canta Seus Males Espanta. Gravou ainda dois CDs, participou de Malhação e será o galã da próxima novela das 9, A Força do Querer. 3.\tMyra Ruiz Myra dava fortes indícios de que levaria uma vida de atleta, com suas aulas regulares de ginástica olímpica. Até participar de um musical promovido por sua professora de balé. Seu destino já estava traçado. Entre os papéis de destaque estão a prostituta Saraghina em Nine – Um Musical Felliniano, a bruxa Elphaba em Wicked e Maureen na versão brasileira de Rent, que ainda está em cartaz. 4.\tNathalia Dill A atriz foi bastante requisitada em 2016. Primeiro, fez rápida aparição em Êta Mundo Bom! como Anastácia de Goytacases. Na sequência, viveu Branca Farto em Liberdade, Liberdade. Para fechar, multiplicou- se para encarnar as gêmeas Júlia e Lorena Monteiro em Rock Story. 5.\tJesuíta Barbosa Não é de hoje que seu trabalho vem recebendo elogios. Cria do cinema pernambucano, Jesuíta Barbosa ganhou repercussão nacional em 2014 com a novela O Rebu. Mas o melhor ainda estava por vir. Em 2016, interpretou o controverso Vicente Menezes na ótima minissérie Justiça. Neste ano, engata dois papéis no cinema. 6.\tGabriel Leone A desenvoltura com que Gabriel Leone interpretou Miguel de Sá Ribeiro em Velho Chico foi um dos pontos altos da novela. Não à toa, venceu a categoria Melhor Ator no Prêmio Jovem Brasileiro. E este ano a agenda está lotada para esta revelação da teledramaturgia, com novela (Os Dias Eram Assim), filme (será o intérprete de Roberto Carlos em Minha Fama de Mau) e teatro. 7.\tJuliana Paiva 2016 foi um ano de consolidação para Juliana. Muito graças a sua personagem Cassandra, uma aspirante a top model na novela Totalmente Demais. Moda, aliás, é território mais do que conhecido para ela. Dos 9 aos 19 anos, desfilou Brasil afora e estampou diversas campanhas publicitárias. Em 2017, voltará aos holofotes em A Força do Querer. INFLUENCIADORES DIGITAIS Rezendeevil Talvez você não o conheça. Mas é quase certo que seus filhos, sobrinhos ou até netos sejam fanáticos por ele. Pedro Afonso Rezende Posso, ou rezendeevil, como é conhecido, é um dos maiores fenômenos do YouTube no Brasil. Seu canal tem quase 11 milhões de inscritos. O carro-chefe de sua produção é o jogo Minecraft, o segundo game mais vendido do planeta. Pedro é uma espécie de comentarista interativo do game, em cima do qual cria histórias. Também produz pegadinhas, desafios e vídeos engraçados. “Comecei cinco anos atrás, aos 15 anos. Eu jogava muito videogame e, quando não conseguia passar de fase, procurava ajuda no YouTube”, conta. “Fiquei com vontade de fazer aquilo também e comecei a gravar os vídeos.” Logo chegou aos 350 mil seguidores. Mas esse, na verdade, era seu segundo hobby. O primeiro era futebol – tanto que, a essa altura, saiu de Londrina, onde mora, e foi jogar futsal na Itália. “Tive alguns problemas lá, seis meses depois voltei e foquei no canal. Aí cheguei a 1 milhão de inscritos e comecei a ter retorno financeiro.” Lembra que a primeira bolada foi de R$ 15 mil. Hoje, com uma equipe de 40 pessoas, também faz publicidade, teatro e livros – seus três títulos já venderam mais de 300 mil exemplares. INFLUENCIADORES DIGITAIS Thaynara OG A mãe a ouvia falando alto fechada no quarto e cismava: “Essa menina trouxe alguém para casa ou endoidou?” Um dia, andando pelas ruas de São Luís, no Maranhão, onde mora, Thaynara (Oliveira Gomes, vulgo OG) foi parada por fãs. A mãe entendeu menos ainda. “Como assim? Você está famosa?” A filha explicou: desde março de 2015 ela postava vídeos pelo Snapchat e já tinha uma legião de seguidores. “Fiz faculdade de direito, como todo mundo na família, e queria prestar concurso para a Defensoria Pública da União. Minha rotina de estudos era muito pesada e solitária. Meus amigos se mudaram de São Luís, terminei o namoro, eu ficava muito tempo com os livros. Então fazia os vídeos só para os amigos, para espairecer”, conta. Em outubro daquele ano, perdeu a vergonha e tornou o perfil público. Em fevereiro de 2016, a internet virou sua profissão – hoje é considerada a maior snapchater do país. Até a mãe passou a participar. “Mostro meu dia a dia de um jeito criativo e divertido.” Quase 2 milhões de pessoas acompanham Thaynara OG no Instagram e outros tantos no Snapchat. Hoje, aos 25 anos, ela desistiu do concurso e vive do que ganha nas redes sociais. Foi indicada para o Kids’ Choice Awards (do canal Nickelodeon), maior premiação do gênero no mundo, como Personalidade Brasileira. Ainda mora com os pais – “mas já tenho minha independência”. INFLUENCIADORES DIGITAIS Paola Antonini O ano passado foi classificado como surpreendente pela modelo Paola Antonini. A mineira de 22 anos tornou-se uma das principais influenciadoras nas redes sociais ao mostrar o seu dia a dia em fotos e vídeos. Mas, diferente do que fazem as jovens de sua idade que se aventuram pelas mídias sociais, Paola deixa uma mensagem de inspiração em suas publicações: “A deficiência não define as pessoas e não é impeditiva”. Paola teve que amputar a perna esquerda após ser atropelada, no Natal de 2014, por uma motorista embriagada. Um acidente que levaria muita gente à tristeza e depressão foi revertido e encarado de outra maneira por ela. A bela jovem agradece por estar viva e usa as redes para demonstrar sua felicidade. A visibilidade fez com que fosse escolhida como musa da Paralimpíada. “Foi inesperado”, diz sobre a experiência no Rio de Janeiro, onde acompanhou o evento de perto. Paola se emociona ao contar que pessoas com deficiência e com dificuldade de autoaceitação enviam-lhe mensagens dizendo que ela é uma fonte de inspiração. O trabalho como modelo reflete isso. Ela acredita que as grifes estão, cada vez mais, aceitando as diferenças e que ela é um dos ícones que marcam essa mudança na moda. Todas essas experiências vão ilustrar um livro – o próximo projeto de Paola. No longo prazo, seu desejo é criar uma ONG que auxilie crianças com deficiência e câncer, ampliando o trabalho voluntário que já realiza no grupo Ombro Amigo. INFLUENCIADORES DIGITAIS 1.\tFelipe Neto Dá para afirmar com tranquilidade que Felipe Neto é um dos pioneiros no Brasil a aparecer no YouTube falando sobre assuntos aleatórios. No seu caso, críticas às celebridades. No ar desde 2010, Felipe, atualmente com 29 anos, foi o primeiro youtuber brasileiro a atingir a marca de 1 milhão de assinantes em seu canal. Hoje ele é também um homem de negócios, na condição de fundador da Paramaker, empresa que detém canais como IGN Brasil Network e Parafernalha. 2.\tWhindersson Nunes É contando piadas do cotidiano e fazendo os outros rirem que Whindersson Nunes, de 22 anos, dominou a internet brasileira. O piauiense produz vídeos de humor no YouTube desde 2013, mas foi em 2016 que essa “brincadeira” ganhou proporções gigantescas. Desde outubro passado, ele é o brasileiro que acumula o maior número de inscritos em um único canal do site de vídeos: 17 milhões. No mundo, ele é o 34º do ranking. 3.\tJout Jout Julia Tolezano, ou Jout Jout, 26 anos, é uma espécie de porta-voz das brasileiras entre 20 e 35 anos. No seu canal no YouTube, o Jout Jout Prazer, com mais de 1 milhão de assinantes, fala de cenas típicas do cotidiano feminino com sotaque carioca carregado e jeito escrachado. 4.\tJúlio Cocielo A morte de um animal de estimação é, invariavelmente, dolorosa. Mas, em alguns casos, pode inspirar. Fenômeno da internet brasileira, Júlio Cocielo, 23 anos, criou o Canal Canalha como válvula de escape para superar a perda do seu cachorrinho, em 2011. A “distração” deu certo. Cocielo é detentor do terceiro maior canal do YouTube no Brasil, com mais de 11,5 milhões de inscritos. Celebridade, ele é facilmente visto em programas de TV. 5.\tKonrad Cunha Dantas É na sua produtora, a KondZilla, que Konrad Cunha Dantas, 28 anos, fortalece a cena do funk paulista. Ele já colocou no ar gente como MC Bin Laden e MC Guimê. Em seis anos, produziu mais de 250 clipes. No YouTube, seu canal já tem mais de 10 milhões de inscritos. 6.\tBianca Andrade Nascida e criada no Complexo da Maré, comunidade no subúrbio do Rio de Janeiro, Bianca Andrade, 22 anos, teve o grande “estalo” da sua vida ao assistir a tutoriais de maquiagem no YouTube. Inspirada, formou-se em maquiagem e criou o Boca Rosa. 7.\tChristian Figueiredo Nem parece que Christian Figueiredo tem só 22 anos. O rapaz de Blumenau já tem dois canais no YouTube (Eu Fico Loko, com mais de 7 milhões de inscritos, e Christian Figueiredo, com pouco mais de 3 milhões), dois livros, dois filmes e várias campanhas publicitárias. Em 2016, apresentou o quadro Me Conta Lá no Quarto, no Fantástico, onde falava com bom humor sobre os dilemas da adolescência. MÚSICA Ludmilla Às vésperas de completar 22 anos, a carioca Ludmilla Oliveira da Silva já tem uma agenda digna de popstar. Que o diga 2016. A funkeira encarou uma média de 20 shows por mês no ano passado, gravou o seu segundo álbum, A Danada Sou Eu (Warner), participou de um número sem fim de eventos de divulgação e programas de televisão, mostrou samba no pé em ensaios e desfiles carnavalescos e ainda arrumou tempo para registrar ocorrência policial sobre ofensas raciais cometidas contra ela nas redes sociais. “Eu não tinha noção de aonde chegaria. Só queria cantar”, revela Lud, como é carinhosamente chamada, que até 2013 se apresentava sob a alcunha MC Beyoncé, uma homenagem à diva pop norte-americana, a segunda mulher da música em número de prêmios Grammy (22). Das coisas que o sucesso lhe proporcionou, diz que o mais importante foi ter condições de cumprir a promessa que fez para a mãe e para a avó. “Eu disse que ia cuidar delas. E é isso que estou fazendo atualmente.” O sucesso, não entanto, não a fez esquecer antigos e bons momentos. “Sinto falta de ficar no portão, à toa. De encontrar as amigas na barraca do x-tudo e fofocar”, lembra. Mas volta para sua nova realidade imediatamente quando o assunto é o futuro. “Quero falar inglês e espanhol, ter uma carreira internacional.” MÚSICA Alok Alok Achkar Peres Petrillo, 25 anos, que apesar do nome indiano-libanês-espanhol-italiano nasceu em Goiânia, é mundialmente conhecido como DJ Alok. Sim, mundialmente – sua música Hear Me Now (em parceria com Bruno Martini) já foi ouvida mais de 100 milhões de vezes no Spotify (num ritmo de 13 milhões de audições por semana). Isso fez dele um Top 30 global no maior serviço de streaming musical do planeta (na Billboard, a música chegou ao 20º lugar). No YouTube são outros 45 milhões de execuções. “Acho que em 2016 consegui lançar muitas músicas que estavam prontas, por isso veio esse boom”, explica, com surpreendente humildade. “Frequento festas eletrônicas desde os 6 anos – meus pais também são DJs. Comecei a tocar profissionalmente aos 12 anos junto com meu irmão gêmeo, Bhaskar. Em 2010 parti para carreira solo”, conta. Hoje Alok passa mais tempo fora do Brasil do que em sua casa, em São Paulo. Vai passar dois meses na China. “Lá eles não usam YouTube, Facebook, nada disso, só a rede social do governo. A referência que eles têm em música eletrônica é a revista DJ Mag, e eu aparecia como o 25º melhor. Os que estavam na minha frente não quiseram se arriscar na Ásia. Eu fui e acabei ficando conhecido.” Tão conhecido que fechou um generoso contrato de 16 shows e ações publicitárias com a Budweiser em solo chinês. MÚSICA Zé Neto & Cristiano Quem não conhece a balada sertaneja Seu Polícia ou é muito distraído ou não é deste planeta. A música foi a mais tocada nas rádios brasileiras no ano passado, segundo a Crowley Broadcast Analysis, empresa especializada em gravação e monitoramento. As vozes que entoam o hit são da dupla Zé Neto & Cristiano, 27 e 28 anos, respectivamente, amigos de infância da zona rural de São José do Rio Preto, interior de São Paulo. Em seis anos de carreira, os jovens já tinham colocado outras músicas nos rankings – como Eu Ligo pra Você e Eu Te Amo – mas não com tanto destaque. O clipe de Seu Polícia no YouTube registra quase 170 milhões de visualizações. “Eu jamais imaginei alcançar tudo isso”, confessa Cristiano. “Achei o assédio um pouco assustador no começo, mas hoje o considero um termômetro do nosso trabalho.” Segundo ele, também assusta constatar que muitas coisas com as quais sonhou são, hoje, realidade. “Sempre fui aficionado por jogos eletrônicos. Meu maior desejo era ter um supercomputador. Hoje eu consegui”, conta, mencionando também a coleção de mais de 20 action fi gures que mantém em casa. O bom momento na carreira artística viabilizou investimentos em áreas menos efêmeras, que assegurem algumas garantias no futuro. Cristiano aplicou em imóveis, enquanto Zé Neto manteve suas raízes e optou por cabeças de gado. Resolvida a parte prática, os sonhos continuam. “Tive um tio que precisou ser tratado no Hospital do Câncer de Barretos, que é referência e recebe muita gente de outros estados. Gostaria de um dia construir um lugar que pudesse abrigar as famílias dos pacientes durante o período de tratamento”, revela Cristiano. MÚSICA 1.\tAnavitória Ana Clara Caetano e Vitória Falcão. Ou Anavitória, sem espaço entre um nome e outro. A dupla de Araguaína, Tocantins, precisou recorrer a um crowdfunding para gravar seu álbum de estreia em 2016, que contou com a produção de Tiago Iorc. Hoje, o canal das meninas – que classificam seu som como pop rural – no YouTube tem 200 mil inscritos e mais de 14 milhões de visualizações. 2.\tMarília Mendonça A vida dessa goiana de 21 anos começou a mudar em 2015, graças a uma participação especial em duas canções da dupla sertaneja Henrique & Juliano. No ano seguinte, a cantora já era febre, com o lançamento do disco Marília Mendonça: Ao Vivo. Com quase 140 milhões de visualizações, o hit Infiel é a quarta canção brasileira mais assistida no YouTube. No fim de 2016, Marília se lançou como modelo, ao posar para uma nova marca de lingerie. 3.\tKarol Conka Letras marcantes, voz e postura inconfundíveis. Karol Conka já indicava um futuro brilhante em 2011, quando foi eleita “Aposta” do rap nacional no VMB. Desde então, são prêmios, um álbum e várias campanhas publicitárias. 4.\tVintage Culture Vintage Culture (ou Lukas Ruiz, para os íntimos), 23 anos, ocupa um lugar de destaque na cena eletrônica. Em 2012, ganhou notoriedade ao fazer uma versão para Blue Monday, clássico do New Order. Ocupa o 54º lugar na lista dos 100 melhores DJs da revista britânica DJ Mag. 5.\tMaria Brasil As redes sociais explicam parte do sucesso de um artista. É o caso de Maria Brasil. Seu canal no YouTube tem mais de 30 mil inscritos; no Instagram, a barreira do 1 milhão está próxima de ser rompida. Além de músicas autorais, Maria não abre mão de um cover. No repertório, sucessos que vão de Hey Jude, dos Beatles, a Blank Space, de Taylor Swift. 6.\tMaiara & Maraisa Irmãos formando duplas sertanejas é algo muito comum. Irmãos gêmeos, nem tanto. Irmãs gêmeas, menos ainda. Nascidas em São José dos Quatro Marcos, no Mato Grosso, Maiara e Maraisa, 29 anos, garantiram um lugar no ranking das músicas mais tocadas do Brasil com a canção 10%, lançada em 2015, sob a consultoria de Jorge, da dupla Jorge & Mateus. No ano passado, chegaram ao topo das paradas com o álbum Ao Vivo em Goiânia. 7.\tLiniker Liniker desafia o lugar-comum. De brincos, batom, colar ou turbante, arrebanha fãs por onde passa. Com a banda Caramelows, leva no nome a homenagem a um ex-jogador de futebol, o inglês Gary Lineker. Ideia do tio. Seu som é uma mistura de black music e soul. No YouTube, soma mais de 11 milhões de visualizações. Até a pré-adolescência, Liniker evitava cantar porque sentia muita vergonha. LITERATURA Larissa Manoela O nome de Larissa Manoela, 16 anos, remete à personagem Maria Joaquina, interpretada por ela no remake brasileiro da novela mexicana Carrossel, exibida pelo SBT. O sucesso da novela infantojuvenil impulsionou sua carreira de atriz, cantora, dubladora e modelo, transformando-a em uma das maiores estrelas teens do país. Em 2016, outro talento da menina foi apresentado ao público: o de escritora, com o lançamento de O Diário de Larissa Manoela. “Fiquei surpresa”, revela, ao comentar o sucesso. O livro é o segundo no ranking dos autores brasileiros mais vendidos do ano, com 179 mil exemplares. E esse é somente o início de sua carreira de escritora: ela já começou a preparar a segunda obra, uma continuação do trabalho de estreia. Larissa revelou que gosta de escrever desde criança, quando começou seu diário, aos 7 anos. Inicialmente foi contatada pelas editoras para escrever um livro de ficção ou sua biografia, mas optou por transformar seu diário em livro. “Foi uma forma de mostrar aos meus fãs como sou e que vivo situações semelhantes às que eles vivem.” A adolescente conta que se inspira em outras autoras jovens, como Thalita Rebouças, Bruna Vieira e Paula Pimenta. E 2017 tem tudo para ser outro ano de realizações para Larissa, com a estreia de dois filmes nos quais será protagonista. Ela está ao lado de Ingrid Guimarães em Fala Sério, Mãe, adaptação do livro homônimo de Thalita Rebouças. Também está prevista a estreia de Meus 15 Anos, baseado no livro de Luiza Trigo. LITERATURA Sheyla Smanioto Logo em seu primeiro livro feito “para os outros”, Sheyla ganhou prêmios que muitos escritores de cabelos brancos e vasta obra ainda não alcançaram. Desesterro, lançado na virada de 2015 para 2016, chamou a atenção da crítica e garantiu a ela o Prêmio Biblioteca Nacional de Literatura, o Prêmio Sesc e o cobiçado Jabuti. “Eu escrevo desde sempre, por motivos diferentes. Na infância, com 3 ou 4 anos, era para brincar. Na adolescência, depois do divórcio dos meus pais, escrevia diários para criar universos paralelos – a realidade era sem graça”, conta. “Lembro que um dia eu pensei: ‘Quero ser escritora’. Era fim de ano, eu estava terminando meu terceiro romance (que eu escrevia só para mim, no máximo deixava um ou dois amigos muito próximos ler). Então decidi escrever para os outros. Comecei a escrever Desesterro durante o mestrado em teoria e história literária em Campinas.” Sheyla conta que seus pais não têm o hábito da leitura, mas sempre a apoiaram. “Eles me deram as melhores escolas que puderam.” Este ano, recebeu uma bolsa do Itaú Cultural para produzir seu segundo livro. “O que eu sinto quando escrevo eu não sinto com mais nada. As histórias abrem paredes que pareciam fechadas dentro de mim.” LITERATURA Victor Heringer O trabalho de Victor Heringer, 29 anos, estava restrito a um pequeno grupo de autores, leitores e críticos literários. Mas 2016 foi o ano em que seu público foi ampliado e seus livros “tiveram a oportunidade de encontrar seus leitores”. Seu último romance, O Amor dos Homens Avulsos, foi um dos destaques no mercado literário brasileiro. Antes dele, Heringer já havia escrito o livro de poemas automatógrafo e o romance Glória, que lhe rendeu um Prêmio Jabuti em 2013. A juventude nunca foi um impeditivo para publicar suas obras, e o escritor revela que sempre contou com o apoio da família. “Eu não seria o que sou sem ela”, afirma, ao dizer que vive para a literatura – mesmo que não haja retorno financeiro. Heringer também é capaz de transcender a escrita e se aventurar em outras formas de arte, como fotografia, música e artes visuais. A versatilidade artística e intelectual já lhe proporcionou outras premiações, como no Festival do Minuto, por uma obra em vídeo e alguns prêmios relacionados à escrita acadêmica. De Nova Friburgo (RJ), Heringer costuma viajar para buscar inspiração. O escritor conversou com FORBES durante uma viagem ao Peru, onde foi “coletar material” para seu novo livro. Sem adiantar detalhes, disse apenas que o novo romance ainda está tomando forma e que a narrativa se passará em diferentes países da América Latina. LITERATURA 1.\tJoão Guilherme Ávila Um artista multimídia. Assim pode ser definido João Guilherme Ávila, de apenas 15 anos, que ataca em todas as frentes. Filho do cantor sertanejo Leonardo, João herdou do pai a vocação para soltar a voz no microfone. Ele já tem até um single lançado, intitulado Quem Sabe. João também faz as vezes de ator, tendo atuado em filmes e novela. No final de outubro passado, entrou de cabeça na literatura ao lançar João Sendo João – Meu Mundo, onde conta seus segredos e estripulias. O livro vendeu, até o momento, 45 mil exemplares. 2.\tLuisa Geisler Assim como o sonho de ser escritora bateu à porta ainda na infância, o sucesso chegou cedo para Luisa Geisler, 26 anos. Em 2010, aos 19, lançou sua primeira obra, Contos de Mentira, que surpreendeu ao faturar o Prêmio Sesc de Literatura – a mais jovem escritora a levar a melhor nessa disputa – e ficar entre os finalistas do Prêmio Jabuti. No ano seguinte, Luisa reapareceu com Quiçá, livro que a coloca na lista dos melhores escritores brasileiros com menos de 40 anos, elaborada pela revista inglesa Granta. Em 2014, lançou Luzes de Emergência se Acenderão Automaticamente. Apesar da já vitoriosa carreira como escritora, Luisa largou a faculdade de letras para ingressar no curso de relações internacionais. 3.\tMaisa Silva O mundo do entretenimento deixou de ser um “bicho de sete cabeças” para Maisa Silva. No ar desde os 3 anos de idade, ela já trabalhou com Raul Gil e Silvio Santos, teve seu próprio programa na TV e até deu o ar da graça como youtuber. Aos 14 anos, a ex-estrela mirim resolveu ir além. Em 2016, lançou dois livros: O Diário de Maisa e Sinceramente Maisa, que trazem sua ótica sobre os mais diversos assuntos que envolvem o público teen. Juntos, os dois já venderam 70 mil exemplares. MODA Lolita Hannud Definitivamente, Lolita Hannud nasceu para trabalhar com moda. As viagens ao lado da mãe, Rosana Zurita, reconhecida confeccionista de malhas, deram a Lolita o conhecimento suficiente para lançar, aos 13 anos de idade, sua primeira linha de tricô, voltada para meninas de sua faixa etária. Início mais do que promissor. O talento com tecidos e o espírito empreendedor corriam nas veias. Lolita foi buscar nos Estados Unidos novos valores para agregar ao seu repertório. O “pulo do gato” foi dado em 2008, com a fundação da grife Lolitta, hoje referência em tricô no mercado de luxo brasileiro. “Tudo aconteceu naturalmente. É uma área que exige muita técnica, cuidado, e esse know-how da minha mãe me ajudou muito”, diz a empresária, do alto dos seus 29 anos. Como o sucesso não vem por acaso, Lolita trabalha – e muito. Segundo ela, são 24 horas dedicadas à grife. Tudo passa pelo seu crivo. “Nosso sucesso está apoiado em três pilares: qualidade dos produtos, modelagem impecável (feita sob medida para a mulher) e exclusividade na elaboração das peças.” Em 2016, Lolita tirou mais uma carta da manga. Em parceria com o irmão João Hannud criou o Make You, ou, como ela gosta de chamar, o “Uber da beleza”. Trata-se de um aplicativo que entrega em domicílio profissionais gabaritados do ramo de maquiagem e penteados. O serviço varia de R$ 100 a R$ 400 em média , dependendo da complexidade do serviço solicitado. Entre as metas a curto e médio prazos, Lolita pontua o atendimento a diferentes públicos e o crescimento estruturado das vendas tipo exportação. MODA Vitorino Campos Embora tenha apenas 29 anos, Vitorino já acumula mais de uma década de experiência. Montou sua primeira loja aos 16 anos, formou-se em design de moda na Universidade de Salvador, criou uma marca homônima em 2008, passou a integrar o calendário oficial do São Paulo Fashion Week em 2012 e, em 2014, assumiu os desfiles da grife carioca Animale depois de uma seleção da qual participaram até nomes internacionais. “Foi tudo muito natural. Não tive tempo de parar para pensar. As coisas foram simplesmente acontecendo”, conta o estilista, que foi criado entre o ateliê da tia e a fábrica de fardamentos da mãe em Feira de Santana, na Bahia. Um dos nomes mais promissores do cenário fashion nacional, Vitorino foi citado pela Vogue americana, em 2015, como um dos dois profissionais brasileiros nos quais todos deveriam estar de olho (a outra era Patricia Bonaldi), enquanto a Associação Paulista dos Críticos de Arte (APCA) elegeu-o estilista do ano em 2016. Reconhecimentos conquistados graças a muita dedicação. “É claro que abri mão de muitas coisas, principalmente quando era mais jovem. Mas sempre pude contar com poucos e bons amigos, que deixavam de ir às baladas para me fazer companhia em casa”, lembra. Mas Vitorino não está satisfeito. “Eu me vejo pesquisando cada vez mais sobre moda, em uma busca sem fim. Cada vez que atinjo um desafio, me empolgo automaticamente com um mais novo.” MODA Lilly Sarti Já faz quase 11 anos que Lilly Sarti criou, junto com a irmã Renata, sua própria grife, homônima, com coleções atemporais destinadas a mulheres de todas as idades. Foi um longo caminho que, segundo a jovem, hoje com 30 anos, superou todas as expectativas. “Eu acredito que tudo o que é feito com afinco e responsabilidade gera resultados positivos. Mas confesso que foi muito além do que eu esperava”, diz. Quando a grife completou uma década de existência, Lilly achou que era hora de mudar algumas coisas. “Eu comecei a questionar o que existia além do negócio propriamente dito. Fizemos, então, uma reavaliação e abandonamos velhos hábitos. Conseguimos humanizar vários aspectos: nos aproximamos da nossa equipe de colaboradores e dos clientes. Estendemos a nossa essência para os nossos parceiros. Foram 12 meses de muita reflexão e de muito trabalho. Mas foi uma verdadeira virada, um novo ciclo, e estou muito satisfeita”, conta. Com duas lojas próprias em São Paulo – e presença em mais de 70 multimarcas nacionais e internacionais de luxo – , a grife participa, desde 2014, do São Paulo Fashion Week, o principal evento de moda da América Latina. No ano passado, ampliou sua atuação para os públicos masculino e infantil com o lançamento das linhas Sarti for Men e Lilow. MODA 1.\tSam Santos & André Boffano Em dois meses, André e Sam assinaram a primeira coleção e ganharam o respaldo de Roberta Damasceno, dona da multimarcas Dona Coisa, que encomendou nada menos que 90% da criação. Era o início de uma parceria bem-sucedida. Comemorando dois anos de Modem, André e Sam estampam a grife em 20 postos de venda em todo o Brasil. “Essa empresa nasceu de forma bastante planejada e desenhada para longo prazo”, diz Sam. “Seguimos sempre o DNA da marca, que é criar peças com excelência na qualidade, pensando durante todo o processo no desenvolvimento dos nossos produtos. A imagem e os códigos criados para a Modem, desde sua primeira coleção, continuam a ser explorados e reinventados.” Como se não bastasse o sucesso com roupas, agora a dupla embarca no mundo das bolsas de luxo. “Desde jovens estamos atentos a todas as oportunidades de trabalho que aparecem.” 2.\tThomaz Azulay & Patrick Doering A Blue Man é coisa do passado para Thomaz Azulay. Ex-diretor criativo da marca, Thomaz estabeleceu-se no mundo da moda com a sua The Paradise, criada em 2014 em parceria com o publicitário e amigo Patrick Doering. Diferentemente da Blue Man, que focava no beachwear, a The Paradise trabalha com estamparia digital. As peças da marca têm edição limitada e são numeradas à mão. “Queremos continuar crescendo, principalmente no atacado. Em um ano e meio de marca, passamos dos 30 pontos de venda.” A The Paradise comercializa também acessórios dos mais diversos tipos e medidas, suvenires (case de iphone, almofada, lenços etc.), brincos e anéis. 3.\tLuisa Farani Publicitária de formação, Luisa decidiu se dedicar à moda em 2007. Depois de um tempo de estudos na London College of Fashion, na Inglaterra, voltou ao Brasil em 2009 e, cinco anos mais tarde, lançou a grife que leva seu próprio nome. Em sua loja virtual, ela faz questão de dizer para quem trabalha: “Faço roupas para mulheres que amam viajar, não vivem sem arte e prezam originalidade e qualidade na hora de se vestir”. Entre as ilustres personalidades que vestem Luisa Farani estão a cantora Anitta, a atriz Letícia Sabatella e a primeira-dama Marcela Temer. NEGÓCIOS Roberto Sirotsky Ele é um dos herdeiros do Grupo RBS, conglomerado de mídia fundado nos anos 1950 em Porto Alegre. “Tenho grande admiração pelo negócio da família, mas decidi ir para outro caminho”, conta Roberto Sirotsky. Quando garoto, ele achou que seu futuro estava no tênis. “Cheguei a ser o número 1 do Brasil na categoria até 12 anos, ganhei até do Del Potro [tenista argentino que chegaria ao 4º lugar no ranking mundial].” Investiu nisso por alguns anos até perceber que, adulto, não teria grande futuro com a raquete. Aos 21 anos, com amigos, abriu a 3yz para fazer sites. “O primeiro cliente era um pequeno hotel da cidade.” Com o tempo, ampliaram o leque e passaram a atender marcas gaúchas conhecidas nacionalmente. “Três anos atrás eu me mudei para São Paulo e começamos a crescer aqui também”, diz. Desde fevereiro de 2016, a britânica WPP, maior grupo de publicidade do mundo, entrou na sociedade. “Passamos a participar de processos maiores e a atender multinacionais. O faturamento deu um salto.” Também em 2016, ele venceu o prêmio Empresário de Comunicação do Ano da Associação Riograndense de Propaganda, concorrendo, entre outros, com o próprio CEO da RBS Mídias, de quem diz ser grande admirador. E o que espera para o futuro? Com convicção e sotaque gaúcho, responde, meio brincando, meio sério: “Quero ser presidente do Grêmio”. NEGÓCIOS Vitor Paulino & Rafael Matos Vender aos investidores um propósito que impacta a sociedade não é algo trivial. É preciso análise e convencimento de que esse esforço vai trazer o retorno esperado. Essa é a fórmula que levou ao sucesso Vitor Paulino, 28 anos, e Rafael Menezes, 25. Ambos trabalham na Tarpon Investimentos, fundo que controla a Somos Educação, maior grupo educacional do país. “Convencer as pessoas de que o negócio compensava foi um desafio”, lembra Vitor, diretor da empresa, sobre o processo de aquisição da Somos do Grupo Abril. Sua participação na operação e a experiência anterior em outros fundos credenciaram-no para o conselho de administração. Vitor tornou-se uma das pessoas mais jovens a ocupar a posição em uma grande empresa brasileira. Rafael, especialista em investimentos, trabalha com Vitor na gestão da Somos e na busca por novos recursos. Ele chegou a estudar medicina, mas desistiu. “Não senti a vocação, queria fazer carreira em algo que causasse um impacto maior na sociedade”, diz ele sobre a decisão de cursar administração. Hoje, o jovem garante ter tomado a decisão certa e diz que se sente realizado ao participar de uma empresa que oferece um produto que atinge mais de 1 milhão de estudantes. Vitor e Rafael, em uníssono, garantem estar apenas no início. “Não caminhamos nem 5%. Ainda há muito a conquistar.” Eles acreditam que aliar propósito e trabalho árduo pode levar a Somos a um crescimento sustentável e à realização de novos investimentos. NEGÓCIOS Andres Andrade Ele chegou ao Brasil em 2013, ainda um “garoto” de 26 anos, para sacudir o mercado de shopping centers. Ao aceitar o cargo de diretor de novos negócios do grupo Gazit no Brasil, o equatoriano Andres Andrade disse adeus à sede da empresa em Miami, onde trabalhava desde que se formou em finanças na Universidade da Flórida. Especialista em fusões e aquisições, aqui ele executou um plano de guerra em um raio de 7 quilômetros ao redor da sede da empresa, no bairro paulistano de Vila Olímpia. “Mapeamos todos os ativos e áreas nessa região, que julgamos ser a mais prestigiada e com o maior potencial de crescimento na América Latina. Para nós, aqui é Manhattan”, diz Andres. Feito isso, começou o ataque. A Gazit investiu R$ 1,8 bilhão na aquisição parcial ou total dos lugares escolhidos – do luxuoso Cidade Jardim ao movimentado Shopping Light, no centro da cidade. Na Vila Andrade, por exemplo, desativou um conhecido supermercado e construiu no lugar um shopping de 30 mil m², o Morumbi Town, inaugurado em outubro de 2016. “Nossa CEO e eu tiramos a Gazit de uma condição de relativa obscuridade, e hoje posso dizer que é a empresa do setor com maior presença em São Paulo. Colaboramos para que 2016 fosse o melhor ano da nossa história.” NEGÓCIOS 1.\tFelipe Castellani, Henrique Castellani & Victor Santos Inovar, no cenário atual, é mais do que necessário. E foi exatamente isso que os sócios Henrique, 24 anos, Felipe e Victor Santos, ambos de 27, estão fazendo com a Liv Up, que atua no mercado de comidas congeladas. Para se distanciar da concorrência, a empresa recorre ao ultracongelamento dos alimentos, processo que mantém sabor, consistência e textura dos produtos. Em 2016, o negócio atingiu R$ 2,8 milhões de receita. 2.\tPedro Bueno No início de 2016, Pedro Bueno conseguiu um feito inédito. Ao assumir a presidência do Grupo Dasa, maior rede de laboratórios do Brasil, tornou-se, aos 25 anos, o executivo mais novo a ocupar um cargo desse nível numa empresa de capital aberto no país. O grupo – avaliado em R$ 3 bilhões na bolsa – era controlado por Edson de Godoy Bueno, pai de Pedro, até 14 de fevereiro, quando faleceu em decorrência de um ataque cardíaco. 3.\tAntonio Ermírio de Moraes Neto O jovem de 30 anos tem o empreendedorismo no DNA. Neto do empresário Antônio Ermírio de Moraes e herdeiro do Grupo Votorantim, aproveitou a expertise da família e a bagagem acumulada com os anos de estudos fora do Brasil para criar o Vox Capital, primeiro fundo brasileiro de capital para negócios sociais. 4.\tRicardo Politi A busca por novos negócios e estudos do mercado britânico fizeram Ricardo Politi criar, em 2014, o Broota Brasil, primeira plataforma do país a permitir que empreendedores captem recursos pela internet – o chamado equity crowdfunding (investimento coletivo). Aos 29 anos, Politi aposta que esse tipo de operação aponta para uma nova tendência na maneira de empreender. “De um lado temos startups em busca de capital e, do outro, pessoas comuns que podem investir com apenas R$ 1 mil”, explica. 5.\tFernando Cymrot Fernando, 30 anos, viu a oportunidade na queda do mercado de vendas de carros novos no Brasil. Em 2013, lançou a plataforma Canal da Peça. Basta dar o modelo e o ano do automóvel para iniciar o mapeamento de informações sobre fornecedores, disponibilidade em estoques, preços e entregas de peças. Em 2016, a startup cresceu 25% ao mês. 6.\tLuca Cafici Vender carro pode ser menos estressante do que você imagina. Pelo menos é o que propõe Luca Cafici, 26 anos, com o seu InstaCarro. A startup desburocratiza o processo de venda de veículos, levando-o para mais de 400 lojas e concessionárias de todo o Brasil em, no máximo, uma hora. CIÊNCIA, TECNOLOGIA & EDUCAÇÃO Camila Achutti Ser a única menina em um curso de tecnologia na Universidade de São Paulo contribuiu para o desenvolvimento da mentalidade empreendedora em Camila, 25 anos. As dificuldades de inserção da mulher no setor levaram-na a criar um blog que promovia a igualdade de gênero na área. Depois de formada, partiu para um estágio no Google, no Vale do Silício. “Minha cabeça mudou, e decidi trazer ao Brasil o que aprendi”, conta. Em 2015, fundou com o sócio Felipe Barreros a startup Ponte 21, consultoria de inovação que apresenta soluções de problemas identificados nas grandes empresas e que já atendeu Itaú, Accenture e Leroy Merlin. A dificuldade de encontrar mão de obra especializada levou a jovem a reunir seu conhecimento e formatá-lo em um curso. Assim nasceu, em 2016, a MasterTech, uma plataforma educacional que oferece cursos de tecnologia em oito semanas. O método promete reduzir o tempo de formação do profissional e sua entrada no mercado de trabalho. “Estudei quatro anos para começar, e muitas das coisas que aprendi nunca foram usadas”, diz. A plataforma se adequa também a profissionais sem conhecimento prévio em tecnologia. Cem pessoas foram atendidas em seus cursos imersivos e 20 mil assistiram a um dos cursos online, sendo 60% delas mulheres. Os próximos passos de Camila passam pelo estímulo ao empreendedorismo tecnológico e pela formação de profissionais qualificados e sua oferta às grandes empresas. Dessa forma, ela acredita que pode contribuir para que o Brasil deixe a condição de exportador de commodities e passe a vender códigos de programação. CIÊNCIA, TECNOLOGIA & EDUCAÇÃO Guilherme Junqueira Com “comichão” para empreender, esse campo-grandense saiu do emprego na Ambev e montou seu primeiro negócio aos 21 anos de idade. “Eu fazia guias comerciais de bairro. No primeiro ano, em 2010, fui bem. Faturei R$ 500 mil. O ano seguinte foi uma catástrofe, por falta de conhecimento em tecnologia e ingenuidade financeira. Fechei.” Para suprir a falta de know-how tecnológico, voltou a ser funcionário – em uma empresa de tecnologia. “Lá encontrei um ‘ser estranho’ chamado programador. Um deles virou sócio na minha empresa seguinte, de desenvolvimento de aplicativos mobile”, conta. “A gente formava profissionais de tecnologia com a cultura da inovação. Um RH comum não consegue atrair esse tipo de profissional. Isso e mais o fato de eu ter assumido uma posição na Associação Brasileira de Startups, onde vi que o grande gargalo é atrair talentos prontos para o trabalho, me levaram a criar a Gama Academy em março de 2016.” Os cursos são gratuitos, mas os interessados (14 mil em 2016) passam por um vestibular para disputar as poucas vagas. A remuneração vem das empresas que pedem socorro. “Já formamos 300 talentos – e 70% deles estão empregados”, comemora. Em novembro, anjos investiram R$ 600 mil no negócio. O “gama” no nome da empresa, conta Guilherme, vem dos raios que transformaram o cientista Bruce Banner no Incrível Hulk. CIÊNCIA, TECNOLOGIA & EDUCAÇÃO Miguel Andorffy A vontade de ensinar foi despertada em Miguel Andorffy, 26 anos, logo após a entrada na faculdade de engenharia, em 2009. Com facilidade nas disciplinas que envolvem cálculo, o então estudante tornou-se professor em cursinhos pré-vestibulares de Porto Alegre (RS) e ajudava colegas com dificuldades. Como uma coisa leva a outra, teve a ideia de disponibilizar as aulas na internet. “Poderia fazer algo divertido em sete minutos”, conta. No começo, os vídeos eram destinados apenas aos seus alunos, mas a audiência se espalhou. Dessa forma surgiu a plataforma de ensino online Me Salva. Graças a ela, em 2012 Andorffy foi o primeiro vencedor do Jovens Inspiradores, premiação da revista Veja e da Fundação Estudar. O prêmio foi uma bolsa de estudos para um curso sobre empreendedorismo na Universidade de Stanford (EUA). Em quatro anos, o Me Salva atendeu a 28 milhões de estudantes, responsáveis por assistir a 142 milhões de aulas. A startup disponibiliza aulas preparatórias para o Enem e cursos de reforço a estudantes do ensino superior. O conteúdo é customizado, de acordo com o objetivo do aluno. O resultado é que o desempenho das pessoas que assistiram às aulas do Me Salva ficou acima da média dos demais no último Enem. Em 2016, com o início da comercialização das aulas, a plataforma teve um faturamento de R$ 3 milhões. O objetivo para 2017 é oferecer aulas preparatórias também para concursos públicos. Os valores não impressionam o professor, que garante não ter a intenção de vender o empreendimento a grupos privados ou mesmo ao MEC. “Estou satisfeito por promover uma mudança no mercado de ensino.” CIÊNCIA, TECNOLOGIA & EDUCAÇÃO 1.\tNayara Ruiz A jornalista chegou ao Bradesco em 2011, para cuidar da assessoria de imprensa. Três anos depois, ajudou a criar a área de RP Digital do banco. “Nosso papel é estabelecer conexões mais fortes com criadores de conteúdo digital para ampliar a voz da nossa marca nesse segmento”, diz ela, hoje com 28 anos. Em 2016, foi eleita pelo Youpix uma das 30 pessoas mais influentes do setor digital no país. 2.\tJoana Pasquali Motivada pelo episódio da adulteração do leite no Rio Grande do Sul, Joana Pasquali, 18 anos, precisou de uma fita de filtro de café mergulhada em reagentes químicos e envolta em plástico transparente. Com essa simplicidade, tomava forma o Detectox, que identifica anomalias na composição do leite. Em razão da descoberta, Joana foi laureada com o Prêmio Jovem Cientista na categoria Ensino Médio, iniciativa do Conselho Nacional de Desenvolvimento Científico e Tecnológico. 3.\tNadia Ayad Aos 23 anos, ela é uma das garantias de que a ciência brasileira vai bem, obrigado. Recém-formada em engenharia de materiais pelo IME (Instituto Militar de Engenharia) do Rio de Janeiro, tem no currículo o primeiro lugar no desafio global patrocinado pela empresa sueca Sandvik. Nadia sugeriu a utilização do grafeno, material composto à base de carbono, em um dispositivo de filtragem e dessalinização para fornecer água potável de forma mais equilibrada para residências. 4.\tRodrigo Scotti O envolvimento entre humanos e máquinas tem apresentado avanços consideráveis. Mas ainda existe um ruído de comunicação entre as partes. É nesse meio-campo que entra a Nama, startup liderada por Rodrigo Scotti, 30 anos. Seu trabalho é desenvolver tecnologias com base na inteligência artificial que solucionem problemas de comunicação internos e externos (com consumidores). 5.\tSamantha Karpe & Letícia Camargo Ainda no Ensino Médio, as amigas Samantha, 22 anos, e Letícia, 23 anos, elaboraram o plano: criar um tipo de asfalto que fosse mais seguro, durável e bem mais em conta do que o convencional. Até que em 2013 nasceu a liga de asfalto Poliway, obra da dupla, hoje cursando engenharia. Sua fórmula é composta por materiais descartáveis, dispensa o uso de piche e suporta cargas até cinco vezes mais pesadas do que o asfalto tradicional. 6.\tHelena Simon Com experiência em marketing, a publicitária de 29 anos é cofundadora e uma das peças-chave da Omnize, companhia que criou uma plataforma para ajudar a comunicação direta entre empresas e clientes por meio de múltiplos dispositivos, como chat e mensagem de voz. A ideia é democratizar esse tipo de serviço. SOCIAL/COLABORATIVO Lisiane Lemos A criação de um elo entre o mundo corporativo e as questões de cidadania move a executiva de vendas Lisiane Lemos. Há quatro anos na Microsoft, em São Paulo, a gaúcha de 27 anos divide seu tempo entre a carreira e sua militância em prol da igualdade racial. Ela participa do Blacks at Microsoft no Brasil, política da companhia pela inclusão de pessoas negras na empresa, que promove a tecnologia como um instrumento de ascensão social. A luta de Lisiane pela igualdade não se restringe à empresa onde trabalha. Ela foi uma das fundadoras e é diretora da Rede de Profissionais Negros, coletivo que busca conectar profissionais negros, empresas com políticas de diversidade e movimentos sociais. A ideia é ir além do sistema de cotas no ensino superior por meio da conexão entre empresas que adotam práticas de inclusão e que são desconhecidas dos jovens recémformados. Além disso, Lisiane é também uma das líderes do Mulheres do Brasil, organização da sociedade civil fundada pela empresária Luiza Trajano, proprietária do Magazine Luiza. Ela participou da criação do Comitê de Igualdade Racial do grupo. Os próximos passos da jovem continuam tendo como foco o setor privado, já que praticamente não existem líderes que promovam a igualdade racial nas empresas. Em paralelo, uma especialização em tecnologia. Dessa forma, acredita Lisiane, ela poderá usar a própria carreira como exemplo de que é possível, para os jovens negros, conquistar oportunidades nas grandes empresas. SOCIAL/COLABORATIVO Marco Antonio Penha Um projeto acadêmico que acabou se transformando em um projeto de vida. Foi assim que tudo começou para o aluno de ciências da computação Marco Antonio, hoje com 29 anos. Junto com um grupo de colegas universitários, ele buscava, em 2014, uma iniciativa que lhe permitisse empregar a tecnologia wearable (vestível) em algo que gerasse impacto na sociedade. Muitos brainstorms depois, os jovens pernambucanos optaram por desenvolver um dispositivo que auxiliasse deficientes visuais – a disfunção afeta mais de 6,5 milhões de pessoas em todo o país (além disso, 92% das cidades brasileiras são inacessíveis ou não têm ruas adaptadas). “A primeira ideia era substituir a bengala, mas logo percebemos que não era disso que eles precisavam”, lembra Marco. “Era necessário algo complementar, capaz de dar segurança à parte superior do corpo.” A solução foi o desenvolvimento de óculos equipados com sensores de ultrassom que identificam obstáculos, como orelhões e caçambas, e emitem vibrações em sinal de alerta. O produto, até então inédito em nível global, já ganhou sete protótipos, novas funcionalidades (agora é equipado com um GPS que mapeia e indica os obstáculos) e está sendo estruturado para chegar ao mercado em larga escala. Para isso, foi criada a startup PAW – Project Annuit Walk. “Nossa motivação vem dos deficientes visuais. Nós nos envolvemos com eles ao longo de todo esse processo, e hoje minha meta é fazer com que os óculos sejam acessíveis a todos aqueles que precisarem deles.” SOCIAL/COLABORATIVO Laina Crisóstomo A advogada de 30 anos não imaginava que uma postagem de abril de 2016 nas redes sociais fosse capaz de criar tanta repercussão a ponto de levá-la a fundar um coletivo feminista. Assim nasceu, em Salvador (BA), o TamoJuntas, iniciativa de Laina com outras duas advogadas para prestar assessoria jurídica a mulheres de baixa renda em situação de violência. Em menos de um ano, o coletivo conquistou uma sede (doada), atende 12 mulheres por semana e cuida de, aproximadamente, 60 processos. A ajuda não fica restrita às questões jurídicas: a sororidade (união de mulheres que compartilham as mesmas ideias e propósitos) trouxe psicólogas e assistentes sociais para o grupo. Todas participam voluntariamente – com trabalho e dinheiro. Laina defende as minorias desde a faculdade, quando militou contra o machismo, o racismo, a homofobia e a discriminação religiosa em movimentos sociais. Iniciou a carreira no Terceiro Setor e, atualmente, exerce o direito como profissional liberal. O feminismo está também em suas atividades remuneradas, já que não aceita defender homens em processos contra mulheres. Ela explica que não faz sentido ser feminista e “desqualificar uma mulher para favorecer um homem nos tribunais”. As dificuldades do dia a dia não a impedem de sonhar com a expansão do coletivo: a ideia é levá-lo a todos os estados e transformá-lo em uma agência financiadora para outras advogadas atuarem na defesa das mulheres de baixa renda. SOCIAL/COLABORATIVO 1.\tRalf Toenjes Esse rapaz de 25 anos está à frente da ONG Renovatio, que trouxe ao Brasil a pioneira iniciativa de produzir óculos de baixo custo para pessoas com baixo poder aquisitivo. Resistente e de fácil montagem, o acessório criado por um professor alemão custa, por aqui, R$ 25. A cada peça vendida, outra é doada. Localizada na Vila Nova Esperança, em São Paulo, a ONG recruta e treina pessoas em condição de vulnerabilidade social para atuar na produção e atendimento. 2.\tLorrana Scarpioni Com apenas 23 anos, Lorrana recebeu a “bomba”: era uma das duas brasileiras mais inovadoras até os 35 anos segundo uma lista do MIT (Massachusetts Institute of Technology). Tudo porque, em 2012, após assistir a dois documentários sobre economia, decidiu colocar no ar a plataforma Bliive, uma rede em que pessoas de todo o planeta oferecem seus talentos em troca de outros talentos, processo comumente chamado de “economia colaborativa”. No começo do projeto, Lorrana, atualmente com 25 anos, tocava tudo sozinha. Seis meses depois já tinha uma equipe multidisciplinar com cinco pessoas. Hoje a Bliive contabiliza mais de 15 mil usuários e atua em 55 países. 3. Monique Evelle A militância de Monique Evelle, 23 anos, a levou para além da pequena Nordeste de Amaralina, em Salvador. Fundadora da rede Desabafo Social, que trabalha com educação e formação social, em especial para jovens negros, ela já estampou capas de revista, discursou no Brasil e no exterior e recebeu vários prêmios. 4.\tNina Valentini Foi pensando que qualquer centavo investido pode fazer a diferença na vida de milhares de pessoas que a administradora Nina Valentini, 29 anos, tomou as rédeas do Instituto Arredondar. Em operação desde 2014, a Oscip (Organização da Sociedade Civil de Interesse Público) estimula a captação de verbas de estabelecimentos comerciais para investimento em projetos e causas sociais dos mais diversos tipos. Atualmente, o Arredondar capta algo em torno de 10 mil doações diárias. A aptidão para o terceiro setor entrou cedo na vida de Nina: o pai coordenou o Hospital Cândido Ferreira, em Campinas (SP), e tratava pessoas em situação de pobreza, e a mãe, psicóloga, trabalhou por muitos anos no setor público, na área da infância e dos direitos humanos. Em novembro, Nina recebeu o Prêmio Folha Empreendedor Social. Aficionada por cinema, a jovem ainda tem planos de lançar o documentário Entre Mundos, que retrata as benfeitorias do trabalho social em vários lugares do planeta. 5.\tDiogo Pascoal Ao lado da irmã Candice, Diogo Pascoal, 30 anos, levantou a Kickante em 2013. Caracterizada como uma plataforma de crowdfunding, é considerada a maior da América Latina em financiamento coletivo e tem arrecadação anual aproximada de R$ 30 milhões. Atua em várias frentes: de companhias teatrais a startups. ESPORTE Daniel Dias Ele é uma máquina de bater recordes e acumular medalhas. Daniel de Faria Dias nasceu em 1988 em Campinas (SP) com limitações nos dois braços e na perna direita. Filho único, passou a infância em Camanducaia (MG). “Quando vi pela TV a Paralimpíada de 2004, descobri que existia esporte para pessoas como eu. Pensei: ‘Quem sabe um dia eu também não possa fazer isso?’.” Tinha 16 anos. Logo depois, seu pai assistiu a uma palestra de Steven Dubner, presidente da Associação Desportiva para Deficientes (ADD). “Viemos a São Paulo para conhecer o esporte adaptado. Foi meu primeiro contato com aulas de natação.” A professora da ADD ficou espantada: em apenas oito aulas, Daniel aprendeu os quatro estilos da natação (borboleta, peito, costas e crawl). Ela sugeriu que ele se dedicasse ao esporte, e para isso a família mudou-se para Bragança, no interior paulista. Logo na primeira competição, em 2005, ao lado de paratletas experientes, os mesmos que via na TV, ganhou dois bronzes. “Costumo dizer que essa foi minha braçada inicial.” Em 2006, em seu primeiro Mundial, ganhou duas medalhas de ouro e não parou mais. Em 2009, recebeu o troféu Laureus, o “Oscar do esporte”, honra que divide com outros três brasileiros: Pelé, Ronaldo Fenômeno e Bob Burnquist. Na Rio 2016, Daniel ganhou quatro medalhas de ouro (nove no total). Tornou-se o nadador com o maior número de medalhas paralímpicas (24) da história. POR Gabriela Arbex, Rebecca Silva, Ricardo Gomes e Leandro ManzoniCOORDENAÇÃO EDITORIAL José Vicente BernardoDIREÇÃO DE ARTE Ana Carolina NunesEDITORA DE FOTOGRAFIA Ariani CarneiroFOTOS Tomás Arthuzzi, Diego Nata, Ale Santos, Rodrigo Takeshi, Renato Rocha Miranda, Fernando Vivas, Stefano Martini e Thiago Gouveia  © Forbes 2023. Todos os direitos reservados.", "url": "https://forbes.com.br/listas/2017/03/91-destaques-brasileiros-abaixo-dos-30-anos/", "threshold": 1.0}