{"title": "Under 30 2016: 30 jovens mais promissores do Brasil abaixo dos 30 anos - Forbes", "content": "Início / Fotos / Under 30 2016: 30 jovens mais promissores do Brasil abaixo dos 30 anos Cecília criou um microchip para identificar o câncer de mama antes que ele se desenvolva. Luiz fatura 3,5 milhões de reais por um ano com uma sobremesa que prepara desde a adolescência. Kéfera vendeu mais de 250 mil cópias de seu livro de estreia. Luiza, pela terceira vez, disputará uma Olimpíada. A empresa de Lucas é referência na energia captada pelos ventos. VEJA TAMBÉM: 31 maiores bilionários brasileiros Nenhum tem uma história parecida. Nem mesmo os outros 25 jovens do “30 abaixo de 30” de 2016. O que os une é que todos ainda não ultrapassaram os 30 anos. E o desafio que, para eles, não tem limite. A edição completa da matéria faz parte da edição 39 de FORBES Brasil já nas bancas, no Apple Store e na Play Store. Antes, veja na galeria de fotos quem são estes jovens: Roberta Ramalho, 22 anos, empresária  Ela passou há pouco da casa dos 20 anos, mas já é presidente do estaleiro líder em embarcações de luxo no Brasil: a Intermarine, criada há 43 anos. Graduada em economia, suceder o negócio de seu pai — que comprou a companhia em 1985 – foi sempre o sonho de Roberta Ramalho. “Assim que me formei, passei um ano aprendendo em todas as áreas da Intermarine. Cresci dentro dela e estava me preparando para isso.” Lá, são fabricados barcos offshore (esportivos e de alta performance), cabinados e iates. Com tamanhos de 42 a 95 pés, têm o tíquete médio de 6,5 milhões de reais. Os iates de 30 metros de comprimento são os únicos produzidos em série no país. “Nosso maior objetivo é levar o que temos de melhor para a indústria internacional.” Roberta conta também que um diferencial é adaptar a embarcação ao clima do Brasil (áreas externas valorizadas, por exemplo) – algo que não costuma ser feito pelas marcas estrangeiras. O serviço de pós-venda é um dos pontos mais fortes. “Como o barco inteiro é produzido no nosso estaleiro, temos muita facilidade para atender o cliente e solucionar o problema.”  Tales Gomes & Felipe Dias, 27 anos, empreendedores  Doenças crônicas não transmissíveis, como diabetes, hipertensão arterial e alguns tipos de câncer, são responsáveis por 74% das mortes no Brasil. A grande maioria delas ocorre porque os pacientes tardam em descobrir o diagnóstico. Como resolver a equação? Para Tales Gomes e Felipe Dias, basta um kit portátil que realiza testes identificadores dessas doenças em até 20 minutos. A tecnologia é obra de Gomes e de Luiz Carvalho, da ONG Instituição Coração Saudável, mas foi capitalizada pela dupla de 27 anos. “Bons projetos se perdem porque não existe dinheiro para que eles se mantenham”, diz Felipe. Hoje, eles operam com profissionais de saúde independentes, que fazem exames nas comunidades mais vulneráveis do Rio de Janeiro, e em um projeto piloto com uma rede de farmácia. Os testes custam de 10 a 50 reais, dependendo da complexidade. Depois de investirem 130 mil reais, os planos são expandir os testes pelo Brasil e internacionalmente. O Chile já aportou 35 mil dólares para testar o programa no país.  Gabriel Benarrós, 27 anos, empresário  Nascido em Manaus (AM), Gabriel formou-se em economia e psicologia pela Stanford (EUA), graças a uma bolsa de estudos da Fundação Estudar — grupo criado pelos bilionários Jorge Paulo Lemann, Beto Sicupira e Marcel Telles. Lá, trabalhou como social manager, organizando eventos na faculdade norte-americana. “Achava vender uma experiência mais interessante do que vender coisas.” Isso o fez perceber que havia um espaço na América Latina para uma plataforma de eventos com forte base tecnológica. Assim surgiu a Ingresse. Ao lado do sócio, Marcelo Bissuh, captou mais de 20 milhões de reais em investimentos, vendeu cerca de 70 milhões de reais em ingressos em 2015 e atingiu a marca de mais de 600 eventos por mês. “Esperamos mais do que dobrar esse número neste ano.” Além de ser uma plataforma de gestão de eventos, o site permite que os organizadores conheçam profundamente seu público e façam uma série de interações. “É possível fazer vendas diretas no Facebook e desenvolver aplicativos próprios.”  Mariana Serra, 30 anos, empreendedora  O conceito de short-term volunteering é muito conhecido hoje em dia. São viagens de curta duração, focadas em trabalho voluntário. A carioca Mariana Serra entende muito bem do assunto. Formada em relações internacionais, sempre teve como grande paixão ajudar em coisas pontuais. “Meus pais me ensinaram isso e é algo que eu faço com muito prazer”, conta. No fim de 2013, teve a ideia de criar um portal de viagens. Para focar em apenas um mercado, escolheu o filantropo. Lançou, então, em abril de 2014, a Volunteer Vacations, agência que proporciona experiências de curto prazo em uma organização de ajuda humanitária e cuida de todo o planejamento e burocracia. “Há uma série de projetos em diversos países, como adotar um animal selvagem na África do Sul, ser voluntário em um orfanato no Quênia, cuidar de elefantes maltratados na Tailândia e muito mais.” Os preços são variados. Uma semana na Indonésia, por exemplo, custa US$ 270, e uma semana na Tailândia, US$ 740 (valores sem as passagens). “A VV é um negócio social, nosso maior objetivo é a transformação in loco.”  Camila Queiroz, 22 anos, atriz e modelo  Camila Queiroz viveu uma modelo e acompanhante de luxo em seu papel mais marcante até o momento — o de Angel, na aclamada minissérie “Verdades Secretas”, da Globo. Tirou de letra, mesmo sendo uma tímida autodeclarada. “Às vezes faço uma palhaçada para tentar esconder isso”, diz. “Se você topou contar a história, você tem que fazer isso da melhor forma possível.” A opção por ser atriz é recente, mas a vida de modelo, não: já trabalha na profissão há oito anos. Venceu um concurso em sua cidade natal, Ribeirão Preto (SP), e visitou mais de 15 países. O talento para atuar estava adormecido, diz. “Desde criança eu crio histórias, peças de teatro e brincadeiras. Acho que estava no sangue trabalhar com arte.” Atualmente está na TV na novela das seis, “Êta Mundo Bom”, como Mafalda, uma menina pura e inocente, o oposto de Angel. “Está sendo muito divertido, porque as cenas são engraçadas, mas também um desafio fazer esse drama cômico.” Gravando de segunda a sábado, Camila ainda consegue unir as duas carreiras. “Mas sei que nada será como antes.”  Rainer Cadete, 28 anos, ator  Rainer Cadete já foi Gabriel, Nuno, Rafael, Caio, Visky e agora vive Celso na novela “Êta Mundo Bom”, da Rede Globo. “E estou louco para fazer cinema”, diz. Seu papel anterior como o homossexual Visky, na minissérie “Verdades Secretas”, teve grande repercussão e sucesso. “Esse personagem colocou uma lente de aumento no meu trabalho e me rendeu muitas coisas interessantes.” O ator, que diz ter sido uma criança muita tímida — algo que afirma perdurar até hoje —, começou a fazer teatro aos 9 anos, em Brasília, onde nasceu. Aos 18 foi para o Rio de Janeiro e aos 20 fez a oficina de atores da Globo. Desde então, não saiu mais da TV. Depois de ter emagrecido 10 quilos, se depilado, feito a sobrancelha e aula de passarela e stiletto (dança com salto alto), o desafio atual do ator é encarar totalmente o oposto na pele do machista e vilão do folhetim das seis da emissora. “Gosto de mergulhar no universo do personagem. Quero fazer o Brasil amar o Celso, assim como amou o Visky.”  Felipe Castanhari, 25 anos, Youtuber  Sonic, Pokémon e Dragon Ball são nomes tão conhecidos pela geração que domina a internet quanto qualquer astro do cinema ou da música. E o canal Nostalgia, do YouTube, trata desse mundo. Voltado ao público que cresceu nos anos 1980 e 1990, o programa começou a pegar depois de o criador Felipe Castanhari mandar e-mails anônimos a dezenas de blogs indicando seu vídeo sobre a TV Cruj, programa infantil do SBT dos anos 1990. De mil visualizações, o quadro pulou para 50 mil. Pouco mais de quatro anos depois, o Nostalgia tem 5,7 milhões de inscritos e quase meio bilhão de visualizações. Até o canal próprio do youtuber, em que ele fala da sua vida, faz sucesso: o último vídeo já passou de 1 milhão de views. Os temas diversificaram. Para manter a produção semanal, há uma equipe de 15 pessoas, entre produtores e roteiristas, supervisionada por Castanhari. O paulista consegue um faturamento mensal significativo, soma que vem de anúncios no YouTube e campanhas publicitárias de grandes marcas, como a Coca-Cola. Saudade é um grande negócio.  Cecília de Carvalho, 28 anos, química  “Estou mais nervosa do que no dia em que defendi meu doutorado.” A timidez da química Cecília de Carvalho no ensaio fotográfico de FORBES, algo simples, contrasta com a complexidade de sua pesquisa. A tese à qual se refere pode mudar o rumo da luta contra o câncer de mama. O projeto, defendido em setembro de 2014 na Unicamp, consistia em um microchip para identificar a doença antes que ela se desenvolva. Com grafeno, material recém-descoberto considerado o mais fino e resistente do mundo, o protótipo usa anticorpos para identificar a proteína HER2, liberada na corrente sanguínea das mulheres propensas a desenvolver a patologia. Até então, as experiências só foram feitas com amostras que imitam sangue humano. A próxima etapa será de testes com voluntárias. O caminho é longo, mas o objetivo da pesquisadora, que lidera o recém-criado MackGraphe, grupo de pesquisas em grafeno na Universidade Mackenzie, é que o protótipo, produzido com dióxido de silício, seja feito com plástico para ficar mais barato. “Meu interesse é que isso fique de livre acesso para o SUS.”  Maria Clara Drummond, 29 anos, escritora  Formada em jornalismo, Maria Clara ouviu de várias pessoas, assim que escreveu seu primeiro romance, “A Festa É Minha e Eu Choro Se Eu Quiser”, que ela não era jornalista, e sim escritora. E ela adorou. “Foi até algo meio romântico, pois, desde pequena, meu sonho era ser escritora e de repente as pessoas começaram a me falar isso.” A carioca almejava também publicar pela Companhia das Letras e o objetivo foi concretizado. Seu segundo livro, “A Realidade Devia Ser Proibida”, foi lançado pela editora em outubro de 2015. “Foi um desafio maior. Queria criar uma história de amor de forma mais investigativa, sem soar cafona ou piegas. Também tive mais dificuldade em encontrar a voz literária da personagem, não queria que fosse uma mulher dramática”, afirma. Clara já produz seu terceiro trabalho, ainda sem revelar o enredo. Seguindo quase que uma tradição de começar um livro no primeiro mês do ano, agora, com mais experiência, a história vem com mais facilidade. “É bom ter esse tempo para respirar e começar um novo projeto.”  Luiz Quinderé, 26 anos, Empresário  Brownie é praticamente o sobrenome deste carioca. Quando Luiz Quinderé abriu o próprio negócio, há quatro anos, já contava com outros seis de trabalho caseiro e informal. “Tudo começou no colégio, em 2005. Meus amigos adoravam os brownies que eu levava e comecei a vender para eles”, diz. A produção começou na casa dos pais, logo tomada por enormes quantidades de ingredientes e embalagens. Os limites caseiros ficaram pequenos.  A primeira fábrica, no Leblon (zona sul do Rio), recebeu aporte inicial de cerca de 100 mil reais. Hoje, são duas unidades no Rio de Janeiro, 200 pontos de revenda e uma estreia recente em São Paulo, no centro gastronômico Eataly e na sofisticada rede de supermercados St. Marche. “Queremos crescer no mercado paulista e também entrar em Minas Gerais, além de aumentar a oferta de produtos.” Com um faturamento de 3,5 milhões de reais em 2015 e 16 toneladas de brownies vendidas apenas em dezembro, Luiz acredita que a fórmula do sucesso engloba a história por trás da criação e a relação de amizade entre os funcionários da empresa. “O brownie é realmente meu projeto de vida.”  Ronaldo Tenório, 30 anos, publicitário  São mais de 300 milhões de surdos no mundo e a maioria deles não consegue ler na língua de seus países. Esse foi o estímulo para que Ronaldo Tenório e Carlos Wanderlan criassem, em 2012, um aplicativo que traduz o português, escrito ou falado, para a Língua Brasileira de Sinais (Libras) por meio do personagem Hugo. O Hand Talk rapidamente ganhou manchetes e prêmios internacionais, incluindo o de melhor aplicativo social do mundo pela ONU, em 2013. Hoje, o app gratuito já foi baixado mais de 700 mil vezes e fez mais de 100 milhões de traduções. Mas esse não é e nem será o foco financeiro da empresa. “Surdos não devem pagar para ter informação”, argumenta o alagoano. A Hand Talk, hoje com dez funcionários, fatura ao criar soluções para empresas privadas: desde colocar o Hugo nos sites das companhias a elaborar totens de acessibilidade em postos de informações de shoppings. O próximo passo é internacionalizar. De olho nos Estados Unidos, eles pretendem abrir uma nova rodada de investimento até o fim deste ano para operar em ASL, língua de sinais norte-americana.  Anielle Guedes, 23 anos, empreendedora  Anielle Guedes não tem tempo a perder. Aos 23 anos, já discursou na ONU, na Unesco, é embaixadora da [email protected], trabalhou com a Anistia Internacional, foi listada pelo MIT (Instituto de Tecnologia de Massachusetts) como uma dos 35 jovens mais inovadoras em 2015 e fundou a startup de construção civil Urban3D. “É um dever moral fazer as coisas andarem para a frente”, afirma a paulistana. Sua empresa tem um objetivo no mínimo ousado: desenvolver tecnologias para, literalmente, imprimir moradias. A iniciativa traz uma série de benefícios, como otimizar a produção, diminuir o tempo de entrega e eliminar atividades de risco. “Ela tira o processo da obra e traz para a fábrica para reduzir uma série de erros que acontecem durante a etapa de alvenaria.” A Urban3D, diz Anielle, já desenvolveu a tecnologia para a produção de prédios de 12 a 15 andares. Ela roda o mundo para falar sobre empreendedorismo: foram 15 países só no ano passado. E sobra tempo? “Não entendo a palavra entretenimento. E passatempo, então, o que é isso?”  Felipe Nars, 23 anos, piloto de Fórmula 1  Felipe Nasr tinha apenas 7 anos quando pilotou seu primeiro carro em uma competição profissional. Era um kart, veículo-símbolo das categorias de base do automobilismo. Colecionou títulos entre 2000, o ano de estreia, e 2007: estaduais, regionais e brasileiro. Um ano depois, pilotando um monoposto em Interlagos pela Fórmula BMW das Américas, chegou em terceiro e quinto lugares em duas baterias. Era a senha para voos — ou pódios — maiores. Migrou para a Europa, já com contrato para a edição daquele continente da mesma competição. Em sua primeira temporada, o título do campeonato. Mudou de novo de categoria, agora para a Fórmula 3 europeia — e nova sensação, com o título logo na segunda temporada. Na GP2, depois de um décimo lugar em 2012, terminou em quarto no ano seguinte e terceiro em 2014. Naquele momento, já era piloto de testes da Willians, na Fórmula 1. Seu primeiro ano na principal categoria do automobilismo, pela Sauber, começou com um recorde: tornou-se no GP da Austrália de 2015 o melhor estreante brasileiro na competição.  Adriano Souza (Mineirinho), 29 anos, surfista  Adriano de Souza era um prodígio quando, em 2002, tornou-se o mais jovem vencedor de uma competição profissional de surfe. Tinha 15 anos quando venceu uma das etapas do circuito brasileiro do SuperSurf, em São João da Barra (RJ). “Até então, praticava por lazer. Meu irmão era o único da família que surfava e segui seus passos.” Quem acompanhava o esporte dizia que Adriano, o Mineirinho, era uma pedra a ser lapidada. Treze anos depois, ele chegou ao topo, ao conquistar o Circuito Mundial de Surfe, um ano depois de outro brasileiro, Gabriel Medina, ter alcançado o feito. Na final, em Pipeline (Havaí), bateu justamente Medina. A vitória também o transformou no único brasileiro a vencer a etapa mais famosa do circuito. “O Gabriel abriu as portas”, diz. “Precisava dessa motivação. Ele foi um cara que lutou e colocou o Brasil nesse mapa.” Paulista do Guarujá, Mineirinho chega cedo às praias, estuda as ondas e esboça a técnica que irá utilizar. Carrega em seu entorno nove patrocinadores. Uma rotina que pretende continuar por, no mínimo, mais seis anos.  Bruna Marquezine, 20 anos, atriz  Bruna Marquezine começou muito cedo na TV. Aos 5 anos, participou de vários testes para comerciais e de programas na Globo. Um tempo depois, foi procurada pelo autor Manoel Carlos para viver Salete na novela Mulheres Apaixonadas e chamou bastante atenção por sua boa atuação. “É um pouco difícil o interesse em atuar partir da criança, mas eu sempre gostei disso”, afirma. Desde então, a carioca não parou. Já são mais de 17 atuações na TV e sete no cinema. Atualmente, está gravando a série Nada Será Como Antes, situada nos anos 1950, quando a TV chegou ao Brasil. “A gente sempre acha que o papel que mais marcou é o do momento. Mas, realmente, esse atual está sendo incrível, é o mais desafiador.” Bruna diz ser grata por trabalhar com algo que realmente ama. Para ela, é muito importante ter voz e entrar na casa dos telespectadores. “A cada personagem que faço, posso ajudar as pessoas, posso levantar uma bandeira. É esse o meu papel como atriz na sociedade.” Assim que terminar a série, já tem um filme para rodar. “Eu não posso falar muito ainda, mas me encantei com o projeto.” Uma carreira e tanto para uma atriz de apenas 20 anos.  Wesley Safadão, 27 anos, cantor  Wesley Safadão já era um sucesso consagrado no Nordeste quando o hit “Camarote” estourou no restante do país. O cantor de forró com madeixas longas virou sinônimo de sucesso. As muitas participações em músicas do gênero mais popular do país, o sertanejo, foram fundamentais para esse estouro. Integrante do Garota Safada, Wesley foi aos poucos ficando maior do que o próprio grupo em que começou, fundado pela sua mãe, Dona Bill. “Foi um processo de dois anos mais ou menos. Primeiro colocamos o Wesley Safadão escrito no cartaz do show, depois fizemos uma logomarca. Foi tudo uma análise de mercado, como Banda Eva e Ivete Sangalo. É a força do artista e não da banda”, afirma. Dono de um dos cachês mais altos da música nacional (gira em torno de 500 mil reais), o cantor mantém uma média de 25 shows por mês, número que pretende diminuir em 2016. “O pensamento é dar uma maneirada, sim”, diz sobre a preocupação em priorizar a qualidade em vez da quantidade. Após se tornar um fenômeno popular no último ano, o grande desafio para Safadão é continuar no topo.  Lucas Strasburg & Eduardo Boff, 24 anos, empreendedores  Em uma tarde de maio de 2009, os estudantes de mecânica Lucas Strasburg Ferreira (à esq.) e Eduardo Trierweiler Boff (à dir.) viram uma cena que mudaria suas vidas. Na rua, um homem com um pé amputado tentava caminhar com a ajuda de muletas e, ao mesmo tempo, esforçava-se para morder um doce. No ano seguinte, os jovens começavam os primeiros testes do Revo Foot, uma prótese para pé humano feita com polipropileno (o plástico dos copinhos) e polietileno tereftalato (material das garrafas PET) fundidos. Por ser feita de material reciclável, a criação é três vezes mais barata do que as próteses importadas, de fibra de carbono. E mais confortável do que as de madeira, distribuídas pelo SUS. Em 2014, Lucas foi reconhecido pelo Instituto de Tecnologia de Massachusetts (MIT) como um dos dez jovens brasileiros mais inovadores. O Brasil ainda não tem certificação própria para próteses ortopédicas, um empecilho para as vendas. Tomando como base a norma técnica americana, os jovens têm realizado, por conta própria, os testes necessários e pretendem entregar o material para a Anvisa até o fim deste ano.  Vanessa & Danielle Glaz, 28 e 25 anos, empresárias  Marcas de luxo e lifestyle são o ponto forte da VGDG Consultoria, criada pelas irmãs Danielle (à dir.) e Vanessa Glaz (à esq.). A empresa faz o trabalho de marketing, branding e relações públicas completo de seus clientes. “Isso inclui também todo o planejamento, estratégia, investimento e pesquisa de mercado. Cuidamos do posicionamento de marcas nacionais e internacionais com foco no mercado de luxo e estilo de vida”, contam. Com uma equipe pequena, Vanessa e Danielle acompanham de perto cada ação e adicionam suas ideias e gostos, além do know-how em cada projeto. “Trazemos muitos conceitos e novidades de fora do Brasil. É importante saber o que funciona para o público consumidor do mercado de luxo brasileiro”, afirma Vanessa. A dupla cuida da Pernod Ricard e já atendeu marcas como Drogaria Iguatemi, Diesel, Coach, Panerai, entre outras. “Nos últimos anos, aprendemos a dar um passo de cada vez. A meta este ano é expandir aqui e internacionalmente”, diz Danielle.  Matheus Santana, 19 anos, nadador  O atleta carioca é um dos talentos mais promissores do esporte brasileiro. Tem apenas 19 anos, mas já se aventurou pelo futebol e pelo jiu-jítsu. Foram as piscinas, no entanto, que lhe tomaram o coração. Matheus começou a participar de campeonatos nacionais em 2008 e, a partir daí, sempre esteve entre os melhores do país. Já quebrou três vezes o recorde mundial júnior dos 100 metros nado livre. No Mundial de Kazan, na Rússia, bateu até mesmo o tempo de Cesar Cielo, ouro na Olimpíada de Pequim, em 2008, e a quem é comparado constantemente. Em 2015, durante o Troféu Maria Lenk, as duas personalidades disputaram, a cada braçada, a primeira colocação. Santana deixou Cielo para trás com quase 20 décimos de diferença. Para a Olimpíada do Rio de Janeiro, neste ano, Matheus Santana já obteve o índice para as provas dos 100 metros nado livre e do revezamento 4/100. “Espero chegar lá e não ter nenhum resultado diferente do que as medalhas”, afirma.  Laís Ribeiro, 25 anos, modelo  Nascida em Miguel Alves, cidade piauiense a 119 km de Teresina, na divisa com o Maranhão, Laís Ribeiro jamais sonhou ser modelo na infância. “Eu estudava para ser enfermeira.” Mas a pele morena e os 1,81 metro chamaram a atenção em um concurso para candidatas a modelo no Piauí. Finalista, foi para São Paulo e, de lá, para Nova York, onde mora há seis anos. Laís colocou o Brasil recentemente no foco da moda internacional: tornou-se angel (espécie de porta-voz oficial) da Victoria’s Secret em 2015, depois de cinco anos de trabalho com a marca. O posto de angel atrai mais visibilidade e é uma ótima vitrine para impulsionar o trabalho da top. Com desfiles para as grifes mais renomadas do mundo, como Gucci, Christian Dior, Hermés, Versace, Dolce & Gabbana, Ralph Lauren e Balmain, a piauiense já foi eleita musa de Jean Paul Gaultier — o que exigiu dançar salsa na passarela em um dos desfiles. Mãe de um menino de 6 anos, ela concilia as tarefas que o pequeno exige e as das passarelas. “A maternidade me motivou a correr atrás dos meus sonhos.”  Bruno Esperança, 29 anos, empresário  O empresário Bruno cresceu em meio a flores. Nascido em Holambra, no interior de São Paulo, tornou-se diretor-geral da Esalflores, maior floricultura e garden center do sul do Brasil, aos 22 anos. Fundada em 1996 por seus pais, desde os 18 já exercia a responsabilidade de diversas áreas na empresa. “Sempre sonhei em dirigi-la. Enxergava longe e pensava no reconhecimento do nosso negócio”, diz. Recentemente, trouxe da Itália, com um investimento de 1,5 milhão de reais, as flower machines, máquinas iguais às de refrigerante, mas que vendem, obviamente, flores. Foram espalhadas por dez Estados. Após pesquisas, Bruno percebeu que a melhor forma de estar presente em todos os lugares, 24 horas por dia, seria por meio dos equipamentos. “O produto mais caro custa 34,50 reais, e o mais barato, 8,30 reais. Até o fim do ano queremos ter pelo menos 40 pontos de venda do tipo.” A empresa conseguiu adaptar a máquina em questões de refrigeração e meios de pagamento e, mesmo de longe, é possível controlar instantaneamente o que ocorre em cada uma delas.  Lucas Araripe, 30 anos, empresário  O mercado de energia eólica no Brasil cresce a cada dia. Ela é limpa, tem baixo custo e é de rápida implantação, além de ser complementar às bases de geração de energia hidrelétrica, predominantes no país. “Faz todo o sentido gerar essa energia, os ventos no Nordeste são muito bons. Além da crise hídrica que estamos enfrentando, em época de seca, por exemplo, venta muito”, afirma Lucas Araripe, diretor de novos negócios da Casa dos Ventos, criada em 2007. Referência no setor, a empresa desenvolve projetos inovadores na área. Lucas participou do processo de fundação, indo a campo, no interior do Nordeste, identificando as áreas potenciais e negociando com proprietários de terra.  “Nós adquirimos as áreas e desenvolvemos os projetos, além de vender alguns para outras companhias. Temos o maior portfólio de iniciativas em desenvolvimento.” Para isso, é necessário investir cerca de 75 bilhões de reais. A empresa destina também 0,5% do investimento de cada projeto para causas sociais e ambientais. “Procuramos trazer uma mudança positiva à região que está gerando essa energia sustentável.”  Ivan Ralston, 30 anos, chef  Fundado há um ano e meio, o Tuju já alcançou o status de um dos restaurantes mais comentados da alta gastronomia paulistana. Um dos motivos é o esquema de degustação com até 15 receitas repletas de plantas e temperos pouco presentes na culinária brasileira, como beldroegra ou pó de alga codium. O preço também chama atenção: 290 reais ou 400 reais na opção com degustação de vinhos. Mas a principal razão do burburinho em cima do empreendimento é o seu chef, Ivan Ralston, eleito a revelação do ano pelo Guia Comer & Beber da revista Veja São Paulo. Filho do casal Liane Ralston e Roberto Bielawski, donos do Ráscal, desde pequeno o paulista já se envolvia com os negócios dos pais. Hoje, tem um currículo que justifica a glamourosa estreia solo. Antes de abrir seu próprio restaurante, Ralston trabalhou em alguns dos locais mais prestigiados do planeta, como o Maní, de Helena Rizzo, o Ryugin (em Tóquio, no Japão) e o El Celler de Can Roca e Mugaritz (ambos na Espanha), primeiro e sexto na lista da Restaurant de melhores do mundo.  Renata Goldfarb, 28 anos, empreendedora  Antes mesmo de completar 30 anos, Renata Goldfarb carrega a experiência de uma veterana. Trabalhou com Joyce Pascowitch, referência no colunismo social paulistano, e na Procter & Gamble, considerada uma das melhores empresas formadoras de líderes. Quando a famosa rede de lojas de sapatos Arezzo abriu o capital, em 2011, propôs, aos 23 anos, moldar o e-commerce da Schutz, uma das marcas da empresa. “Apresentei a proposta e liderei o projeto do começo ao fim. A coloquei para andar”, diz. Foi a senha para, em poucos anos, ser uma das sócias de outra rede do ramo, a My Shoes. “A sociedade começou de uma maneira inesperada. Foi um grande aprendizado como executiva e empreendedora. Passei desde o processo de fábrica, do desenvolvimento da matéria-prima até a precificação.” No fim do último ano, Renata deixou a My Shoes sem no entanto abandonar o gosto pelo desafio. “Empreender é minha paixão. Quero achar algo meu no médio e curto prazo.”  Nina Santina, 21 anos, blogueira e youtuber  Bruna Santina, a menina-mulher de 21 anos por trás do nome Niina Secrets, hoje lida com assuntos que vão muito além do universo em que está habituada (moda, beleza e feminilidade). São questões, digamos, adultas, burocráticas e típicas de grandes empreendedores. Criado em 2010, o NiinaSecrets é o terceiro canal de beleza do YouTube mais acessado do Brasil. São mais de 1,6 milhão de inscritos – um dos vídeos, mostrando como colorir mechas no cabelo, teve mais de 4 milhões de visualizações. “Comecei a gravar os vídeos para me divertir e compartilhar minhas dicas de beleza. Não queria que ninguém assistisse, mas minha irmã descobriu”, diz. O sucesso na rede inspirou linhas de produtos de diferentes marcas com seu nome e grandes parcerias com companhias mundiais, como a Disney e a Unilever. No fim de 2015, com assessoria da empresa da família já voltada à confecção, decidiu investir em torno de 500 mil reais em uma marca própria, com roupas, acessórios de moda e itens de decoração.  Rafael Cosentino, 30 anos, engenheiro civil  O sobrenome Cosentino remete à família que controla a gigante nacional de software Totvs, mas Rafael trilhou um caminho paralelo, longe dos passos do pai, Laércio. “Participei da gestão da empresa familiar, mas, aos 21, 22 anos, meu principal investimento já era em outra plataforma”, afirma. Desde 2002, ele participa da Inovalli, empresa prestadora de serviços para a construção civil e que também é apresentada como um banco de ideias. A base era servir desde o projeto arquitetônico até a gestão de empreendimentos da obra a ser erguida. “A gente busca investidores, vende, participa. Crescemos entre 13% e 14% no último ano”, afirma o engenheiro civil formado no Instituto Mauá de Tecnologia, em São Caetano do Sul (SP). Um de seus negócios foi o novo prédio da própria Totvs, em um terreno com 20 mil m2 na zona norte de São Paulo. Outro empreendimento, na mesma região, irá utilizar recursos renováveis, com vidros solares e água com tratamento de reúso.  Luiza Almeida, 24 anos, ginete  Luiza Almeida tinha apenas 16 anos quando participou de sua primeira prova de adestramento em uma Olimpíada — a atleta mais jovem do hipismo a disputar  a competição. “Foi um dos momentos mais especiais e emocionantes de minha vida. Vou carregar aqueles minutos na arena de Pequim para sempre comigo.” Oito anos depois e com mais uma Olimpíada nas costas — a de Londres, na Inglaterra, em 2012 —, Luiza chega com a missão de obter resultados tão bons quanto os de salto, no qual o Brasil se destaca. “Minha meta é sempre bater meu próprio recorde. Para 2016, estou treinando e me preparando fortemente para tentar passar para a semifinal, onde somente os 25 melhores conjuntos competirão.” Luiza tem universo hípico no sangue. Seu avô materno criou cavalos mangas-largas. Sua mãe saltava, e o pai é criador da raça puro sangue lusitano, cavalo com a qual a ginete compete. “Brincamos que aprendi a andar a cavalo antes mesmo de andar com os pés.”  Kéfera Buchmann, 23 anos, atriz e youtuber  Dona do quarto maior canal do YouTube brasileiro, a atriz e youtuber curitibana Kéfera, aos 23 anos, reúne mais de 12 milhões de seguidores em suas redes sociais. Em 2010, usou sua essência artística para criar o canal “5inco Minutos”. Seu talento lhe proporcionou não só o reconhecimento on-line, mas também nos palcos do teatro — é lá o seu lugar, afirma. Kéfera já dublou animações da Disney, participou de longas metragens, apresentou o programa Coletivation, na MTV, comandou quadros na rádio Jovem Pan e, no segundo semestre de 2015, lançou o livro Muito Mais que 5inco Minutos, pela editora Paralela, um dos selos da gigante Companhia das Letras. Em pouco tempo, foi transformado em um sucesso editorial — já vendeu, segundo o Publish News, mais de 250 mil cópias e é o mais vendido de 2016.  Aline Silva, 29 anos, lutadora olímpica  A paulista de 29 anos começou seu caminho no esporte praticando judô. Após três anos competindo profissionalmente, em 2002 migrou para a luta olímpica, uma modalidade ainda pouco conhecida no Brasil. Apenas quatro anos depois, Aline foi vice-campeã mundial júnior. “Apesar da conquista, eu passava por dificuldades financeiras. Vendia lanche natural e doces na faculdade para ajudar a pagar as contas.” Todo o esforço valeu a pena: tornou-se a primeira atleta do país a conquistar uma medalha, de prata, em um Mundial (do Uzbequistão) de luta olímpica. “Me tornei referência nesse esporte e muito do que sou devo ao caminho difícil que trilhei”, conta a vice-campeã mundial da modalidade. Com vaga já garantida na categoria até 75 kg na Olimpíada do Rio de Janeiro, ela deseja ganhar o primeiro título olímpico da história. A brasileira foi bronze nos Jogos Pan-Americanos de Toronto no ano passado e já coleciona 81 medalhas na categoria em torneios nacionais e internacionais.  Gabriel Barbosa (Gabigol), 19 anos, jogador de futebol  A paulista de 29 anos começou seu caminho no esporte praticando judô. Após três anos competindo profissionalmente, em 2002 migrou para a luta olímpica, uma modalidade ainda pouco conhecida no Brasil. Apenas quatro anos depois, Aline foi vice-campeã mundial júnior. “Apesar da conquista, eu passava por dificuldades financeiras. Vendia lanche natural e doces na faculdade para ajudar a pagar as contas.” Todo o esforço valeu a pena: tornou-se a primeira atleta do país a conquistar uma medalha, de prata, em um Mundial (do Uzbequistão) de luta olímpica. “Me tornei referência nesse esporte e muito do que sou devo ao caminho difícil que trilhei”, conta a vice-campeã mundial da modalidade. Com vaga já garantida na categoria até 75 kg na Olimpíada do Rio de Janeiro, ela deseja ganhar o primeiro título olímpico da história. A brasileira foi bronze nos Jogos Pan-Americanos de Toronto no ano passado e já coleciona 81 medalhas na categoria em torneios nacionais e internacionais.  Roberta Ramalho, 22 anos, empresária  Ela passou há pouco da casa dos 20 anos, mas já é presidente do estaleiro líder em embarcações de luxo no Brasil: a Intermarine, criada há 43 anos. Graduada em economia, suceder o negócio de seu pai — que comprou a companhia em 1985 – foi sempre o sonho de Roberta Ramalho. “Assim que me formei, passei um ano aprendendo em todas as áreas da Intermarine. Cresci dentro dela e estava me preparando para isso.” Lá, são fabricados barcos offshore (esportivos e de alta performance), cabinados e iates. Com tamanhos de 42 a 95 pés, têm o tíquete médio de 6,5 milhões de reais. Os iates de 30 metros de comprimento são os únicos produzidos em série no país. “Nosso maior objetivo é levar o que temos de melhor para a indústria internacional.” Roberta conta também que um diferencial é adaptar a embarcação ao clima do Brasil (áreas externas valorizadas, por exemplo) – algo que não costuma ser feito pelas marcas estrangeiras. O serviço de pós-venda é um dos pontos mais fortes. “Como o barco inteiro é produzido no nosso estaleiro, temos muita facilidade para atender o cliente e solucionar o problema.”   © Forbes 2023. Todos os direitos reservados.", "url": "https://forbes.com.br/sem-categoria/2016/03/30-jovens-mais-promissores-do-brasil-abaixo-dos-30-anos/", "threshold": 0.9999999998297482}