{"title": "Under 30 2019: Os 90 destaques brasileiros - Forbes", "content": "Início / Listas / Under 30 2019: Os 90 destaques brasileiros Os 90 destaques brasileiros que estão fazendo a diferença no país A lista FORBES Under 30 2019 reúne o que de melhor nossa equipe e nossos conselheiros analisaram na plataforma de inscrições e no mercado, nas mais diferentes categorias. Algumas dessas categorias são mais abrangentes do que seu nome sugere (como indústria, por exemplo), de modo a contemplar talentos difíceis de classificar – mas que não poderiam ficar de fora por sua relevância, influência, ousadia e talento. Foram selecionados 90 jovens de até 30 anos de idade divididos em: Artes Dramáticas; Artes Plásticas e Literatura; Ciência e Educação; Design, Arquitetura e Urbanismo; Esporte; Finanças; Gastronomia; Indústria; Marketing e Publicidade; Moda; Música; Tecnologia e Inovação; Terceiro setor e Empreendedorismo Social; Varejo e E-commerce; Web e E-Sports. LEIA MAIS: Under 30 2020: conheça 20 jovens revelações da lista norte-americana Veja, na galeria de fotos, os 90 destaques brasileiros da Forbes Under 30: ARTES DRAMÁTICAS Carol Duarte, 28 Sabe aquela história da criança tímida que foi fazer teatro para ficar mais desinibida? Foi assim que Carol iniciou a vida de atriz – e não a largou mais. Quando foi estudar na Escola de Arte Dramática da USP, percebeu que a profissão era muito mais do que diversão e carregava uma grande dose de responsabilidade. Fugindo do estereótipo glamoroso de vida mansa sob os holofotes, Carol afirma querer ir além de conquistas pontuais. “Essa profissão tende a nos deixar focados em nós mesmos, nas carreiras. Mas, para mim, ser uma boa atriz se faz em trajetória, e não em um trabalho. Eu vou fracassar, vou errar, mas o plano artístico deve ir no que vou deixar para as pessoas, além de mim.” Carol atribui à sorte as oportunidades e papéis que foram surgindo em seu caminho: o primeiro sopro do destino aconteceu em 2017, quando viveu Ivan na novela “A Força do Querer”, de Gloria Perez. Também fez participação na minissérie “Segunda Chamada”, ainda na Globo. Mas o grande destaque veio em 2019, ao viver a protagonista Eurídice no melodrama “A Vida Invisível”. O filme, que marcou sua estreia no cinema, foi a aposta do Brasil para o Oscar de 2020. A indicação da Academia acabou não acontecendo, mas o longa saiu vitorioso da mostra Um Certo Olhar, no Festival de Cannes. Carol garante que suas viagens internacionais por circuitos de festivais comprovaram algo que traz esperança e orgulho em tempos turbulentos para a arte: o mundo está de olho nas produções brasileiras. ARTES DRAMÁTICAS Giulia Nadruz, 28 Giulia é o que os americanos costumam chamar de triple threat, com algo a mais: é atriz, cantora, dançarina e dubladora. É dela a voz de Bela na versão live action de “A Bela e a Fera”, da Disney. Mas seu sucesso veio mesmo nos palcos. Como atriz, já fez parte de 21 espetáculos, incluindo grandes produções como “Chaplin”, “Fame”, “Mamma Mia!”, “Shrek” e “Um Violinista no Telhado”. Ela acaba de se despedir do maior personagem que viveu até hoje: Christine Daaé, a protagonista do musical clássico “O Fantasma da Ópera”, que permaneceu por mais de um ano em cartaz no Teatro Renault, em São Paulo. ARTES DRAMÁTICAS Alice Wegmann, 24 A jovem atriz reúne os atributos necessários para fazer sucesso nos tempos atuais: além de mostrar talento para a atuação, com papéis em novelas globais, peças de teatro e filmes no currículo, conta com mais de 2 milhões de seguidores no Instagram, onde compartilha cliques do cotidiano e dicas culturais. Na telinha, vem se destacando com papéis fortes e desafiadores. Na supersérie “Onde Nascem os Fortes”, exibida em 2018 na Globo, recebeu elogios da crítica pela protagonista Maria. Em 2019, chamou atenção com a vilã Dalila na novela “Órfãos da Terra”, que retratou o drama dos refugiados. ARTES DRAMÁTICAS Agatha Moreira, 27 Agatha iniciou a carreira como modelo, ainda adolescente, e viajou o mundo a trabalho. Mas se tornou conhecida ao apostar na atuação e emendar trabalhos na Rede Globo desde que entrou na emissora, em 2012. Ela vem, pouco a pouco, conquistando a crítica e o público, interpretando papéis em novelas de autores gabaritados como Manoel Carlos e Walcyr Carrasco. Em 2019, interpretou sua primeira vilã em horário nobre, dando vida a Josiane no folhetim “A Dona do Pedaço”. Em 2020, o público poderá ver mais um pouco do talento de Agatha, dessa vez na tela grande: o filme “Missão Cupido”. ARTES DRAMÁTICAS Vitor Rocha, 22 O jovem ator tem uma carreira meteórica. Em 2018, fez sua estreia no teatro musical brasileiro como ator e autor do espetáculo premiado “Cargas D’Água – Um Musical de Bolso”, que ganhou tradução e montagens em Londres e Nova York. Recebeu o título de Revelação do Ano no Prêmio Bibi Ferreira. Para Vitor, 2019 foi um ano importante para dar sequência ao que iniciou no ano anterior e mostrar que os prêmios e boas críticas não eram sorte de principiante: escreveu e estrelou os musicais “Se Essa Lua Fosse Minha” e “O Mágico Di Ó”. Para 2020, prepara a estreia no cinema com o filme originado desse último, no qual vai atuar como ator, roteirista e letrista. ARTES DRAMÁTICAS Luccas Papp, 27 Para o ator e autor Luccas Papp, 2019 também foi um ano de plantio e início de colheita. Trabalhando desde os 5 anos, o jovem vem conquistando espaço, respeito e reconhecimento com suas peças autorais. Foi o caso de “O Ovo de Ouro”, espetáculo sucesso de público e crítica, que volta ao circuito em 2020. Ele concilia a agenda entre os palcos: ele prepara a peça “O Canto de Ninguém” (com direção musical do maestro João Carlos Martins) e as gravações de “As Aventuras de Poliana”, novela infantil de sucesso do SBT. Esse trabalho está trazendo projeção para além dos palcos: ele ministra aulas de teatro em sua própria oficina para atores em Osasco. ARTES PLÁSTICAS E LITERATURA Maxwell Alexandre, 29 O que a arte tem a ver com a favela? Absolutamente tudo. Nascido, criado e morador até hoje da Rocinha, Maxwell Alexandre não consegue dissociar sua arte de sua própria vida. E nem o quer. “Talvez meu trabalho seja a marcação de minha própria vida”, diz. “Penso que tudo que percebo me influencia.” Djonga, Baco Exu do Blues e BK’ são os três “poetas pretos”, como diz Maxwell, que escrevem e cantam o que ele se propõe a articular no campo da arte contemporânea, em obras de pintura sobre suportes como portas de madeira ou esquadrias de ferro. Em 2008, fez um curso do Observatório de Favelas para registro das obras do Programa de Aceleração do Crescimento, do governo federal, e mais tarde estudou Comunicação Visual na Faculdade de Arts & Design na PUC-Rio. Em 2012, cursando uma disciplina com o pintor Eduardo Berliner (seu primeiro contato com arte contemporânea), teve quase uma epifania. “Uma nova janela se abriu em minha vida. Me identifiquei como artista e já comecei uma rotina aquecida de pesquisas e diálogos com os códigos do campo da arte contemporânea.” Com o direcionamento de sua obra, Maxwell pretende “poder aproximar a favela do universo excludente da arte contemporânea.” Para ele, a pintura, sendo uma expressão artística que está em museus e galerias, ocupa um sistema elitista e privilegiado. O rap, por outro lado, é a voz das periferias. “Quando escolho pintar algum verso, estou tentando diminuir o abismo desses dois mundos”, explica o artista – que já expôs na França e tem obras avaliadas em R$ 45 mil. ARTES PLÁSTICAS E LITERATURA Luiz Escañuela, 26 “Desenhos e maquetes caminham comigo desde os 6 anos de idade”, diz. “Escolhi fazer design, pois imaginei que encontraria um equilíbrio entre o que o mercado de trabalho queria e minha liberdade criativa. Com uma bolsa para estudar arte, passei a usar a técnica que acumulei desde a infância a favor das temáticas que trabalhava: humanidade, empatia, toque, questões sociais e geográficas.” De forma autodidata, ele desenvolveu uma técnica hiper-realista. “Eu me interesso em captar pequenas nuances na pele e no toque humano, em como esses recortes possuem cargas repletas de interpretações e em como posso criar algo novo sem deixar de ser familiar.” ARTES PLÁSTICAS E LITERATURA Natasha Felix, 23 A escritora, poeta e educadora acredita que a história dela com a poesia começou na área de serviço da avó. “Ela pegava a minha mão e me ensinava a escrever meu nome. Lembro das letras se formando no papel, tinha uns 5 anos.” No ensino médio, passou a postar poemas no Facebook, fez os próprios zines e livretos artesanais. Em 2018, a Edições Macondo publicou o livro “Use o Alicate Agora”. Os textos repercutiram no México, Portugale Buenos Aires. Em 2019, descobriu uma nova paixão ao participar do projeto literário “Instrumental Poesia”, do Sesc Paulista, e dividir o palco com a banda Black Mantra. “Percebi que eu quero mesmo é fazer meus poemas dançarem.” ARTES PLÁSTICAS E LITERATURA Matheus Farah, 28 As primeiras lembranças que Matheus Farah tem do Masp precedem a entrada no Museu de Arte de São Paulo. “Quando era criança, passando em frente, ficava observando aquele vão livre que a arquiteta Lina Bo Bardi criou, e isso me despertava curiosidade e entusiasmo”, recorda. Acostumado a frequentar desde cedo museus pelo mundo com a família – ele é enteado de Guilherme Leal, um dos donos da Natura –, Matheus é hoje patrono da instituição paulistana. A formação em arquitetura (ele tem um escritório com o sócio Manoel Maia) veio na esteira dessa sua paixão. “Arquitetura e arte conversam diretamente. Arquitetura é uma forma de manifestar a arte.” ARTES PLÁSTICAS E LITERATURA Camila Yunes Guarita, 27 Trabalhar com arte nunca esteve nos planos de Camila – embora seja neta de Jorge Yunes, um dos maiores colecionadores do arte do país. Mas, em busca de um “laboratório de ideias e projetos”, ela fundou a Kura Arte. Além de dar consultoria para pessoas interessadas em arte, mas que não sabem por onde começar, promove experiências culturais, com viagens para jovens ou experiências na própria casa do avô: o projeto Caixa de Pandora. “É uma exposição, em que convido um artista contemporâneo para buscar uma releitura da coleção dos meus avós, fazendo tempos distantes coexistirem e dialogarem.” ARTES PLÁSTICAS E LITERATURA Luisa Gleisler, 28 Gaúcha de Canoas, Luisa ama ler desde criança. “Eu era muito tímida, e ler me ajudava a ver dentro da cabeça das pessoas. Vi que todo mundo tinha as mesmas inseguranças”, diz. Após uma oficina com o escritor Luiz Antonio de Assis Brasil, inscreveu-se e venceu um concurso de originais, o Prêmio Sesc de Literatura. Venceu depois outro prêmio Sesc, foi duas vezes finalista do Jabuti e uma do Prêmio Machado de Assis. Mestre em processo criativo pela National University of Ireland, foi selecionada para uma residência literária noMalba, em Buenos Aires. Aos 20 anos, entrou para a lista da revista “Granta” como um dos 20 melhores escritores nacionais com menos de 40 anos. “Saber que meu livro mudou algo nas pessoas beira a mágica”, diz. CIÊNCIA E EDUCAÇÃO Renata Rebocho, 28 Em setembro de 2012, recém-casada, a paulistana Renata Rebocho tomou uma decisão corajosa. Rejeitou uma proposta de trabalho para arriscar-se num negócio que não ia nada bem, uma startup de educação que o marido Bernardo tocava. Ele pensava em fechar o negócio, quase sem caixa, e seguir com ela de São José dos Campos para São Paulo. “Resolvi que tentaria ajudá-lo a não deixar o barco naufragar. Eu tinha só 20 anos na época. Poucos dias depois de começar na empresa, numa última tentativa de salvá-la, decidimos focar num protótipo, que era o Quero Bolsa”, diz ela sobre o marketplace que ajuda alunos a pesquisar e matricular-se em cursos superiores do país todo. O site, que contém informações sobre o mercado de trabalho e avaliação dos cursos, também auxilia o usuário a economizar nas mensalidades, porque tem parcerias com faculdades interessadas em matricular mais alunos e que oferecem descontos. Em um mês, Renata estabeleceu parceria com 50 novas instituições. “Tínhamos só quatro meses, até janeiro de 2013, para sair de zero de receita até o break even, pois era quando o caixa da empresa, levantado com investidores-anjos, acabaria. Pareceu um milagre, mas funcionou.” Hoje, além de vagas em cursos de graduação, a Quero Educação, que controla o Quero Bolsa, oferece vagas de ensino básico, pós-graduação, cursos técnicos, intercâmbio e idiomas – e atrai dezenas de milhões de visitantes por mês, tem mais de 700 colaboradores e já matriculou mais de 600 mil alunos em 6 mil instituições, gerando uma economia de R$ 1,3 bi para eles. Em 2016, a empresa foi a única startup brasileira na lista das top 100 investidas pela Y Combinator, prestigiada aceleradora do Vale do Silício. Em 2018, a Quero Educação se tornou uma empresa Endeavor em um painel internacional em Milão. CIÊNCIA E EDUCAÇÃO Daniel Boczar, 27 Filho de um endocrinologista, Daniel fez medicina por influência do pai. No curso, acompanhando uma cirurgia, encantou-se com o trabalho dos cirurgiões plásticos para reconstruir o rosto de um paciente e resolveu migrar para essa especialidade. Na rotina de treinar sutura, não ficou satisfeito com as soluções que existiam: estudantes praticando com tecidos ou língua de boi. Depois de pesquisar muito, desenvolveu uma pele artificial com baixo custo. O produto fez sucesso e deu origem à empresa da qual ele é CEO, a SutureSkin. Mas Daniel não trocou a carreira de médico pela de executivo. Hoje está na renomada Mayo Clinic fazendo doutorado. CIÊNCIA E EDUCAÇÃO Ana Carolina Machado, 27 Há sete anos, ao lado de dois colegas, Ana abriu uma escola de inglês para pessoas de baixa renda, a 4YOU2, que hoje atende milhares de alunos em três estados. Três anos depois, vendeu sua parte, atuou como consultora de startups e ONGs em educação e dirigiu uma escola privada para classe média baixa em São Paulo. A aluna de mestrado em Stanford, nos EUA, que estuda como reduzir as desigualdades educacionais, orgulha-se de ter sido eleita em 2018 pela Universidade de St. Gallen, na Suíça, uma das 100 lideranças jovens que definem o futuro. “Falei sobre o que os jovens deveriam aprender: avanço tecnológico, educação e empregabilidade.” CIÊNCIA E EDUCAÇÃO Hendel Favarin, 28 Na visão do empreendedor Hendel, o ensino tradicional não dá conta de ensinar habilidades essenciais no mundo dos negócios. “Boa comunicação e inteligência emocional são deixadas de lado, por exemplo.” Nesse vácuo, há três anos e meio, criou a Conquer, especializada em competências como liderança, inovação, oratória, produtividade, negociação e vendas. A edutech que ele toca com dois sócios tem 11 unidades, mais de 25 mil alunos, 200 empresas parceiras como Google, McDonalds e Ambev, e previsão de faturamento de R$ 23 milhões em 2019. Nada mal para quem começou em uma sala comercial de 45 metros quadrados em Curitiba, parcelando a mobília em 12 vezes. CIÊNCIA E EDUCAÇÃO Alana Benz, 26, Lorena Viana, 29, e Ana Elisa Antunes, 27 Três engenheiras de materiais estão tentando mudar o cenário hostil a mulheres no campo das exatas (em matemática e tecnologia, por exemplo, só 35% são mulheres). Alana, Lorena e Ana Elisa Antunes são cofundadoras da Biomimetic Solutions, spin-off de uma startup que nasceu nos laboratórios de Biomateriais e Polímeros do Cefet-MG. A empresa desenvolve uma plataforma capaz de produzir carne animal para consumo humano utilizando células-tronco como base. A Biomimetic venceu 73 empresas do mundo todo no Startup Games 2017. Elas estão em processo de captação de US$ 3 milhões para investir na criação de uma base de pesquisa em Minas Gerais. CIÊNCIA E EDUCAÇÃO Matheus Akira Tomoto, 29 A família de Matheus perdeu tudo e ficou endividada na infância do menino. Ele estudou em escolas públicas e trabalhou vendendo produtos de limpeza de porta em porta. Aos 8 anos percebeu, brincando com o computador de uma tia, que amava tecnologia. Com uma bolsa, fez engenharia mecatrônica – e desenvolveu um carro elétrico com tecnologia nacional. Em 2014, uma bolsa do governo brasileiro o levou para o exterior. Na Purdue University, mandou uma carta para faculdades e empresas. “Contei quem era e quais meus planos.” Recebeu convites para projetos de pesquisas em locais como MIT, Stanford, Princeton, Amazon, Google e até Nasa. Há alguns anos, viu-se disposto a ajudar outras pessoas a trilhar caminho semelhante. Assim nascia, em 2017, a Universidade do Intercâmbio. “Já ajudamos mais de 4 mil alunos.” DESIGN, ARQUITETURA E URBANISMO João Sebastião, 30 Ele foi criado pelos avós paternos em meio à abundante natureza da pequena cidade de Jauru, no Mato Grosso. A avó fazia crochê e bordado; o avô cultivava flores. Ele conta que cresceu brincando de pés descalços em meio a araras e jaguatiricas. Aos 9 anos, João realizou seu primeiro empreendimento: vendeu todos os vasos do avô feitos com troncos e orquídeas. “Voltei para casa com R$ 150 e abri a minha primeira conta bancária”, lembra, rindo. Na adolescência, encantou-se com as miçangas. Quando vinha a São Paulo, enfronhava-se na loja de aviamentos do tio, na Rua 25 de Março. De volta para casa, montava pulseirinhas para vender às meninas da escola. Confessa ainda que roubava penas de galos e pássaros para adornar brincos. Assim começou sua paixão pelos acessórios inspirados na brasilidade. Aos 16 anos, ele se mudou para Cuiabá a fim de estudar arquitetura na Universidade Federal do Mato Grosso – o sustento veio da venda de bijuterias. A porta de entrada para o universo da moda deu-se em 2009, com a criação de um blog, em parceria com duas amigas, que recebeu o nome de um prato típico mato-grossense: “Farofa de banana”. Hoje João atua como arquiteto, com seu próprio escritório em São Paulo, e designer, com sua marca de bijuterias Tropykl, que podem ser encontradas no Japão, nos Estados Unidos, nos Emirados Árabes e na França. Das 70 peças iniciais, hoje são mais de 200, divulgadas em showrooms internacionais e vendidas, principalmente, pelas redes sociais. O próximo passo de João é lançar uma linha exclusiva de joias. “Não são só acertos, mas os erros foram me fortalecendo”, diz. DESIGN, ARQUITETURA E URBANISMO Amanda Ferber, 24 Fruto da era digital, a arquiteta paulistana precocemente entendeu que seu trabalho deveria já nascer conectado com o planeta. Foi assim que, aos 18 anos, em 2013, Amanda criou o architecture_hunter, uma das primeiras e hoje a mais seguida página de arquitetura do Instagram do mundo. Com mais de 2 milhões de seguidores, o perfil é acompanhado por nomes de peso da arquitetura, como o inglês Sir Norman Foster, o francês Jean Nouvel e até o criador do Facebook, Mark Zuckerberg. Durante o período em que cursou arquitetura na Universidade Mackenzie, ela trabalhou como estagiária no StudioMK27, do arquiteto brasileiro Márcio Kogan; e também no ArchDaily, o site de arquitetura mais visitado da Terra. DESIGN, ARQUITETURA E URBANISMO Murilo Weitz, 30 Estudar design de criação e moda na University Arts of London (UAL), entre os anos de 2013 e 2014, foi fundamental para que o arquiteto nascido em Leme, no interior de São Paulo, descobrisse sua paixão pela criação em diferentesescalas, utilizando-se de diversos materiais e formas geométricas. Consequência desses estudos foi o lançamento, em 2015, da marca que leva seu nome. Weitz é uma referência para a nova geração. Neste ano, ele desenvolveu peças e coleções para o mercado industrial e grandes marcas de São Paulo, com destaque para Breton, St James e Itens. “Cada ano busco fazer uma nova coleção, contando uma nova história”, diz. DESIGN, ARQUITETURA E URBANISMO Anna Juni, 30 Foi durante a graduação na Universidade Mackenzie que a arquiteta paulista Anna Juni conheceu seus futuros sócios (Enk te Winkel, 32 anos, e Gustavo Delonero, 33 anos). Em 2013, o trio recém-formado participou do concurso nacional para a Sede do Anexo do BNDES, no Rio, levando o segundo lugar – a primeira de inúmeras premiações. Antes de montar o escritório Vão, Anna trabalhou com Cinthia Marcelle, a artista plástica consagrada na Bienal de Veneza. A intersecção com as artes plásticas se tornou um vetor de seus trabalhos. “A arte contemporânea contamina nossa maneira de fazer arquitetura”, diz ela. DESIGN, ARQUITETURA E URBANISMO Paola Vilas, 26 A brincadeira de infância de fazer miniesculturas projetou a designer carioca internacionalmente na profissão. Foi com a joalheria que ela percebeu ser possível dar vida às suas pequenas obras modernistas e femininas. Quando começou, ao usar suas próprias peças, Paola era parada na rua. “As pessoas tinham reações inesperadas e resolvi, então, criar a minha marca.” Por serem joias tão inusitadas, rapidamente seu trabalho atraiu o interesse do mercado exterior. Do México à Ásia,passando pela Europa, as peças são encontradas em multimarcas internacionais como Selfridges e Net-a-Porter. Em São Paulo, é vendida em sua loja na Rua Oscar Freire. “Eu as chamo de esculturas de vestir. É um resgate da força e delicadeza do feminino”, diz. A ideia agora é abrir uma linha de mobiliário e outra de design de interiores. DESIGN, ARQUITETURA E URBANISMO Thiago César de Oliveira Sodré, 29 Nascido em Anápolis (GO), em berço de família empreendedora, Thiago montou sua primeira empresa de marketing esportivo com o irmão Rodrigo, cuidando da carreira de jogadores. “Aprendi o quanto todo mundo pode ser acessível, se houver empatia”, afirma. Morador de São Caetano há 20 anos, cursou publicidade e, com um sócio, criou a Everlast Energy do Brasil, empresa de fabricação e distribuição de energéticos. Aprendeu a conectar pessoas. Assim nasceu o Club&Casa Design, marketplace que conecta 5 mil profissionais associados e 240 lojas de médio e alto padrão dos segmentos de arquitetura, design e decoração. Em 2019, foram comercializados R$ 200 milhões na plataforma – que agora aporta em Orlando e Miami. ESPORTE Arthur Nory Mariano, 26 Arthur fez história ao conquistar o título mundial na barra fixa, inédito para a ginástica artística brasileira, no dia 13 de outubro, em Stuttgart, na Alemanha. Arthur é o quarto brasileiro campeão mundial de ginástica. Já venceram a competição Daiane dos Santos (2003), Diego Hypolito (2005 e 2007) e Arthur Zanetti (2013). Com o feito, o ginasta arrebatou o Prêmio Brasil Olímpico. Na mesma competição, a equipe brasileira conquistou a vaga para os Jogos Olímpicos de Tóquio-2020 ao ficar com o 10º lugar. A classificação não garante automaticamente a presença de Arthur nos Jogos. A comissão técnica ainda vai convocar em 2020 os quatro atletas que vão defender as cores do país na Olimpíada. Mesmo sem a vaga garantida, o atleta já trabalha pensando no Japão. “Tenho que me preparar bem, estar bem fisicamente, tecnicamente e psicologicamente. Me preparar o máximo para aproveitar as oportunidades que aparecerem e lutar com todas as forças para conseguir um título olímpico”, afirma. O ginasta, que deixou Campinas (SP) ainda bebê e iniciou no esporte aos 11 anos já em São Paulo, sonha com sua segunda medalha olímpica. Ele já ganhou o bronze no Rio de Janeiro, no solo. Quem vê a consagração do atleta não imagina que ele já pensou em desistir de tudo e abandonar a carreira pela exigência dos treinos, mas isso ficou no passado. Hoje ele consegue ver o lado positivo do rigor do treinador. “Percebo o quanto foi importante ele ter ficado no meu pé e ter insistido para juntos termos alcançado nossos sonhos.” Ao encerrar um ano tão vitorioso, Nory aconselha os jovens atletas a amarem o esporte, além de “sonhar muito alto e traçar os objetivos e metas”. ESPORTE Alisson Ramses Becker, 27 Considerado o goleiro mais caro da história do futebol ao se transferir para o Liverpool por R$ 278 milhões, em contrato até 2024, Alisson teve excelente temporada com a camisa dos Reds, levantou a taça pela seleção brasileira na Copa América e fechou o gol da semifinal do Mundial de Clubes contra o Monterrey, quando o Liverpool venceu por 2 a 1, antes de bater o Flamengo na final por 1 a 0 – em outra atuação decisiva do gaúcho de Novo Hamburgo. Ele foi campeão e destaque da Liga dos Campeões em 2018. Estreou profissionalmente em 2014 pelo Internacional, transferiu-se para a Roma em 2016 e foi para a Inglaterra após a Copa do Mundo de 2018. ESPORTE Beatriz Ferreira, 27 A história da Bia Ferreira está ligada ao boxe desde a infância. A menina é filha do pugilista Raimundo Oliveira Ferreira, conhecido como Sergipe, e começou no esporte ainda criança. A baiana de Salvador conquistou a primeira medalha de ouro da história do boxe feminino brasileiro em Jogos Pan-Americanos de Lima. A maior conquista, porém, veio com o título mundial em outubro, ao derrotar a chinesa Cong Wang (categoria 60 kg). Ela ainda ganhou a medalha de prata nos Jogos Mundiais Militares na China. O ano da peso leve foi coroadocom o Prêmio Brasil Olímpico, entregue pelo COB no dia 10 de dezembro. ESPORTE Bruno Grizante Paim, 20 Bruno começou a andar de bicicleta apenas em 2015. Convidado por uma amiga para participar de uma competição de mountain bike, não parou mais. O jovem, que nasceu com má-formação congênita dos membros superiores, é o atual campeão do Mundial de Mountain Bike 24 Horas Solo na categoria PNE (portadores de necessidades especiais). O atleta do Corinthians Audax Bike Team, que tem braços até a altura dos cotovelos, venceu a competição, na cidade de Costa Rica (MS), em julho de 2019. Além da má-formação nos braços, Bruno tem uma deficiência muscular e sua perna direita é mais curta do que a esquerda. ESPORTE Italo Ferreira, 25 Italo chegou ao Havaí (a 11ª e decisiva etapa do circuito mundial) dependendo apenas de si para sagrar-se campeão do mundo pela primeira vez. E conseguiu, após bater o bicampeão mundial Gabriel Medina na final. Italo conquistouo título após vencer três etapas da World Surf League em 2019 (Gold Coast, na Austrália, Portugal e Pipe Masters, em dezembro). O ótimo desempenho em 2019 carimbou a vaga de Italo na Olimpíada do Japão, ao lado do Medina. Será a estreia da modalidade nos Jogos. O potiguar de Baía Formosa também recebeu o prêmio Surfer Awards 2019, como “Melhor Surfista do Ano”, da revista “Surfer Magazine”. ESPORTE João Victor Marcari Oliva, 23, e Pedro Tavares de Almeida, 26 João e Pedro fizeram parte da equipe brasileira de hipismo adestramento que garantiu uma classificação inédita para os Jogos Olímpicos de 2020, no Japão. Os atletas conquistaram a vaga ao terminar os Jogos Pan-Americanos de Lima, no Peru, na 3ª colocação. A medalha de bronze foi conquistada ao lado de João Paulo dos Santos e Leandro Silva. Tanto João Victor como Pedro Almeida já disputaram uma Olimpíada. Eles defenderam o Brasil no Rio de Janeiro, e finalizaram a competição na 10ª posição (a vaga havia sido garantida por representarem o país-sede). FINANÇAS Thiago Nigro, 29 O Primo Rico é milionário também em fãs nas redes sociais. São mais de 3 milhões de seguidores no Instagram, somadas as contas da marca e a de seu criador, Thiago Nigro, e outros quase 3 milhões de inscritos no canal de educação financeira no YouTube. No quesito dinheiro, o influenciador digital agora se diz “rumo ao bilhão”, o que é, por sinal, o nome de um quadro mensal no YouTube em que Thiago expõe parte de seus investimentos — cerca de R$ 6 milhões no episódio de dezembro. A trajetória do investidor começou com números bem mais modestos. “Quando eu era mais novo, tinha o sonho de ficar rico”, conta. “No meu aniversário de 18 anos, meus pais me deram R$ 5 mil. Eu investi e quebrei em uma semana. Então resolvi estudar e me apaixonei pelo mercado financeiro.” Thiago diz que foi recusado em vários bancos até que resolveu abrir o próprio negócio de assessoria de investimento. Depois de sete anos, com quase 5 mil clientes, vendeu a empresa. “Eu queria trabalhar com internet e falar com muito mais gente.” Nascia então O Primo Rico. Em 2019, segundo Thiago, o negócio faturou mais de R$ 30 milhões em vendas de cursos digitais, sem contar ganhos com publicidade, palestras — mais de 70 no ano, cobrando de R$ 30 mil a R$ 100 mil — e vendas de quase 500 mil cópias do livro “Do Mil ao Milhão”. Outra linha de negócios são os eventos. “Reunimos quase 20 mil pessoas em um deles”, diz. “E transformamos o Primo numa holding: começamos a utilizar a mídia dele para virar sócios de negócios estratégicos, como o aplicativo Kinvo.” FINANÇAS João Gabriel Faria Miranda, 24 João estudou um ano de ciência da computação, mas abandonou para focar no trabalho na Pagar.me (hoje parteda Stone), em que entrou aos 17 anos. Adquiriu experiência no setor financeiro para, quatro anos depois, fundara Hash: serviço de pagamentos para negócios B2B que já recebeu R$ 16 milhões em investimentos. “Viabilizamos que empresas não financeiras ofereçam soluções de pagamento customizadas para pequenas e médias empresas”, explica. “Um exemplo: a Leo Madeiras, que vende madeiras, criou a Leozinha, uma maquininha de pagamentos exclusiva para marceneiros, o que ajudou a ter um fluxo financeiro mais saudável e rentável. Tal customização é inviável para as grandes empresas que oferecem as soluções padrões.” FINANÇAS Vinícius Soares, 25 O garoto que vendia maçãs do amor para ajudar a mãe em Piumhi (MG) é um dos fundadores e diretor de produto da Monetus, gestora de investimentos digital baseada em Belo Horizonte. Selecionada como uma das 50 startups mais promissoras de 2019 pelo fundo norte-americano Kairos, a empresa atende 14 mil clientes que colocam ali de R$ 100 a R$ 1 milhão — totalizando mais de R$ 150 milhões. “Unimos princípios de economia comportamental, teoria moderna do portfólio e tecnologia de ponta”, diz. “Oferecemos uma plataforma através da qual os clientes podem definir seus objetivos e investir com apenas um clique com taxas quatro vezes menores que a média do mercado.” FINANÇAS Gabriel Kallas, 27 Aos 16 anos, no intercâmbio de high school, o mineiro Gabriel Kallas, hoje CEO da Toro Investimentos, assistiu como ouvinte às aulas sobre administração financeira na Universidade do Colorado. Constatou um cenário de investimentos diferente do brasileiro. “A maior parte investia em plataformas abertas, e metade da população investia em ações.” De volta ao Brasil, no primeiro ano de faculdade, ele se juntou a amigos para criar a Toro. “Começamos oferecendo uma plataforma de cursos gratuitos e análises online sobre investimentos”, recorda. “Em 2017, vendemos 40% da empresa por R$ 100 milhões, o que nos deu capacidade financeira para nos tornarmos a primeira fintech do Brasil a abrir sua própria corretora de valores.” FINANÇAS Paulo Bichucher, 29 Paulo começou como estagiário no Pátria Investimentos e ficou na empresa seis anos, atuando em private equity. Mas desde a faculdade ele queria empreender. Fez então um MBA na Wharton School, da Universidade de Pensilvânia, para novos modelos no mercado imobiliário, área de seu pai, Andre Bichucher. Da China, trouxe o conceito de apartamentos antigos reformados, mobiliados e compartilhados que se transformou no seu novo negócio, a Yuca (os outros sócios:Eduardo Brennand Campos e Rafael Steinbruch). Segundo Paulo, a empresa já levantou cerca de R$ 40 milhões para ter fôlego para adquirir imóveis e transformá-los em estúdios. A ideia é captar mais e criar um fundo de investimento imobiliário residencial voltado para renda. FINANÇAS Bruno Ballista, 29 Bruno começou a se interessar por finanças no curso “Aprenda a Investir em Ações”, oferecido pela XP, em 2007. Quatro anos depois, então estudante de administração de empresas na PUC-Rio, foi aprovado para estagiar na área comercial da XP Educação. Está na empresa desde então. “Em 2014, aos 24 anos, me tornei CEO da operação com 25 pessoas”, diz. No ano seguinte, tornou-se sócio do grupo e passou a gerir a XP Corretora de Seguros. Desde 2017 é head de assessoria e relacionamento com clientes na XP Investimentos. “Hoje são R$ 50 bilhões investidos, 360 mil clientes, uma equipe de 250 profissionais e quase R$ 500 milhões em faturamento anual.” GASTRONOMIA Paulo Assarito, 30 CEO do Cabana Burger, Paulo fundou seu primeiro negócio aos 19 anos enquanto cursava faculdade de administração. Trata-se da incorporadora Mint, em funcionamento há uma década, que nada tem a ver com gastronomia, salvo um detalhe: o sócio Bruno Lemos, que possui participação (com mais quatro sócios) no fenômeno Cabana. Em apenas três anos, a lanchonete, que lembra a cadeia americana Shake Shack, cresce exponencialmente: em 2020, o plano é inaugurar mais dez lojas próprias (atualmente são oito), localizadas no Sudeste do país. “A perspectiva é faturar R$ 100 milhões no próximo ano, o que representa crescimento 50% superior a 2019, quando faturamos R$ 70 milhões”, conta Paulo. “A gente fez uma captação, continuaremos com 100% de lojas próprias. A ideia é triplicar o volume de lojas inauguradas em 2021.” Só na unidade paulistana do Itaim Bibi, às sextas e aos sábados, são comercializados em média 2.300 hambúrgueres. Somando todas as lojas, o número se aproxima de 130 mil por mês. O próprio Paulo colabora com essa contabilidade: na quinta-feira que conversou com a Forbes, já tinha comido “burgers” quatro vezes na semana. “O foco é inaugurar com qualidade. Em nosso modelo de negócio, o limite de expansão é muito alto. Imagino o Cabana muito maior do que é hoje. Conseguimos criar uma marca forte. Agora, queremos escalar”, adianta. Quando questionado se, mesmo com dois negócios, ainda existe tempo para hobbies, revela que nos últimos quatro meses, sim: “É a minha filha, Georgia, que acabou de nascer”. GASTRONOMIA Tuca Mezzomo e Nathalia Gonçalves, 28 Tuca e Nathalia são os sócios que encabeçam o projeto gastronômico do restaurante Charco, em São Paulo. Gaúchos, eles usam suas raízes sulistas e lançam mão da brasa como chave para uma cozinha que leva à mesa dos comensais pratos bem pensados e saborosos. Tuca – que passou por casas como Dalva e Dito e Nino Cucina – fica à frente do cardápio que mescla carnes, peixes, frutos do mar, vegetais e embutidos feitos no restaurante, enquanto Nathalia – que trabalhou no D.O.M. e com Carole Crema, entre outros – é responsável pela inventiva confeitaria do Charco. GASTRONOMIA Cesar Costa, 28 O chef Cesar Costa começou o projeto do Corrutela, restaurante que comanda na Vila Madalena, aos 24 anos. Segundo o jovem, que leva na bagagem grande experiência internacional, a ideia era criar um modelo de negócios diferente, quereduzisse ao máximo o impacto ambiental que há em um restaurante, mas mostrando que sustentabilidade é algo lucrativo. O Corrutela, inaugurado em 2018, é quase resíduo zero. Ao mesmo tempo, a casa oferece gastronomia bem pensada, com alta preocupação com os ingredientes e a harmonização de sabores. GASTRONOMIA Gregório Salton, 30 Quarta geração da família na vinícola centenária, Gregório Salton se formou em enologia pela Universidad Juan Agustín Maza, de Mendoza, na Argentina, e tem uma pós-graduação em gestão vitivinícola pela Organização Internacional da Vinha e do Vinho. Na empresa, ele faz parte da equipe que cuida do processo enológico, da uva ao vinho, além de estar diretamente envolvido no desenvolvimento de produtos não alcoólicos e destilados. Gregório também participou da elaboração da marca-conceito Domenico, lançada em 2018, que traz ao mercado rótulos inovadores e exclusivos. GASTRONOMIA Nathalie Passos, 26 A jovem comanda o Naturalie, restaurante de comida vegetariana autoral que tem dois endereços no Rio de Janeiro – em Botafogo, aberto em 2015; e em Ipanema, inaugurado em 2018. Com especialização em gastronomia vegetariana na conceituada Natural Gourmet Institute for Health & Culinary Arts de NY, a chef ostenta passagens pelo renomado Dirt Candy, em Nova York, e o Pure Food and Wine, referência em culinária crua. “Acredito que comida saudável esteja diretamente relacionada à qualidade da matéria-prima, e quando digo qualidade, quero dizer: orgânicos, integrais e sazonais”, explica. GASTRONOMIA Boram Um, 29 Vencedor de 2019 do Campeonato Brasileiro de Baristas, Boram Julio Um é um dos dois nomes à frente da Um Coffee Co. Ao lado do irmão, Garam, de 30 anos, ele toca a rede de cafeterias – são quatro lojas, todas em São Paulo, e há planos para um quinto estabelecimento –, cuidando da operação e do serviço de torrefação. A marca prima por contemplar toda a cadeia produtiva do café, do plantio (na fazenda da família, no sul de Minas) até os perfis de torrefação quase 100% manuais. Em maio, Boram disputa o mundial de brewers, na Austrália. INDÚSTRIA Eduardo Vanzak, 27, e Lohran Schmidt, 26 Amigos da época da faculdade de administração em Belo Horizonte, Eduardo e Lohran tinham negócios separados, em áreas diferentes, mas compartilhavam certa insatisfação com o que faziam. Depois de muitas conversas, decidiram correr atrás de algo que contemplasse ambos. Em 2015, pausaram tudo e partiram para o Vale do Silício, na Califórnia, para pesquisar o que havia de mais moderno no mercado de bem-estar. “Descobrimos que o chá é a segunda bebida mais consumida no mundo, mas o Brasil não tinha esse hábito. Vimos a oportunidade”, conta Lohran. Ao voltar, passaram dois anos testando fórmulas. “Focamos em construir um produto que fosse saudável e gostoso o suficiente para que as pessoas menos acostumadas começassem a consumir”, lembra. Depois de mais de 50 tentativas, chegaram ao Desinchá, lançado em dezembro de 2017. O produto caiu rápido nas graças de famosos e musas fit do Instagram e, em dois anos, tornou-se a segunda marca de chá mais vendida no país, com 20 mil pontos de venda e duas lojas físicas em São Paulo. Em 2019, a empresa expandiu para a Desinchá Company, que oferece café, cursos sobre vida saudável (gratuitos e pagos) e uma linha de cosméticos naturais e orgânicos. “Adotar um lifestyle mais saudável nem sempre é fácil. Nós queremos criar produtos que ajudem a formar esse hábito”, afirma Eduardo. Eles contam que a companhia cresceu 400% em 2019, com presença em todos os estados e um escritório em Nova York, que vende para os EUA e o resto do mundo. Para 2020, o plano é consolidar a operação americana e expandir o número de lojas físicas. INDÚSTRIA John Cleyton de Oliveira, 30 John é um empreendedor nato. Ele começou a carreira aos 20 anos como mecânico montador, ganhando pouco mais de R$ 1.000 por mês. Em quatro anos, assumiu o departamento de montagem industrial da companhia em Sorocaba (SP), enquanto estudava economia e administração. Não demorou muito para abrir seu negócio. Em outubro de 2015, surgiu a Montalug, empresa de soluções em montagem industrial. Quatro anos depois, a companhia tem 120 funcionários, uma fábrica com 20 mil metros quadrados de pátio e faturamento anual de R$ 14,5 milhões. Para 2020, as projeções são ainda melhores: inauguração de mais uma fábrica e ganhos na casa dos R$ 25 milhões. INDÚSTRIA Augusto Aielo, 28 Paulistano criado no interior e jovem aprendiz do Senac, Augusto ajudou a fundar a Soul em novembro de 2014 com o objetivo de construir parklets (espaços de convivência nas vagas de estacionamento na rua) que harmonizem com o meio urbano e tenham pegada sustentável. Uma das autoridades do segmento no país hoje, a companhia não para de inovar: em 2019, lançou o primeiro parklet móvel da América Latina, que vira um espaço cultural nos fins de semana, e, para 2020, deverá lançar um parklet móvel com cervejaria. Bem-humorado, Augusto divide seu tempo entre ser o “faz tudo” da Soul, como brinca, e comandar o Voe Sem Asas, espaço de incentivo ao empreendedorismo. INDÚSTRIA Arthur Aikawa, 28 Formado em engenharia elétrica e doutorando em sistemas eletrônicos, Arthur tem sua história ligada à Escola Politécnica da USP. Foi de lá que saiu, em julho de 2016 em parceria com Matheus Manini e John Esquiagola, a Omni-electronica, startup de soluções de sensoriamento de ambientes para viabilização de edifícios inteligentes. O objetivo da companhia é, basicamente, tornar ambientes internos mais agradáveis e inteligentes, otimizando, por exemplo, ar, iluminação e barulho. O projeto comercial só foi lançado mesmo em 2018 e, desde então, já recebeu seis aportes de investimento. INDÚSTRIA Gabriel Beleze, 28 Gabriel tinha 20 anos e cursava engenharia de produção em Curitiba quando começou a se interessar pelo desenvolvimento de autobronzeadores. Seu objetivo era fazer um produto mais natural. O resultado chegou em 2013, com o lançamento da marca Skelt e seu Mousse Autobronzeador, carro-chefe da companhia que caiu no gosto de estrelascomo Sabrina Sato, Bruna Marquezine e Isis Valverde. Hoje, a empresa tem uma linha com sete produtos de funções como anti-idade e com agentes anticelulites. A Skelt é forte no e-commerce e tem presença física em todos os estados. Com faturamento crescente em 120% em 2019, o objetivo agora é internacionalizar a marca. INDÚSTRIA Alexandre Miranda, 29 Como usar a tecnologia para tornar uma construção mais barata, eficiente e segura? Esta é a premissa da startup cofundada por Alexandre em julho de 2016. A Maply parte de uma ideia simples, porém engenhosa: monitorar as obras por meio de imagens aéreas de drones. A empresa disponibiliza o drone e a companhia, por meio de aplicativo próprio, automatiza seu sobrevoo para coletarinformações sobre o andamento da construção. A estimativa é que a tecnologia reduza em até 80% o tempo de mapear as áreas externas. Hoje, a construtech, como são chamadas as startups do setor, trabalha para pequenas e gigantes construtoras, como a MRV. MARKETING E PUBLICIDADE Greta Paz, 28 Paulistana de nascimento e gaúcha de criação, Greta se formou em jornalismo em Porto Alegre, mas logo rumou para a área de produção de conteúdo. Trabalhou no grupo RBS e, em abril de 2013, fundou sua primeira empresa de estratégia de comunicação focada no YouTube. “Há oito anos, tinha que falar para os clientes o que exatamente era o YouTube e por que as marcas deveriam estar na plataforma. Era difícil ver marcas com esse perfil produzindo conteúdo de qualidade.” Ela participou da direção da agência por cerca de cinco anos, quando decidiu enfrentar novos desafios e fundou a Eyxo, também de produção de conteúdo, no início de 2018. No novo negócio, decidiu mudar a estratégia. “Entendi que não fazia sentido construir uma empresa em cima de uma plataforma. Hoje trabalhamos com experiência de conteúdo, contando histórias de marcas.” Com dois anos, a empresa tem operação em Porto Alegre e São Paulo e clientes de peso, como Unilever, 99, O Boticário, ESPN, Banco 24 Horas e John Deere. Greta fala com empolgação sobre a companhia. Orgulhosa, conta que recebeu recentemente a Certified B Corporation, certificação internacional voltada a empresas que atendem a um alto padrão de impacto social, ambiental, transparência e prestação de contas. Em 2019, a Eyxo faturou R$ 4 milhões, com crescimento de 40% – mesma meta para 2020. “Para isso, vamos investir em tecnologias de experiência de conteúdo, reforçar a nossa rede de parceiros e desenvolver uma plataforma proprietária de gestão e relacionamento com os nossos clientes.” MARKETING E PUBLICIDADE Lara Thomazini, 30 Formada em jornalismo pela UFBA, a soteropolitana ficou pouco tempo na imprensa até rumar para a área de planejamento de uma agência em Salvador. Interessada em pesquisa e estratégia, ela nunca mais voltou: mudou-se para São Paulo e começou a trabalhar com branding. Hoje, responsável por todas as ações de mídia da Tembici, uma das principais empresas de aluguel de bicicletas compartilhadas da América Latina, ela também é engajada no debate da presença da mulher na comunicação, com moderação de grupos de discussão e participação no projeto Hostilidade, Silêncio e Omissão, que estudou assédios moral e sexual em empresas do setor. MARKETING E PUBLICIDADE Aquiles Borges Filho, 29 Formado em publicidade e propaganda pelo Mackenzie, Aquiles seguiu o caminho dos pais ao entrar no meio executivo. Ele começou a carreira como estagiário no departamento comercial da extinta Gazeta Mercantil, passou por grandes agências, como DM9 e Publicis, onde se apaixonou pela área de mídia. Desembarcou no Google em fevereiro de 2019, como gerente de contas para aplicativos que usam suas plataformas para monetização. Paralelo a isso, Aquiles é um dos idealizadores do grupo Publicitários Negros, que promove encontros para evolução e networking entre profissionais da área. Fundado em julho de 2017, já tem quase 2 mil participantes de oito estados. MARKETING E PUBLICIDADE Guilherme Oliveira, 27 Guilherme entrou para o mundo da comunicação aos 17 anos. Começou na área trabalhando com Priscilla Alcantara (cliente até hoje) quando ela apresentava o Bom Dia & Cia, do SBT. Alguns anos depois, teve contato com aapresentadora Maisa por meio de um projeto digital. A parceria deu tão certo que a atriz tem mais de 49 milhões de seguidores nas mídias – e os dois seguem juntos há cinco anos e meio. Hoje, por meio da agência Mostre-se, ele trabalha ainda com o apresentador Celso Portiolli. Seu maior desafio, diz, é traduzir a naturalidade de cada artista para as mídias. MARKETING E PUBLICIDADE Victor Lira, 27, André Bain, 28, Nadav Peretz, 29 e Rafael Goldenberg, 26 A semente da Flowsense, plataforma para empresas medirem engajamento dos clientes, surgiu em 2015, com a ideia de um aplicativo que se mostrou inviável. Formados na USP e com experiência em mobile, inteligência geográfica e big data, Victor, André e Nadav decidiram ser práticos: usar a geolocalização de usuários de outros apps para mapear anonimamente seus perfis e hábitos de consumo. Em 2016, veio a primeira rodada de investimentos e Rafael entrou na sociedade. A empresa já analisou 75 milhões de usuários único de mais de 100 apps e tem como parceiros Carrefour, Bradesco, UOL e Lojas Americanas. MARKETING E PUBLICIDADE Camilla Ciappina, 28 Formada em direção de arte pela Miami Ad School de São Paulo, Camilla atua na área desde 2014, quando entrou para a Havas como assistente de arte. Desde então, passou por algumas das mais conceituadas agências do país, como AlmapBBDO e Loducca. Em 2017, ela decidiu se mudar para Nova York atrás de novas oportunidades. Lá, trabalhou na DiMassimo Goldstein e, desde 2018, é diretora de arte na Publicis, responsável pelas contas Walmart e Citibank. Ela é fundadora do Pimp My Portfolio, empresa dedicada a auxiliar profissionais a construírem ou melhorarem seu portfolio online. Em quase três anos, já montou 380 sites. MODA Amanda Cassou, 28 Há nove anos, quando cursava administração de empresas no Insper, em São Paulo, Amanda teve a ideia – com a irmã Mariana – de criar um e-commerce combinado a um blog de conteúdo: Gallerist, business que atraiu rapidamente outras mulheres Cassou: as irmãs Fernanda e Carolina e a mãe, Denise. Em 2015, o Gallerist ultrapassou os limites da internet e abriu a primeira loja física, no Shopping Cidade Jardim (São Paulo), e, na sequência, no Shopping Pátio Batel (Curitiba). Em 2019, mais dois endereços em São Paulo: Shopping Iguatemi e uma loja de rua no bairro de Pinheiros. Paralelamente ao Gallerist, as irmãs começaram a lançar marcas próprias. Primeiro, a Framed Clothing; depois, Allmost Vintage, Edamimi Kids, Clemence Clothing e Linen Resortwear. A caçula Amanda é a buyer do Gallerist e está à frente do estilo e do branding das marcas Framed (quinta marca brasileira mais vendida na Farfetch internacional) e Allmost Vintage (a empresária Luiza Ortiz é sócia). “Em 2020, queremos crescer 30% e manter o portfólio de marcas que criamos.” Com uma curadoria 100% de marcas brasileiras no Gallerist, Amanda comenta: “Vejo como uma missão levar a moda nacional para fora do país e também ser um agente que conecta novos talentos com o consumidor final. Que é o que já fazemos na multimarca: ajudamos novos designers, que são os nossos fornecedores, a chegar ao público certo.” MODA Eduarda Galvani, 26 Com investimento inicial de R$ 20 mil, a estilista especialista em alta-costura abriu seu ateliê em Porto Alegre em 2016. Dois anos depois, registrou faturamento de R$ 1,2 milhão. Os resultados motivaram a abertura de um espaço para receber clientes em São Paulo, um ponto de vendas no Rio de Janeiro e o lançamento de um segmento da marca para pronta entrega. Eduarda herdou a paixão por moda de sua avó Celina Bona, que, no passado, comandava um ateliê de tingimentos. Hoje, vovó Celina está feliz da vida, envolvida com a marca da neta. MODA Nicole Degreas, 23 A primogênita da estilista Adriana Degreas começou a trabalhar oficialmente na empresa como assistente de vendas em 2014. Após transitar por diversas áreas, chegou ao cargo atual: head do departamento internacional e diretora de e-commerce brasileiro (fruto de uma iniciativa própria dentro da empresa). No dia a dia, lida com os showrooms em grandes lojas de departamento internacionais, como Net-a-Porter e Moda Operandi, garantindo o posicionamento correto da grife no exterior. Também é embaixadora da grife para a geração Z. Segundo Nicole, com sua atuação nessa faixa etária, a porcentagem de clientes mais jovens aumentou. MODA Leo Picon, 23 Com apenas 16 anos, Picon fundou, com os amigos Cacá Parra, Felipe Akira e Tatá Estaniecki a marca de roupas Approve. As coleções atuais trazem peças streetwear, toques de customização, modelagens unissex e são vendidas em quantidades limitadas: fórmula perfeita para atrair os mais jovens. Entre os feitos do último ano: inauguração de uma loja conceito e o desenvolvimento de uma linha de roupas emparceria com o Cabana Burger [outro Under 30 desta lista]. Picon despontou aos 13 anos na seção Colírio, da revista “Capricho”. Hoje tem 4 milhões de seguidores no Instagram, além de um canal do YouTube com 1 milhão de inscritos. É proprietário do Galleria Bar, do restaurante Luz, Câmera, Burger! e da produtora ROL Films. MODA David Lee, 27 Um dos feitos recentes do estilista cearense David Lee foi ser escolhido como um dos 16 finalistas da edição de 2019 do International Fashion Showcase, evento promovido pelo British Fashion Council, ocasião na qual expôs suas peças na Somerset House, em Londres. Sua marca homônima, fundada em 2015, traz coleções inovadoras e com amplo uso de técnicas artesanais, como o crochê, que não é visto com frequência em roupas masculinas. Desde 2018, após ganhar um concurso da Reserva, comercializa suas roupas no e-commerce da marca. MODA Victor Hugo Mattos, 30 A formação em teatro é nítida nas criações de Victor Hugo, diretor criativo da marca própria que possui há cinco anos e que leva seu nome. Suas roupas ricas em bordados são maximalistas e dramáticas e conquistaram celebridades como Iza e Glória Maria. Apropriando-se do upcycling, ele cria suas peças a partir de garimpos em brechós, mesclando com maestria o antigo e o novo. Em 2018, foi convidado a participar do Projeto Estufa, iniciativa do SPFW para jovens talentos. Após participar do programa “Shark Tank Brasil”, Victor tornou-se sócio do empresário Caito Maia. Em 2020, passa a integrar o line-up do SPFW. MÚSICA Luísa Sonza, 21 O ano de 2019 foi marcado por realizações na vida de Luísa Sonza. Ela traçou o plano de provar que era mais do que pensavam dela, em um momento em que aparecia na mídia mais pelo seu lado de influenciadora digital do que pela música. “Foi o ano de virar a chave. Iniciou com as dúvidas sobre quem eu era, o que eu fazia, de onde eu vinha”, afirmou a jovem. E deu certo. Aos 21 anos, lançou o primeiro disco, “Pandora”, e viu suas músicas entrarem para as listas das mais ouvidas no país, tornando-se um nome de destaque na música pop nacional (só no Spotify, acumula mais de 5 milhões de ouvintes mensais; “Devagarinho”, o primeiro hit, passou 270 dias entre as mais ouvidas da plataforma). Nascida em Tuparendi, cidade de menos de 9 mil habitantes e a 500 km de Porto Alegre, Luísa iniciou a carreira ainda criança, cantando em uma banda de casamento. Foi ali que aprendeu a cantar de tudo um pouco e ganhou jogo de cintura. Com apenas 5 anos, já ensaiava como daria entrevistas quando fosse famosa. Foco é a palavra de ordem para a cantora, que encontrou na internet o meio de sair da cidade em que morava no interior e conquistar as capitais. Agora, mira no exterior a expansão da carreira. Em 2019, lançou a primeira parceria internacional com o grupo norte-americano PrettyMuch. Para os que chegam ao fim deste ano ainda duvidando do talento de Luísa, ela é direta: “Vou mostrar com meu trabalho os resultados para que não restem dúvidas”. MÚSICA Pedro Calais, 23 Ele é a cara da banda Lagum, formada despretensiosamente em 2014 na cidade de Brumadinho (MG). Com uma pegada descontraída e jovem, a banda conquistou o público ao falar sobre os dilemas de sua geração, suas dúvidas e seus anseios. No ano passado, o hit romântico “Deixa” caiu no gosto de Neymar em plena Copa do Mundo da Rússia. Foi o suficiente para a banda se tornar conhecida no país inteiro e entrar nas listas de mais tocadas nas rádios e nas plataformas de streaming. Além de ser o vocalista da Lagum, Pedro tem se destacado por suas composições e já garantiu parcerias com nomes como IZA e Vitor Kley. MÚSICA Felipe Araújo, 24 O sertanejo continua sendo um dos gêneros musicais de mais expressão no país, com artistas e músicas nas listas dos mais ouvidos em diferentes plataformas, das mais tradicionais às mais modernas. Felipe Araújo é o dono da Música do Ano, “Atrasadinha”. A parceria com o cantor de pagode Ferrugem ultrapassou a marca de meio bilhão de plays nas plataformas de streaming, mas não se tratou de hit único. O jovem cantor vem emplacando sucessos há anos, como “Amor da Sua Cama”, “A Mala é Falsa” e “Ainda Sou Tão Seu”, construindo uma carreira sólida, saindo da sombra do irmão, Cristiano Araújo, falecido no auge em acidente automobilístico que chocou o Brasil em 2015. MÚSICA Jão, 25 Jão faz parte da crescente lista de artistas que são descobertos na internet e acabam saindo do virtual para o real, assinando contrato com gravadoras e conquistando uma legião de fãs. Em um ano, o cantor lançou dois álbuns pela Universal Music: “Lobos” e “Anti-Herói”. O primeiro entrou na lista de 2018 de Melhores Discos do Ano da “Rolling Stone Brasil”. Com grande público adolescente e jovem, Jão desponta como um dos representantes do pop brasileiro, ainda crescente. Em 2020, já está escalado para participar de grandes festivais, como Lollapalooza (SP), Planeta Atlântida (RS) e Planeta Brasil (MG), além de seguir viajando o país em turnê. MÚSICA Melim (Gabriela, 25, Rodrigo e Diogo, 27) O talento do trio Melim está no DNA. A banda foi formada pelos irmãos depois de tentarem trilhar caminhos separadamente e começou a cair no gosto do público em 2016, quando participou do programa “Superstar”, da TV Globo. Chegou até a semifinal. Graças à visibilidade do concurso, os irmãos conseguiram um contrato com a gravadora Universal Music e não pararam mais. Os hits românticos “Meu Abrigo”, “Ouvi Dizer” e “Gelo” dominaram as rádios e as plataformas de streaming em 2019, e eles já acumulam parcerias com nomes admirados por diferentes públicos como Nando Reis, Ivete Sangalo, Sandy e Anitta. O trio já entrou em estúdio para produzir o segundo disco da carreira, que chega em 2020. MÚSICA Felipe Naim, 23 O jovem descobriu o amor pela música na infância, quando ouviu a marcha nupcial em um casamento e se encantou pelo piano. Desde então, se dedica a estudar música e transmitir seu conhecimento. Formado bacharel em piano pela Escola de Música da UFRJ, já atuou como pianista do Theatro Municipal do Rio de Janeiro e acaba de vencer o “Prelúdio”, programa de calouros de música erudita da TV Cultura. Como prêmio, ganhou uma bolsa de estudos na Academia Franz Liszt, na Hungria. TECNOLOGIA E INOVAÇÃO André Siqueira, 29 Cofundador da maior empresa brasileira de SaaS (software as a service) do Brasil, a Resultados Digitais (RD), André Siqueira tinha apenas 20 anos quando a startup nasceu, em 2010, o que o torna um dos mais jovens fundadores do país, segundo o estudo 100 Super Founders, da Distrito Dataminer. Nascido em Aparecida (SP), cidade que vive do turismo religioso, o contato de Siqueira com as dinâmicas do comércio começou na infância. Em Santa Catarina, onde estudou administração, entrou de cabeça no mundo de marketing e vendas, e conheceu Eric Santos, Bruno Ghisi, Guilherme Lopes e Pedro Bachiega, o grupo ao qual se juntou para fundar a RD, que hoje tem 700 funcionários. Sob a liderança de Siqueira, a empresa criou projetos como o RD Summit, evento anual de marketing digital em Florianópolis que atraiu mais de 12 mil pessoas em 2019. O crescimento pessoal e da empresa trouxe dores, mas, com quase 30 anos, o fundador chegou a um ponto de equilíbrio. “Meus sócios são cinco, dez anos mais velhos que eu, e são pessoas muito acima da média: isso trouxe uma pressão para entregar tão bem quanto eles, mesmo tendo menos experiência”, relata. “Amadureci e, com a análise e a paternidade, entendi que não preciso ser um prodígio o tempo todo.” O foco atual do empreendedor é a RD University, um Netflix de capacitação em disciplinas digitais, cuja oferta gratuita e corporativa deve treinar 50 mil pessoas em 2020. TECNOLOGIA E INOVAÇÃO Rafael Rodeiro, 24 Rafael Rodeiro criou a Ribon para facilitar doações para instituições de caridade. A interação com marketing de conteúdo de marcas através do aplicativo gera moedas virtuais, que usuários podem doar para projetos executados por ONGs globais, em áreas como nutrição infantil e combate a doenças tropicais no Brasil e outras regiões, como no sudeste da África. A empresa fica com 30% da receita de anunciantes como Visa e Votorantim, e o restante é convertido para as iniciativas. O brasiliense vai expandir para os Estados Unidos e Europa em 2020 e aumentar a base de usuários de 50 mil para 200 mil com o apoio de celebridades. TECNOLOGIA E INOVAÇÃO Simony César, 27 De uma frase da cantora Nina Simone, que definiu liberdade como “não ter medo”, surgiu o nome do projeto de tecnologia Nina, que rastreia casos de assédio à mulher na mobilidade urbana. Filha de cobradora de ônibus, Simony César criou a tecnologia, que mapeia, rastreia e analisa ocorrências, fornecendo provas contra agressores. Além de aplicativos como o Cittamobi, a prefeitura de Fortaleza está entre os usuários da ferramenta. Simony espera que mais autoridades usem o recurso como parte de suas políticas de segurança pública. Em 2020, a pernambucana acelera os aspectos de experiência, produto e comunicação da ferramenta na Volkswagen, na Alemanha. TECNOLOGIA E INOVAÇÃO Renan Hannouche, 29 Apesar de ser engenheiro da computação, as paixões de Renan Hannouche são pessoas: suas histórias e seus problemas. O empreendedor tem múltiplos negócios em operação, viabilizados por sua empresa de software Let’s. Para atacar problemas sociais complexos, criou a Ikone, liga global que une empreendedores, investidores, ONGs e voluntários para concretizar projetos que endereçam os objetivos de desenvolvimento sustentável definidos pela Organização das Nações Unidas. Em 2020, lançará o Gravidade Zero, centro de impacto social e empreendedorismo com mais de 5 mil metros quadrados em Cabo de Santo Agostinho, em Pernambuco, cuja agenda incluirá um programa de cursos com parceiros como a Singularity University. TECNOLOGIA E INOVAÇÃO Rafaela Herrera, 28 Uma das personagens mais conhecidas do ecossistema de inovação brasileiro, Rafaela impactou mais de 100 mil pessoas com seu trabalho. Como head de startups do hub de empreendedorismo e inovação Cubo Itaú, já orientou mais de 1.500 startups e trabalhou em 300 novos negócios. Nascida na periferia de São Paulo, Rafaela graduou-se como engenheira biotecnológica com especialização em ciências de alimentos. Antes de se juntar ao Cubo, criou a Cozinhaê, para mudar a alimentação de pessoas de baixa renda, que tendem a ter uma dieta hipercalórica e com baixo teor nutritivo, com receitas de maior valor nutricional. TECNOLOGIA E INOVAÇÃO Lívia Cunha, 27 Filha de um médico e empreendedor, Lívia criou a Cuco Health em 2015. O app oferece uma experiência gratuita com características como lembretes de medicamentos, e uma área premium, onde empresas como a Medley e a Roche patrocinam conteúdos em formato de game. Em 2020, Lívia vai trabalhar no avanço na digitalização da adesão a tratamentos, lançando novos recursos como compras de remédios através do app. A base atual de 150 mil usuários deve aumentar para 1 milhão de vidas em 2020. TERCEIRO SETOR E EMPREENDEDORISMO SOCIAL Wellington Trindade Vitorino, 25 Nascido em Niterói, Wellington começou a trabalhar aos 8 anos, ajudando o pai no comércio ambulante na praia. Aos 12, ganhava dinheiro vendendo picolés num batalhão da PM no Rio de Janeiro. Morador de São Gonçalo e estudante da rede pública, conseguiu bolsa para cursar o terceiro ano do ensino médio em uma escola particular da zona sul carioca. Tornou-se bolsista da Fundação Estudar, formou-se em administração de empresas no Ibmec-RJ. Então, aos 21 anos, criou um programa para apoiar jovens como ele a se tornar líderes preparados para atuar na esfera pública ou empreender na iniciativa privada. Wellington conta que a ideia do programa ProLíder veio em 2015, um dia depois de ouvir de Nizan Guanaes, em uma palestra, que a juventude precisava se mobilizar mais. “Se o Brasil precisa resolver problemas e o vetor são os jovens, o que eu pensei? Vou criar alguma coisa para reunir talentos jovens que tenham o compromisso de transformar o país”, diz. “A melhor maneira de fazer isso é formando essas pessoas, dando acesso a network, reunindo numa mesma sala gente de todas as regiões, com diversidade de raça, gênero, classe, ideologia, orientação sexual.” Com o apoio de empresários e organizações, como a Fundação Lemann, o ProLíder é um programa gratuito que traz nos fins de semana para São Paulo gente de 16 a 35 anos vinda de mais de uma dezena de estados. São sete meses de curso, com 200 horas de aulas sobre temas como economia, infraestrutura, sustentabilidade e educação. Na última edição, segundo Wellington, foram 9.435 inscritos para 36 vagas. Além da formação completa, o Instituto Four, que mantém o ProLíder, organiza versões pocket do programa, com aulas ministradas em diferentes cidades. Em 2019, fez também o evento Four Summit, para discutir áreas estratégicas do país. TERCEIRO SETOR E EMPREENDEDORISMO SOCIAL Mariana Montag Ferreira, 25 Então estudante de arquitetura, Mariana transformou seu trabalho final de graduação em um projeto de casa com potencial para mudar a vida de uma mulher em Uganda — e mudar também a forma como as mulheres se relacionam com a construção, em diferentes lugares do mundo. A Casa de Jajja é uma residência para Jajja Imaculate, moradora do vilarejo rural de Kikajjo, que Mariana conheceu quando era voluntária no programa Escola em Uganda. Reconhecida pela premiação Beyond Bauhaus, na Alemanha, A Casa de Jajja arrecadou fundos em um financiamento coletivo e agora entra em fase de execução, com a participação de mulheres da comunidade e voluntárias de vários países. TERCEIRO SETOR E EMPREENDEDORISMO SOCIAL Laís Leão, 26 Laís não se sentia segura para ir e voltar a pé para a faculdade de arquitetura e urbanismo em Curitiba. Resolveu investigar o problema, distribuiu questionários entre colegas e constatou ali uma questão de gênero: o sentimento era compartilhado por outras alunas. “As mulheres têm uma sensação constante de insegurança urbana, que afeta seu acesso e direito à cidade”, diz Laís. Por causa da pesquisa, a curitibana foi chamada para participar do evento European Development Days, da Comissão Europeia, em 2018. Na volta, ela criou a InCities, organização que apoia iniciativas em prol de cidades mais seguras para mulheres e para todos. TERCEIRO SETOR E EMPREENDEDORISMO SOCIAL Luiz Eduardo Pedroza, 28 Luiz é cofundador da Audima, startup de impacto social que usa tecnologia para transformar textos de sites em áudio e assim tornar as informações acessíveis para pessoas com dificuldade de leitura. “Estamos falando de mais de 50 milhões de brasileiros”, diz Luiz, que criou a empresa com a irmã, Paula. Em 2016, a Audima passou pelo programa de aceleração de startups Pioneer Accelerator da GSVlabs em parceria com o Google Launchpad. “Começamos na sala do apartamento. Hoje nossa operação é sediada no Rio de Janeiro, com representantes comerciais em São Paulo, Nova York e Lisboa. E mais de 4 mil sites e empresas utilizam nosso software.” TERCEIRO SETOR E EMPREENDEDORISMO SOCIAL André Soler, 26, e Vinícius Lima, 24 O cineasta André Soler e o jornalista Vinícius Lima mostram no projeto SP Invisível (site e redes sociais) as histórias da cidade que a maior parte da população não vê. O trabalho surgiu a partir de uma saída fotográfica dos dois em dezembro de 2013. No ano seguinte, eles começaram a andar por São Paulo ouvindo pessoas em situação de rua e publicando esse conteúdo em redes sociais. “O projeto humaniza e mobiliza a sociedade para uma corrente do bem”, diz André. “Como aconteceu com o Geraldino, que precisava de uma cirurgia e um médico o ajudou; com o Jorge, que saiu da rua e conseguiu emprego; ou com o Bruno, que reencontrou sua família.” TERCEIRO SETOR E EMPREENDEDORISMO SOCIAL Thalita Gelenske Cunha, 30 Destacada no perfil do LinkedIn de Thalita, a foto da estátua Fearless Girl encarando o Touro de Wall Street ajuda a contar a história da administradora de empresas: ela quer lutar como uma garota por um mundo mais inclusivo. Para isso, em 2018, criou a Blend Edu, uma startup que desenvolve experiências educacionais para promover a diversidade nas organizações. Com base no Rio de Janeiro, a empresa já fez projetos para clientes como 3M, Tim e Grupo Fleury. Por sua atução, em 2019, ela participou do encontro anual do Fórum Econômico Mundial, em Davos, como membro do grupo de jovens Global Shapers. VAREJO E E-COMMERCE Bruna Vaz, 25, e Fábio Rodas Blanco, 26 A primeira parceria de Bruna e Fábio foi um empreendimento social. Eles estudavam no Insper em 2013 e montaram a Renovatio, uma startup que produz e doa óculos de grau para pessoas em vulnerabilidade. Sem fins lucrativos, notaram eficiência na união e partiram para um novo negócio (dessa vez, lucrativo). A ideia para um marketplace de entrega de produtos domésticos a preços baixos surgiu de um incômodo. “A gente compra os itens para casa da mesma forma que nossos avós compravam, só que hoje todo mundo anda com computador no bolso!”, conta Fábio. Eles pesquisaram um modelo de venda nos EUA em que os pedidos eram feitos online, as compras eram feitas em diferentes lugares e os produtos eram entregues juntos, por um valor mais baixo. Com o modelo em mente, eles começaram à moda antiga: distribuíam panfletos na rua e iam ao atacarejo comprar os produtos para montar a venda. A primeira entrega foi em 2015. O próximo passo foi procurar por investidores-anjo para impulsionar o negócio. A ideia pegou tão bem no mercado que, já na primeira rodada, levantaram R$ 100 mil. Quatro anos depois, R$ 10 milhões de nomes como José Galló e Ariel Lambrecht. A estrutura está cada vez maior. A Shopper entrega hoje para 750 bairros em sete cidades de São Paulo, com crescimento de 20% a 35% ao mês no faturamento, o que faz com que este dobre a cada três ou quatro meses. Com a fórmula de oferecer sempre os preços mais baratos, eles se orgulham de já terem economizado aos clientes mais de R$ 3 milhões. Agora, o plano é levar essa economia para outras cidades e lançar o Appius, um gadget instalado no lixo que detecta quando cada item da dispensa irá faltar. VAREJO E E-COMMERCE Ana Cecília Navarro, 27 Quando começou a atuar como dentista, Ana Cecília não queria trabalhar sempre com o mesmo jaleco branco. Ela sentia falta de roupas profissionais que fossem ao mesmo tempo confortáveis, elegantes e femininas. A solução? Começar a fazer as próprias. Não demorou para que as colegas perguntassem de onde vinham os modelos. Ela viu o nicho e, junto com a irmã Ana Carolina, investiram R$ 2 mil para fundar a Dra. Cherie, produtora de jalecos estilizados. Cinco anos depois, a marca fatura R$ 1 milhão por mês com duas lojas físicas (São Paulo e Brasília) e uma estrutura de 50 funcionários. Para 2020, ela planeja inaugurar ao menos mais dois pontos. VAREJO E E-COMMERCE Luiz Guilherme Saouda, 28 Formado em sistemas da informação, Luiz trabalha com tecnologia desde os 16 anos – e foi a paixão por TI que o levou para a F360° há cinco anos. Henrique Carbonell, fundador da empresa, era franqueado O Boticário e via grande necessidade de melhorar o sistema financeiro para ter mais economia e reduzir custos. Assim, ele teve a ideia de criar uma plataforma de gestão financeira voltada ao varejo e chamou Luiz para desenvolver o sistema. Aos poucos, o jovem se tornou CTO e hoje é sócio de Henrique na companhia. Em 2019, a F360° faturou R$ 8 milhões e recuperou R$ 41 milhões para seus clientes. VAREJO E E-COMMERCE Mateus Souza Borges, 28 De origem humilde, Mateus trocou o interior mineiro pela engenharia mecânica na Unicamp. Trabalhou com drones e máquinas agrícolas nos Estados Unidos e voltou para o Brasil com a ideia de trabalhar na área, mas acabou no LinkedIn. Lá, conheceu os sócios, Adelmo Inamura e Ricardo Garcia, com quem montou o marketplace de insumos agrícolas ProdutorAgro, em 2016. Fundida à tecnológica Bravium, chegaram a monitorar 600 mil hectares de soja no Brasil. Os resultados atraíram a Bayer, que propôs a criação de uma joint venture em junho de 2019. Nascia a Orbia, a maior plataforma digital de negócios do agronegócio brasileiro (140 mil agricultores engajados: ele é responsável por insumos e commodities). VAREJO E E-COMMERCE Anna Lugli, 28 A paulista Anna Lugli teve a ideia de criar uma empresa de aluguel de bolsas inicialmente como trabalho de conclusão do curso de administração na Faap, em 2015. Ela montou um business plan, analisou o mercado de locação de produtos de luxo no exterior e viu que tinha futuro. Passou um ano implantando o projeto e, em março de 2017, o site da I Bag You estava no ar. Como boa empreendedora, já fez de tudo na empresa: do marketing ao atendimento ao cliente. Hoje, foca na coordenação e curadoria das bolsas. Quase três anos depois, a companhia é referência em aluguel de luxo no país, com 5 mil locações ao final de 2019 e um faturamento de R$ 1 milhão. VAREJO E E-COMMERCE Alyson Tabosa, 30 Alyson teve a ideia para a Coteaqui enquanto fazia ciências da computação na UFPE. Fundado em 2014, o marketplace de cotação de valores de materiais de construção oferece um serviço eficiente e completo: as companhias dizem o que precisam e a startup orça as melhores condições de compra, dos menores valores ao melhor tempo de entrega e marcas mais confiáveis. Seu sistema identifica qualquer fornecedor que esteja online. Para ter acesso ao serviço, que dura de dois a quatro dias, as construtoras pagam mensalidades a partir de R$ 600. A Coteaqui é o maior portal do segmento no Nordeste, participou de 200 obras em nove estados em 2019 e trabalha com mais de 5 mil fornecedores por todo o país. WEB E E-SPORTS Ana Laura Magalhães, 28 Nascida em Uberlândia (MG), a criadora do “Explica Ana” tem mais de 131 mil seguidores no Instagram e outros milhares no Facebook, LinkedIn, Twitter e YouTube, onde a influenciadora tem um impacto semanal total de 4 milhões de usuários. Aos 28 anos, Ana busca descomplicar o “economês”. “Quero que as pessoas entendam de forma básica, engraçada e dinâmica como tudo isso funciona.” Formada em relações internacionais pela Universidade Federal de Uberlândia, o primeiro contato de Ana com o universo de finanças foi na graduação, nas aulas de política monetária. No final do curso, começou os estudos em economia. Em 2014, iniciou o mestrado e fez as malas para Nova York em busca de novos projetos. De volta à cidade natal, Ana começou a estagiar em uma empresa de crédito agrícola. O emprego foi o norte para sua tese: “Como o Brasil tinha se tornado um credor de crédito de carbono do mundo”. Na mesma época, um amigo de São Paulo conseguiu uma entrevista de Ana na XP Investimentos. Após 17 entrevistas em diversas áreas da empresa, a especialista em finanças ingressou a área de assessoria e atendimento ao cliente. Uma coisa incomodava a mineira: cada resposta nas redes sociais tinha que passar pela aprovação do jurídico. “Eles tinham o prazo de 48 horas. Mas não dá para falar depois de amanhã sobre a variação do dólar de ontem.” Isso motivou o nascimento de redes sociais proprietárias, criadas em julho de 2018. “Meu objetivo é criar as pílulas deinformação para as pessoas mais jovens se tornarem cada vez mais antenadas no assunto.” Em 2020, Ana planeja o lançamento de três livros de finanças e participação feminina nesse universo, além da criação de uma ONG. WEB E E-SPORTS Felipe “brTT” Gonçalves, 28 Único brasileiro pentacampeão nacional (CBLoL) com presença em duas edições do mundial de League of Legends, o jogador profissional começou sua carreira no game DotA. No LoL, ingressou em 2011. Dois anos depois, defendendo a equipe paiN Gaming, Felipe conquistou seu primeiro título. Com passagem pelos times Keyd Stars, Red Canids e Flamengo eSports, o carioca também investe na capacitação de jovens nos esportes eletrônicos com a Playerlink, que oferece 823 minutos de videoaulas para que os alunos melhorem o desempenho no jogo competitivo. Além disso, “brTT” possui a Rexpeita, marca de roupas streetwear. WEB E E-SPORT Gus Lanzetta, 29 Fundador e produtor executivo da Half Deaf, produtora de podcasts, Gus já atuou como jornalista em diversas publicações. Só para a “Rolling Stone Brasil” foram dez anos de contribuições. Atua também como roteirista na Rede Globo. No crescente mercado dos podcasts, Gus não é novato. Participa e cria programas desde 2006. Na Half Deaf, é apresentador do “Papo Torto” e “Imagina Juntas”, além de ser produtor executivo dos primeiros Spotify Originals do país (“Kpapo” e ‘Prepare Seu Coração”). Para 2020, o empreendedor planeja desenvolver projetos para televisão e plataformas de streaming baseados nos programas de sua produtora. WEB E E-SPORTS Nicolle “Cherrygumms” Merhy, 22 A jovem ex-jogadora profissional é sócia e CEO do time de eSports Black Dragons, que disputa quatro modalidades de games e conta com mais de 60 jogadores. O clube brasileiro existe desde 1997, mas a chegada da carioca Nicolle à instituição paulista como atleta foi em 2014, em Quake 3 Arena, aos 17 anos. Dois anos depois, jogou profissionalmente Rainbow Six: Siege. Pouco tempo depois, assumiu o comando da equipe. Em suas redes pessoais, soma mais de 455 mil inscritos no YouTube, 250 mil de seguidores no Instagram e 80 mil no Twitter, onde faz publicações patrocinadas e transmissões ao vivo no Facebook Gaming. WEB E E-SPORTS Bruno “Fred” Carneiro, 30 Jornalista e apresentador do canal de futebol Desimpedidos desde 2015, Bruno entrou na vaga de Felipe Andreoli, após um concurso do canal para os fãs em que o ganhador integraria o elenco dos participantes. O apelido é fruto da semelhança física com o jogador Fred, atacante do Cruzeiro rebaixado da Série A do Campeonato Brasileiro em 2019. Com Bruno, o canal de 500 mil inscritos saltou para mais de 7 milhões. Nele, possui dois dos principais quadros: Fred+10 e Desafio do Fred, que já receberam grandes nomes do futebol como Marcelo, Neymar, Coutinho, Marta, Pelé, Cristiano Ronaldo, entre outros. O influenciador tem mais de 5 milhões de seguidores em suas redes sociais. WEB E E-SPORTS Bruno “Playhard” Oliveira, 24 Fundador do canal que lhe rendeu o nome pelo qual é conhecido desde 2014, Bruno foi um dos pioneiros no YouTube a produzir conteúdo focado em jogos de celular, aos 19 anos. A fama online veio com vídeos de Clash of Clans e sobre seu intercâmbio nos EUA, resultando em 10,3 milhões de inscritos na plataforma de vídeos e quase 3 milhões no Instagram. Em 2019, “Playhard” abriu uma empresa de desenvolvimento de tecnologia e inovação, com projetos voltados para o segmento gamer, e se tornou um dos sócios do LOUD, time profissional de influencers do jogo mobile Free Fire. Também lançou o livro “Playhard – Play em Nível Hard – Jogando para Vencer na Vida e no Youtube”. ARTES DRAMÁTICAS Carol Duarte, 28 Sabe aquela história da criança tímida que foi fazer teatro para ficar mais desinibida? Foi assim que Carol iniciou a vida de atriz – e não a largou mais. Quando foi estudar na Escola de Arte Dramática da USP, percebeu que a profissão era muito mais do que diversão e carregava uma grande dose de responsabilidade. Fugindo do estereótipo glamoroso de vida mansa sob os holofotes, Carol afirma querer ir além de conquistas pontuais. “Essa profissão tende a nos deixar focados em nós mesmos, nas carreiras. Mas, para mim, ser uma boa atriz se faz em trajetória, e não em um trabalho. Eu vou fracassar, vou errar, mas o plano artístico deve ir no que vou deixar para as pessoas, além de mim.” Carol atribui à sorte as oportunidades e papéis que foram surgindo em seu caminho: o primeiro sopro do destino aconteceu em 2017, quando viveu Ivan na novela “A Força do Querer”, de Gloria Perez. Também fez participação na minissérie “Segunda Chamada”, ainda na Globo. Mas o grande destaque veio em 2019, ao viver a protagonista Eurídice no melodrama “A Vida Invisível”. O filme, que marcou sua estreia no cinema, foi a aposta do Brasil para o Oscar de 2020. A indicação da Academia acabou não acontecendo, mas o longa saiu vitorioso da mostra Um Certo Olhar, no Festival de Cannes. Carol garante que suas viagens internacionais por circuitos de festivais comprovaram algo que traz esperança e orgulho em tempos turbulentos para a arte: o mundo está de olho nas produções brasileiras. *AMANDA TUCCI, ANGELICA MARI, CLÁUDIA DE CASTRO LIMA, DÉCIO GALINA, GIULIANNA IODICE, GUILHERME SOMMADOSSI, HELENA ARNONI, JOSÉ VICENTE BERNARDO, JULIANA VENTURA, KÁTIA MELLO, LUCAS BORGES TEIXEIRA, MARIANA WEBER E REBECCA SILVA Fotos: FELIPE VARANDA, GUSTAVO ARRAIS, VICTOR AFFARO Maquiagem: PAULO RENSO PARA COMPOR ESTA LISTA, CONTAMOS COM A PARTICIPAÇÃO DOS SEGUINTES CONSELHEIROS: ANDRÉ BARRENCE, ARNALDO RIBEIRO, CARLOS COSTA, CELSO CURI, CHARLES GAVIN, CHICO TATTINI, EDUARDO SIMON, EMILIO FRAIA, FERNANDO FREITAS, FERNANDO GAVINI, FLÁVIO CANTO, FLÁVIO PRIPAS, GABRIEL RODRIGUES GRINSPUM, GUGA STOCCO, JOÃO LUIZ FILGUEIRAS DE AZEVEDO, JOÃO MARCELLO BÔSCOLI, KÁTIA RUBIO, LIMINHA, LUISA STRINA, MARCIO KOGAN, NELSON DE SÁ, PATRICK MARTIN, PAULO VINÍCIUS COELHO, RENATA FAVALE ZANUTO, RICK BONADIO, ROMERO RODRIGUES, RONALDO BRESSANE, SÉRGIO XAVIER, SOLANGE BOTTARO, VALQUIRIA MONTE CASSIANO RIZZO, WALDICK JATOBÁ, WILLIAN “GORDOX” MOREIRA LEMOS RODRIGUES Reportagem publicada na edição 74, lançada em janeiro de 2020 Siga FORBES Brasil nas redes sociais: FacebookTwitterInstagramYouTubeLinkedIn Baixe o app da Forbes Brasil na Play Store e na App Store. Tenha também a Forbes no Google Notícias.  © Forbes 2023. Todos os direitos reservados.", "url": "https://forbes.com.br/listas/2020/05/under-30-2019-os-90-destaques-brasileiros/", "threshold": 1.0}