{"title": "Under 30 2014: 30 destaques brasileiros abaixo dos 30 anos", "content": "Início / Listas / Under 30 2014: 30 destaques brasileiros abaixo dos 30 anos  Eles têm 30 anos ou menos e, cada um em sua área de atuação, têm revelado iniciativa, criatividade e talento. Com espírito jovem, rara motivação e abertura para o novo, sobre eles repousa a responsabilidade que cabe aos transformadores: a de reinventar o Brasil e assumir as rédeas de nosso futuro. Você vai conhecer cada um deles abaixo. Camila Coelho25 anosBlogueira A mineira Camila Coelho, 25 anos, ficou conhecida por seus vídeos no YouTube com dicas sobre maquiagem. Aproveitou a fama e em abril de 2011 criou o blog Super Vaidosa para falar de moda e beleza. Seus posts e vídeos conquistaram admiradoras fiéis e hoje a blogueira profissional tem números invejáveis nas redes sociais: 958 mil curtidas noFacebook, 1,4 milhão de assinantes no YouTube e 1,7 milhão de seguidores no Instagram. O poder de influenciar suas seguidoras se reflete em contratos fechados: este ano ela lançará uma linha de produtos de maquiagem em parceria com a marca Sigma Beauty e desenvolverá algumas peças para a coleção de inverno da Riachuelo. Camila também foi convidada para participar de uma campanha publicitária da Le Postiche ao lado de Giovanna Antonelli e Didi Wagner. Sem contar os anúncios publicitários que seu blog consegue atrair. Ela mora em Boston desde 2006. É de lá que ela faz seus posts e vídeos em português para as brasileiras. Mas seu inglês fluente também lhe permite gravar conteúdo para as americanas. Camila tem atualmente 527 mil assinantes na versão em inglês do YouTube. CE Pedro Lourenço23 anosEstilista Aos 7 anos, Pedro Lourenço, filho dos estilistas Reinaldo Lourenço e Gloria Coelho, iniciou um curso de corte e costura. Cinco anos depois criou uma coleção completa para a grife Carlota Joakina, pertencente a sua mãe. Aos 15, lançou sua marca homônima no São Paulo Fashion Week e após quatro anos aterrissou na semana de moda de Paris. “A moda aconteceu de forma muito natural na minha vida”, diz. Hoje, aos 23 anos, ele tem suas peças em 18 pontos de venda espalhados pelo mundo, entre eles, Barneys, de Nova York; Browns, em Londres; e Corso Como, de Milão. No Brasil, além da loja própria em São Paulo, suas criações podem ser encontradas em 30 unidades multimarca. Lourenço já fez oito desfiles em Paris, oito em São Paulo e cinco apresentações em Nova York. Suas roupas vestem celebridades como Lady Gaga, Gisele Bündchen e Karolina Kurkova. Em 2012, figurou na lista da FORBES americana das 30 personalidades abaixo de 30 anos na categoria Arte e Estilo. E no ano passadorecebeu o prêmio The Most Promising Young Talent, da revista Marie Claire francesa. No primeiro semestre deste ano, ele lançará uma linha de produtos de maquiagem em parceria com a MAC, a qual terá distribuição mundial. CE Alessandra França28 anosPresidente do Banco Pérola Todo jornalista sabe que entrevistar um banqueiro (a) é tarefa difícil. De forma geral, eles evitam se expor na mídia. Mas há uma exceção: Alessandra França, criadora e presidente do Banco Pérola, aceitou imediatamente o convite de FORBES Brasil para participar desta matéria. Mas ela é de fato uma banqueira? “Bem, acho que sou, não? uma banqueira atípica, digamos assim”, responde rindo a bela jovem, descendente de poloneses e índios, nascida no Paraná e que se mudou aos 2 anos de idade para Sorocaba (SP). Na verdade, Alessandra lidera uma Organização da Sociedade Civil de Interesse Público (Oscip) que concede empréstimos de pequeno valor (em média, R$ 3 mil), a juros baixos, para jovens empreendedores. Se neste ponto você pensou no bengalês Muhammad Yunus – Prêmio Nobel da Paz de 2006, criador do primeiro banco especializado em microcrédito –, acertou: foi a leitura da biografia dele que inspirou Alessandra a abrir sua instituição em 2009. Ela própria, filha de um caminhoneiro e uma costureira, estudou informática quando adolescente em uma organização de apoio a jovens carentes. Hoje, com seu trabalho, Alessandra se propõe a fornecer aos pobres aquilo que mais lhes faz falta quando resolvem começar um negócio próprio: crédito, no sentido literal e figurado. “Confiamos nas pessoas, e essa confiança é retribuída: nosso índice de inadimplência é muito baixo”, conta. Para 2014, o Banco Pérola tem como meta realizar mais de 700 novos empréstimos. Hoje casada, ela passa boa parte dotempo percorrendo o país em busca de apoio para ampliar as atividades da instituição – mas, nas horas vagas, sobra tempo para dedicar-se a um hobby: aulas de dança. Jogo de cintura para fazer o bem, sem dúvida, ela já demonstrou ter. AR Arthur Zanetti23 anosGinasta Londres, 2012. um jovem forte de 1,56 metro de altura sorri para um estádio lotado. Abaixo de uma bandeira do Brasil, uma medalha de ouro reluz no seu peito. Era a primeira vez que o país conquistava o topo do pódio de ginástica masculina em Olimpíadas. Arthur Zanetti não poderia estar mais feliz. Esse é o resultado de uma rotina rígida de treinamento desde os 7 anos. Ser ginasta não é fácil. É preciso treinamento de segunda a sábado, dieta controlada e programas leves, como cineminha em vez de balada. Aos 23 anos, ele combina tudo isso com o curso noturno de educação física em São Caetano (SP), onde treina.“Meu instrumento é o meu corpo”, explica o campeão. “Se eu sair do planejado, o resultado que esperamos pode não chegar.” Chegou. No ano passado, Arthur confirmou sua soberania nas argolas no Mundial da Bélgica. Mas o caminho até o topo foi longo. Não há tantos incentivos para treinar esta mistura de esporte e arte no Brasil. “A partir damedalha (em Londres) houve bem mais investimentos. Antes, eu só tinha a Sadia e a Caixa pela Confederação. Agora, consegui mais um patrocínio da Caixa, Furnas e Adidas”, conta. Neste ano, Arthur disputará o Mundial da China, no qual é favorito. São só 23 anos e 1,56 metro, ele sabe, mas tudoindica que o mundo continuará a parar para vê-lo lá em cima. LBT Neymar Jr.22 anosJogador de futebol Neymar é, sem dúvida, o maior nome brasileiro do futebol na atualidade. Basta dar uma rápida olhada no seu curto histórico em campo para entender por quê. Com apenas 20 anos, em 2012, o atacante sagrou-se tricampeão paulista consecutivo pelo Santos. No mesmo ano, levou o alvinegro praiano ao seu terceiro título na Copa Libertadores da América, com direito à artilharia de oito gols. Esse grupo ficaria conhecido como os novos “meninos da Vila” e o jovem de Mogi das Cruzes fazia jus à camisa 11, que já foi de Pepe. Na seleção brasileira, foi campeão da Copa das Confederações do Brasil em 2013. Neymar não só fez um dos três gols na final contra a temida Espanha como foi também eleito o melhor em campo. Há menos de um ano no Barcelona, o ganhador do Prêmio Puskas em 2011 (concedido pela Fifa ao gol mais bonito do ano) é uma figura frequente entre a escalação titular. Sua média de gols é boa, se considerada o tempo na reserva: 13 carimbadas em 26 jogos, incluindo um de cabeça na final da Supercopa da Espanha, vencida pelo clube catalão contra o Atlético de Madrid. Não é a toa que o jovem seja a grande esperança do Brasil para a Copa do Mundo deste ano. Em campo, Neymar só não faz chover, mas se fizer também, não há problema. LBT Natália Boeira30 anosCEO da Hybel “As empresas são a melhor escola de administração, não há como negar”, afirma a jovem que dirige uma delas – comduplo conhecimento de causa, dado que é formada, justamente, em administração de empresas. A catarinenseNatália Boeira comanda mais de 200 funcionários em uma companhia cuja principal planta industrial é das mais sofisticadas tecnologicamente do país: a Hybel, fabricante de componentes hidráulicosfundada em Criciúma (SC) em 1981 por seu pai, Jorge Boeira. Natália está na empresa há seis anos e, durante os dois primeiros, atuou em quase todos os seus setores. Na liderança da Hybel, Natália busca soluções para os novos dilemas que se apresentam às companhias brasileiras: “Hoje é bem mais difícil captar e reter mão de obra do que no passado. Esse vem sendo um de meus grandes desafios no dia a dia”. E quais serão, a propósito, seus desafios futuros? “Me enxergo, em algum momento, partindo para um poloeconômico maior. Tenho consciência de que as questões que se apresentam em um grande centro são distintas dasque já conheço. Quando vou fazer cursos em São Paulo, por exemplo, percebo diferenças fortes. Quero fazer parte disso”, afirma ela, confiante. AR Ísis Valverde27 anosAtriz “(…) descer de carro a Teodoro / subir de carro a Arcoverde / fazer o que for preciso / pra agradar Ísis Valverde”: essa quadra, composta pelo escritor paulista Fabrício Corsaletti, louva uma jovem que veio ao mundo em 1987 na pequena Aiuruoca (sul de Minas Gerais) e se mudou para Belo Horizonte aos 15 anos, sozinha. Descoberta por um caçador de talentos quando passeava em um shopping, participou de várias campanhas publicitárias. No entanto, o que Ísis queria era ser atriz, e após vários testes conseguiu estrear na Rede Globo em 2006, em um remake da novela Sinhá Moça. De lá para cá tornou-se uma celebridade ao interpretar a fogosa Suelen em Avenida Brasil – e, na sequência, provou ter talento dramático ao protagonizar duas minisséries:O Canto da Sereia e Amores Roubados. Seu apelido em Aiuruoca era avenca – dado por sua mãe, Rosalba, que se assustava com seu aspecto franzino. “A avenca é conhecida como uma planta muito frágil, que morre por qualquer coisa, e eu vivia doente”, lembrou emuma ocasião. Bem, isso mudou: hoje Ísis é uma forte, sob todos os aspectos – inclusive o físico: no momento ela já começa a se reerguer de um grave acidente automobilístico no qual se envolveu em 31 de janeiro na Zona Oeste do Rio. FORBES Brasil torce pela plena recuperação desta querida artista – e, nesse espírito, chega ao fim este perfiltal qual se iniciou: com mais versos de Corsaletti a respeito de sua (nossa) musa: “(…) Eva Green é Eva, mãe / de todos; fértil, é verde / mas não é Ísis, a deusa / – vale mais Ísis Valverde.” AR David Pinto29 anosEmpresário, fundador da Dr. Resolve Já ficaram no passado os dias nos quais homens e mulheres, quaisquer que fossem suas profissões, sabiam executar pequenos serviços em casa – reformas, em especial. Hoje, as pessoas estão muito mais especializadas e preferem pagar para que outros solucionem seus problemas domésticos. Foi pensando nisso que David Pinto fundou, aos 25 anos de idade, a Dr. Resolve, focada no fornecimento de profissionais e material para tanto. Na mesma época ele se casou e reformou o próprio apartamento. Atividades demais? “Bem, tinha de fato tudo para dar errado, mas deu certo”, responde o empresário em entrevista àFORBES Brasil. E como: a companhia, que cresce via franquias, faturou mais de R$ 500 milhões em 2013. O investimento necessário para se tornar um franqueado da Dr. Resolve é baixo, cerca de R$ 40 mil, e o grupo oferece treinamento de duas semanas e acompanhamento a cada 90 dias para o novo empreendedor. O entusiasmo de Pinto com a atividade é um dos maiores ativos de seu grupo: “Não devemos ter medo do erro. Se for para errar, vamos errar, se for para acertar, vamos acertar, mas façamos algo – o que não vale é ficar parado. Se bem que, é claro, convém que se acerte mais do que se erre”, diz, rindo, David Pinto, o Dr. Resolve. AR Mike Krieger27 anosCofundador do Instagram Não se deixe enganar pela sonoridade inglesa do nome: Michel (Mike) Krieger é um brasileiro de boa cepa, nascido na capital paulista em 1986. Lá ele viveu até os 18 anos, quando se mudou para Palo Alto, Califórnia, e ingressou na universidade de Stanford. Começou a se interessar por códigos de programação aos 6 anos de idade (!), mas não foi por isso que imigrou para o Vale do Silício. Na verdade, Krieger à época simplesmente não tinha ideia do que fazer de sua vida, e como nos EUA (ao contrário do Brasil) a troca de curso no meio da graduação não é vista com estranheza, achou melhor estudar lá. Seu real talento só ficaria claro quando, em outubro de 2010 – após meros dois meses entre concepção e criação – ojovem (junto com o americano Kevin Systron) lançou na App Store um aplicativo batizado de Instagram (junção dos termos instant camera, ou câmera instantânea, e telegram, ou telegrama). Já em sua primeira semana na loja virtual da Apple, o serviço de publicação de fotos foi adotado por 100 mil pessoas. A partir daí, só fez crescer – tanto que em abril de 2012 o Facebook desembolsou US$ 1 bilhão para adquiri-lo, em uma negociação capitaneada por Krieger em pessoa. Hoje ele vive em San Francisco e, de lá, continua gerindo o Instagram. É tratado pela mídia americana com a deferência reservada aos grandes inovadores; no final de janeiro, o “Wall Street Journal”, por exemplo, abriu espaço para que listasse seus gadgets prediletos: “Gosto muito do Wunderlist”, disse, referindo-se a um aplicativo que gera uma lista de tarefas on-line. “Com ele, costumo atribuir à minha namorada algumas tarefas, e ela me atribui outras. Daí, sempre que abro o app, descubro que estou fazendo com quatro dias de atraso algo que havia lhe prometido”. Well… Bem-vindo ao clube, Mike. AR Patricia Birman30 anosEmpresária, diretora-geral da Memo Cada vez mais mulheres praticam exercícios – e não são atletas profissionais, mas sim secretárias, pequenas empresárias, profissionais liberais etc. Sendo assim, Patricia Birman decidiu: sua grife de roupas esportivas, a Memo, vende peças para mulheres de verdade. “É uma moda esportiva contemporânea a que eu ofereço. Ela atende à mulher de nossos dias, que tem pouco tempo para malhar, porém muita vontade de se manter em forma”, explica, com seu leve sotaque de Minas Gerais, onde nasceu. “A Memo é minha paixão. Sinto que com ela atendo uma consumidora que, antes, não vinha sendo assistida pelo mercado.” Uma paixão tão forte, aliás, que a levou a assumir a empresa em 2012. A Memo finalizou 2013 com cinco lojas próprias – e espera ter 30, desta vez sob o regime de franquias, até o final de 2015. Patricia pertence ao clãBirman, que controla uma das maiores fabricantes de calçados e acessórios do país, a Arezzo. Formada em moda na Faculdade Santa Marcelina, trabalhou na companhia da família por dez meses em desenvolvimento de produtos, mas sua seara é de fato o varejo. Para alguém tão focada em trabalho, ela teve uma vida acadêmica bem agitada: já concluiu um MBA em gestão de luxo na FAAP e outro MBA, em gestão de varejo, na FIA. Durante os estudos, trabalhou com estilistas renomados como Reinaldo Lourenço, Pedro Lourenço e Paulo Borges. O nome de sua empresa,Memo, vem de memória – e, de fato, Patricia é alguém a ser lembrada quando o assunto for o futuro da moda no Brasil. AR Gustavo Soncini28 anosCriador da Fina Nata, primeira bem-casaderia do Brasil e representante no país da escola de Hotelaria Vatel Como surgiu o bem-casado? A resposta é mais complexa do que se pode imaginar: “Geralmente acha-se que o doce veio do casadinho português, o qual por sua vez seria derivado do alfajor, criado pelos árabes quando estes ocuparam a Península Ibérica”, conta Gustavo Soncini, pioneiro na venda desse produto em uma loja especializada. “Mas, ao pesquisar, cheguei à conclusão de que o bem-casado – que só existe no Brasil – nasceu de uma fusão de receitas portuguesas e alemãs de doces, ocorrida no Rio Grande do Sul no início do século passado.” Soncini, está-se vendo, leva a questão a sério: tanto que inaugurou em julho de 2012 seu estabelecimento na capital paulista e pretende, até o fim deste ano, abrir outras cinco lojas próprias da marca. E depois? “Depois, franquias. Tenho recebido e-mails de todo o país com gente se oferecendo para se tornar nosso franqueado. Vai dar certo, há demanda pelo produto e pelo conceito que criamos”, conta o moço – que, entre um bem-casado e outro, conversa com amigos que fez durante os dez anos que passou viajando, estudando e trabalhando em locais tão diversos como Suíça, Itália e China. Soncini fala seis idiomas estrangeiros (inglês, francês, espanhol, alemão, italiano e chinês) e irá abrir em breve um escritório no Brasil da Vatel – uma das mais prestigiadas escolas de hotelaria do planeta. “Trabalho com o conceito de aff ordable luxury, o chamado luxo acessível, e o imprimo a tudo que faço”, finaliza ele. AR Anitta20 anosCantora e Compositora Muitos dos jovens que acorrem aos célebres rolezinhos são fãs da cantora Anitta; têm a mesma idade que ela e apreciam suas músicas. Mas ninguém ainda havia perguntado sua opinião a respeito. FORBES Brasil o fez; eis a resposta: “O rolezinho não é só um encontro de jovens em shopping centers; é um encontro de jovens em um determinado lugar para conversar, paquerar, ouvir música, se divertir. O objetivo é desfrutar um momento de lazer”. E Anitta frisa: “Eles querem diversão e para isso precisam de espaços públicos. Qual jovem não gosta de ir ao shopping?”. Convém ouvi-la: a carioca Larissa de Macedo Machado é, hoje, a maior referência em cultura juvenil do país. Ela despontou em 2012 com o single “Meiga e Abusada”, cujo clipe foi gravado em Las Vegas. Anitta prima pela ambição: “Sou determinada, sempre quis ser cantora e consegui. Espero que meu sucesso inspire fãs a lutarem pelo que desejam”. E o que eles desejam? Bem, ao menos para as meninas, Anitta ocupou um espaço relevante no imaginário local: o da jovem de personalidade forte, desafiadora, dona da própria vida e, em especial, da própria sexualidade. Nada mal para quem começou a cantar em uma igreja de Honório Gurgel, periferia carioca, e foi estagiária na mineradora Vale. “Vou compor novas músicas, quero que meu DVD faça muito sucesso”, diz. E quanto a uma possível carreira internacional? “Já começou: meu CD foi lançado em Portugal em dezembro. Após a gravação do DVD, vou à Espanha e Portugal promovê-lo. Em maio faço shows na Europa. A gravação em outros idiomas virá – o “Show das Poderosas” será minha primeira música a ganhar versão em inglês”, revela, poderosa. AR Emicida28 anosRapper e empresário Conversar com Leandro Roque de Oliveira – nome verdadeiro do rapper Emicida – causa surpresa: embora seja conhecido sobretudo como músico, ele discorre com propriedade sobre temas como relações raciais e, em especial, negócios. Mas, pensando bem, não há razão para espanto: afinal, Emicida é um empreendedor bem-sucedido. Sua empresa – a Laboratório Fantasma, criada em 2009 – emprega 20 pessoas na Zona Norte da capital paulista. Ela vende camisetas, bonés, canecas e os mais diversos acessórios, além de seus discos e os de outros artistas. Ali sãoconcebidos e feitos todos esses itens. “Do processo de fabricação de nossas roupas, a única parte que ainda não dominamos é a plantação do algodão”, conta ele, rindo. Seus clientes são a legião de jovens que gostam de sua música, que começou a ser divulgada via redes sociais como oYouTube na metade da década passada e, em pouco tempo, chamou a atenção para aquele rapaz que invariavelmente “matava” todos os seus adversários nas batalhas de rimas entre MCs – daí seu nome artístico. Hoje, o Laboratório Fantasma fatura dezenas de milhares de reais ao mês e torna a gestão de carreira levada adiante por Emicida um modelo para seus pares. Ele é solteiro e tem uma filha, hoje com 4 anos. O músico discorre acercadas mudanças pelas quais a sociedade brasileira vem passando: “Já há uma classe média negra com bom poder de consumo no Brasil. O problema é que ela continua invisível para os meios de comunicação”. Ao dilema de aderirou não ao sistema – o qual ainda causa polêmica entre muitas das melhores cabeças do rap nacional –, Emicida dá uma resposta prática: integrar-se sim, mas de forma inteligente, usando os mecanismos do mercado a seu favor e sem perder a própria identidade. AR Priscila Quirós26 anosEmpresária No Brasil, a carne bovina e as aves são a maior fonte de proteína animal. Mas uma jovem vem trabalhando, desde o início de 2012, para colocar o cordeiro neste prato: Priscila Quirós comanda em Amparo, no interior paulista, uma fazenda voltada à criação de ovinos visando a produção de cortes nobres desse tipo de carne. Ela os comercializa em supermercados mais sofisticados, restaurantes e empórios gourmet nos Estados de São Paulo e Mato Grosso, além de Belo Horizonte e da capital carioca; a meta é, até o fim do ano, expandir tais vendas para o restante dos Estados do Rio de Janeiro e Minas Gerais, além de Brasília e Nordeste do país. Mas tudo será feito respeitando dois princípios de sua marca, a Quirós Gourmet: criação e abate humanitário dos animais. “Nossos carneiros, ovelhas e cordeiros são mantidos em galpões térmicos, de forma a que não sofram com variações de temperatura. Qualquer pessoa que entre em nossas instalações precisa estar vestida com roupas azuis, pois esta cor deixa os animais mais calmos”, exemplifica ela. “Essa nossa postura tem razões éticas e também práticas: animais bem tratados e que são abatidos com um mínimo de sofrimento fornecem uma carne muito mais macia e saborosa.” E porfalar em sabor, estão nos planos da empresária iniciar, em breve, a venda no Brasil de vinhos (possivelmente vindos da Argentina) e azeites de alta qualidade – estes últimos, trazidos da terra natal de sua família, na Espanha. AR José Eduardo Mendes30 anosCriador do Hotel Urbano Em apenas três anos, o jovem José Eduardo Mendes, hoje com 30 anos, conseguiu transformar a startup de internet Hotel Urbano em um negócio avaliado em pouco mais de R$ 1 bilhão. O negócio, fundado em janeiro de 2011 com o irmão João Ricardo, atraiu três sócios – os fundos Insight e Tiger e o investidor americano Kevin Efrusy. Mas o que essa pontocom tem de diferente? O foco na hospedagem – negócio com margem superior à venda de passagem aérea, geralmente a maior aposta das agências de viagem –, explica o fundador. Foi assim que, de diária em diária, o Hotel Urbano se transformou em um negócio de músculos. Desde os 20 anos, Mendes trabalha em internet. Criou um site de comércio eletrônico que jamais chegou a dar lucro, mas trouxemuito aprendizado. Um dia, ao deixar uma partida de futebol do Fluminense, sentiu o cheiro da oportunidade. “Eu tinha que viajar do Rio para São Paulo e não tinha hotel para ficar no dia seguinte. Percebi que o Brasil não tinhanenhum grande portal que vendia pacotes de hotéis e pousadas com preços realmente agressivos.” Três semanas depois, em fase pré-operacional, um fundo de Nova York se interessou pelo negócio e realizou um aporte de US$ 8 milhões. Resultado: o faturamento de 2014 deve bater a casa dos R$ 800 milhões, 40% a mais que no ano anterior, a partir da venda de 4,1 milhões de diárias. Duvida? Basta sintonizar na TV Globo, no horário nobre, para ver uma agressiva campanha do Hotel Urbano no intervalo comercial. Só neste ano, cerca de R$ 150 milhões serão investimentos em marketing. O Hotel Urbano, acredita, ainda é um bebê. Seu sonho? Ver sua cria se tornar tão grande e global quanto a americana Priceline, avaliada em US$ 60 bilhões. FT Carol Buffara28 anosEmpresária e Blogueira Desde os 16 anos Carol Buffara sempre teve vontade de empreender. A carioca começou fazendo bijuterias, que eram vendidas para amigas e algumas lojas. Como sempre gostou de moda, chegou à conclusão de que deveria investir no varejo de vestuário. Chamou a prima Tatiana Bonaparte e, juntas, inauguraram em Ipanema a Nag Nag, multimarcas de roupas e moda praia feminina. “Há sete anos, quando abrimos a loja, o mercado de luxo no Rio de Janeiro era muito carente. Havia demanda, mas a oferta era quase inexistente, as pessoas tinham o hábito de comprar roupas em São Paulo ou em viagens internacionais”, diz a empresária de 28 anos. O próximo passo será a abertura da primeira loja da Ng Sport, a marca de roupas e acessórios esportivos que já é comercializada na Nag Nag. Amante de um estilo de vida saudável, há seis meses Carol criou um blog para falar sobre exercícios físicos e alimentação. Nele, também dá dicas de viagens e moda. O que começou como um hobby, agora atrai anunciantes. Nas redes sociais, Carol também tem seu público: são 250 mil seguidores no Instagram, 11 mil no Twitter e 16,1 mil curtidas no Facebook. Em abril, ela lançará o livro Projeto Carol Buffara, da Editora Arte Ensaio, com dicas de bem-estar, exercícios e alimentação. CE João Felipe Scarpelini27 anosConsultor da ONU para Questões da Juventude Ele reúne em si três qualidades vitais para o trato com jovens: estudou o tema ao longo de toda sua vida, trabalha com isso desde muito cedo e – não menos relevante – é um deles. João Felipe – que começou muito cedo, ainda na cidade de Santos (SP), durante sua infância e adolescência, a lidar com questões da juventude – acumulou desde então meia dúzia de histórias. “Estava o ano passado na Turquia quando o país foi sacudido por protestos, e fui denunciado às autoridades locais por filmar a repressão aos manifestantes. Também me encontrava em Montenegro quando este se declarou independente da Sérvia e em Timor Leste após a ilha ter conseguido se separar da Indonésia; em ambos os casos, passei por situações de grande tensão”, relembra Scarpelini. Seu currículo inclui passagens curiosas (ao longo de seis anos foi colunista da revista Capricho para questões relacionadas com empreendedorismo e participação juvenil) e muitas viagens (já visitou 56 diferentes nações a trabalho). O mais destacado especialista brasileiro em questões ligadas à juventude mora hoje em Brasília e explica que luta, sobretudo, para que crianças e adolescentes sejam objetos – e também sujeitos ativos – de políticas que os beneficiem, no Brasil e no mundo. AR Lucas Franzato24 anosEmpresário e executivo múltiplo Ele não para desde os 12 anos. Com essa idade, Lucas Franzato digitava os pedidos dos clientes da Morena Rosa, empresa fundada por seus pais em Cianorte, no Paraná. Desempenhou diversas funções na companhia e hoje, aos 24 anos, é diretor de mercado, responsável pelas áreas de marketing, comércio eletrônico e comercial. Sob seu comando estão 200 pessoas. Franzato também dirige o espaço para eventos Empório Brasil, dedicado a formaturas e casamentos, e a Arena Brasil, casa de shows com capacidade para 7 mil pessoas. Ivete Sangalo, Claudia Leitte e a dupla Bruno & Marrone estão entre os artistas que já se apresentaram por lá. Como começou a ficar caro fazer a divulgação dos shows nas rádios da região, ele resolveu ter sua própria emissora e, em 2010, comprou a Música FM, de Cianorte. Apaixonado por futebol, em outubro do ano passado Franzato adquiriu uma fatia do Cianorte Futebol Clube, time da primeira divisão do campeonato paranaense. Aproveitou a oportunidade e virou presidente. Em dezembro de 2013, uniu o amor pelo esporte e o know-how na organização de eventos para realizar o Encontro das Estrelas. Na comentada partida de futebol beneficente, que aconteceu em Goiânia, os amigos do cantor Leonardo jogaram contra os convidados do craque Neymar. O evento foi notícia nos principais veículos de comunicação do país. CE Caio Davidoff e Gabriel Abdalla29 e 22 anosFundadores da PagCom Prepare-se: muito em breve fazer e receber chamadas telefônicas será, provavelmente, a menos importante dentre as funções de seu celular. Acesso às redes sociais, envio de mensagens de texto, uso dos mais diferentes aplicativos – tudo feito via smartphones – já são realidade; agora, alguns jovens vieram para transformar esses pequenos aparelhos em um dos instrumentos mais importantes para o funcionamento de uma economia capitalista: um meio de pagamento. Dois rapazes, Caio Davidoff e Gabriel Abdalla (mais um terceiro parceiro, Thomas Farah), criaram, em dezembrode 2012, a PagCom, companhia que disponibiliza ferramentas para que profissionais “móveis” (um taxista ou uma vendedora de cosméticos, por exemplo) recebam valores via cartões de crédito e débito por meio de um telefone celular ou de um tablet conectado à web. “Em breve, essa tecnologia estará disseminada por todo o Brasil – e quando isso acontecer, nossa empresa terá estado na vanguarda do processo desde o começo”, assegura Caio. AR Marco Gomes27 anosEmpresário, fundador da boo-box Esta é, de verdade, uma bonita história de superação. Gama, cidade-satélite do Distrito Federal, viu nascer em maio de 1986, em um de seus bairros mais pobres, um bebê que recebeu o nome de Marco Gomes. Aos 5 anos de idade, ele andava só pelas ruas de Brasília para poder frequentar uma escola local; depois, teve de abandonar os estudos ali, pois o vício de seu pai em drogas consumia os poucos recursos da família. Aos 8 anos, tornou-se cristão evangélico; aos 12, começou a montar computadores a partir de peças avulsas que um tio trazia do Paraguai. Na mesma época, pela primeira vez conectou-se à internet e ficou fascinado por aquele novo universo que se abriaperante seus olhos. Dez anos depois, Gomes criou sua própria empresa na web, mudou-se para São Paulo e se tornou um modelo para outros jovens que desejam empreender na rede: nascia a boo-box, pela qual produtores de conteúdo podem rentabilizar seus blogs, sites e mídias sociais; e anunciantes, expor propaganda. Sobre sua experiência na internet, Gomes observa: “Há como abrir negócios na web a partir de vários pontos do país. Belo Horizonte, Recife, Brasília e a região Sul – Curitiba e Porto Alegre, em especial – têm uma cultura forte de empreendedorismo on-line. E São Paulo, é claro, onde o e-commerce é muito forte”. E quais são seus objetivos para o futuro? “Focarei nos próximos anos no crescimento da boo-box. Mas estou com uma iniciativa paralela, o Mova+, que incentivará usuários a se exercitarem. Em troca, receberão pontos em programas de fidelidade, os quais podem ser usados na compra dos mais diversos produtos, viagens e outros itens.” AR Felipe Schaedler27 anosChef Ele nasceu em Santa Catarina e lá viveu até os 18 anos – mas é em uma cidade de cultura (e clima) bem diverso do encontrado no Sul do país que Felipe Schaedler está fazendo história: Manaus, capital do Amazonas. Lá, ele é dono de três restaurantes: Banzeiro, Di Fiori e Caboquinho. O primeiro deles é aquele no qual  realiza seus pratos conceituais, impregnados dos temperos e sabores da Amazônia profunda – literalmente: com frequência o jovem viaja a São Gabriel da Cachoeira (AM), no extremo noroeste do país, onde pesquisa novos ingredientes para os pratos que cria. Recentemente, ele descobriu por ali alguns tipos de cogumelos que foram analisados pelo Instituto Nacional de Pesquisas da Amazônia (Inpa) – e vários foram considerados comestíveis e nutritivos. Junto com Alex Atala, do paulistano D.O.M., ele agora busca viabilizar a produção dos mesmos em maior escala. “Acredito que a próxima grande onda da gastronomia mundial será a culinária amazonense. Belém, no Pará, por exemplo, é um celeiro fantástico de novos sabores esperando para serem descobertos”, defende ele – e, quando isso ocorrer, o jovem chef catarinensemanauara certamente estará na vanguarda desse movimento. AR Lala Rudge23 anosBlogueira e empresária Lala faz parte de um grupo de herdeiras que não quer saber de sombra e água fresca. Neta de Romeu Trussardi e sobrinha de Riccy Souza Aranha, a garota já demonstrava interesse pela moda aos 12 anos, quando pediu para que a marca da tia, a Mixed, desenvolvesse um tamanco de onça do seu número. “Herdei o sangue empreendedor”, conta a it girl, que criou o blog que leva seu nome aos 20 anos. “Sempre adorei moda e beleza. Minhas amigas me pediam dicas do que comprar de maquiagem quando iam viajar. Aí criei o blog. Com o tempo, as amigas das amigas se tornaram leitoras e não parou mais…”, lembra Lala, que não revela os números de receita publicitária, embora já tenha deixado escapar, em entrevistas anteriores, algo em torno de R$ 80 mil mensais. Apesar dos números, o blog nunca deixou de ser um passatempo. Apaixonada por lingeries, Lala confessa que tem um acervo enorme – a maior parte adquirida fora do país. “Um dia meu marido reclamou do tempo que eu gastava nessas lojas quando estávamos viajando. Me dei conta de que não gostava das marcas do Brasil – tudo muito básico ou vulgar. Sentia falta daquele sexy chique, algo mais moderno.” Decidiu então unir o útil ao agradável e inaugurou,em agosto do ano passado, a primeira loja da marca La Rouge Belle, no Iguatemi, em São Paulo, com investimento de R$ 2,5 milhões. O foco, agora, é ampliar. “Em 2014 vamos chegar ao Rio e, em 2015, Belo Horizonte e Brasília. Mas meu sonho mesmo é me instalar em Miami e poder morar lá.” Difícil vai ser ficar longe do seu prato preferido: arroz, feijão, farofa, carne e batata frita. Bem brasileiro. GA Isabel Pesce26 anosEmpresária e escritora Ela é a “Menina do Vale” – esse é o título do livro que escreveu e que fala sobre como o empreendedorismo pode mudar vidas. O vale a que Isabel Pesce se refere é, diga-se de passagem, nada menos que o Vale do Silício, na Califórnia, berço de várias das maiores empresas mundiais de internet. Ela é também fundadora da FazInova, uma criadora de conteúdo para o desenvolvimento profissional. Nascida na capital paulista, Bel (como é conhecida) estudou no Massachusetts Institute of Technology (MIT). Durante a época de faculdade, ela trabalhou na Microsoft, no Deutsche Bank e no Google e completou diversos cursos: ciências da computação, economia e matemática, engenharia elétrica e administração, além de frequentar programas em liderança e inovação. Ela é ainda sócia da Lemon Wallet, uma startup. Bel já lançou também um segundo livro, o “Procuram-se Super-Heróis”. Algumas coisas que a jovem de cabelos longos e sorriso largo aprendeu em sua curta e já tão expressiva carreira: “Conheça não apenas outras línguas além do português, mas também outras culturas além da nossa. Para tanto, o melhor é imergir nelas, estar nos locais. Eu, por exemplo, já morei nos EUA e na Argentina. Isso ajudou a abrir minha cabeça”; “cada trajetória é única, mas não acho impossível, de forma alguma, que outras pessoas consigam replicar meu sucesso. Até porque tudo o que alcancei foi, sobretudo, devido a um fator: perseverança”. E, por fim, Bel faz uma constatação: “No final, o mundo nada mais é do que a soma das pessoas com os sonhos que elas carregam. É isso que importa”. AR Eduardo Lyra26 anosEmpreendedor social Lyra estudou jornalismo, e resolveu aplicar o que aprendeu de uma maneira singular: pôs-se a contar histórias debusca por um Brasil melhor. Escreveu um livro, “Jovens Falcões”, no qual lista 14 casos de sucesso pessoal e profissional que têm como protagonista a juventude brasileira. Integra ainda o Global Shapers, grupo criado a partir do Fórum Econômico Mundial que escolhe jovens líderes excepcionais, de menos de 30 anos de idade, os quais demonstrem ser capazes de transformar o planeta. Lyra criou o projeto Gerando Falcões, que opera nas escolas públicas do país levando aos jovens pobres motivação e exemplos de superação pessoal. “Os gigantes empresariais já esgotaram seu ciclo em uma economia madura como abrasileira. Será extremamente difícil que surja um novo Itaú ou um novo Pão de Açúcar, por exemplo. Este espaço, o das megaempresas, já está ocupado entre nós”, pontua Lyra. “Mas há duas tendências que estão apenas começando e ainda farão muito bem ao país: o empreendedorismo em massa e as organizações que direcionam jovens carentes para um futuro melhor”, finaliza ele. AR Renann Fortes27 anosExecutivo, Mundipagg “Me recuso a usar gravata desde meu primeiro estágio. Não vejo razão para fazê-lo”, conta Renann Fortes à FORBES Brasil. A frase revela um pouco da postura do jovem empreendedor perante os negócios e perante a vida: objetiva, focada em resultados, até mesmo um pouco fria. A companhia na qual ele atua, a MundiPagg, é voltada à otimização de processos do setor de meios de pagamento e comércio eletrônico. A MundiPagg já possui cerca de mil clientes em seu portfólio e uma gama de produtos desenvolvidos internamente que vem conquistando cada vez mais usuários. Para tanto, Renann apostou na implantação de uma cultura empresarial interna que mescla descontração (com reuniões que, segundo ele, mais se parecem com festas de amigos – “mas que geram resultados”, frisa) e uma cobrança de retorno da parte dos colaboradores dura e ostensiva. Tem dado certo, sob o ponto de vista financeiro. Fortes também colabora com um site dedicado ao São Paulo Futebol Clube, onde sedefine como chief happy hour officer – algo como um CEO dos happy hours. O time de profissionais que ele integra na MundiPagg é extremamente jovem – faixa etária média de 25 anos. E qualquer colaborador pode se tornar, em algum momento, sócio da empresa , mas sem usar gravata. AR Thiago Monsores26 anosEmpresário, CEO do grupo InvestComm Ele é filho de David Portes, um ex-camelô que fez fama e fortuna quando, na década de 80, concebeu e colocou em prática uma série de estratégias de marketing para sua banca de doces no centro do Rio de Janeiro. Hoje seu pai é um famoso palestrante, mas Thiago Monsores segue seu próprio caminho: ele é CEO do InvestComm, fundo deinvestimento criado para gerenciar, potencializar e investir em empresas startups. São cinco as companhias que o jovem empresário administra: AD Experiências Inovadoras (agência de marketing), Talk About (voltada à capacitação profissional), Instituto Infoclad (escola especializada na formação e qualificação de profissionais para o mercado de TI), Facilista (site que gerencia as melhores ofertas dos principais supermercados e auxilia na criação de listas de compras pelos usuários) e o Mania de Promoção (outro site, este voltado ao oferecimento de cupons de desconto e ofertas). Quais os focos de Monsores para os próximos anos? “Quero transformar o Instituto Infoclad em uma faculdade, com cursos reconhecidos pelo MEC. Minhas maiores expectativas, porém, estão com o Mania de Promoção, que vai me deixar milionário”, diz ele, rindo – mas convém não duvidar. AR Cesar Raphael28 anosCineasta Por “Pedaço de Papel”, o cineasta Cesar Raphael, 28 anos, ganhou 12 prêmios, entre eles, o de melhor curta-metragem no Los Angeles Brazilian Film Festival 2011. O sucesso levou o mineiro a Hollywood para realizar seu primeiro longa-metragem, o qual contará com a produção de Bobby Moresco, vencedor do Oscar de melhor roteiro original em 2006 por “Crash – No Limite” e coprodutor do premiado “Menina de Ouro”. O filme tem orçamento estimado em US$ 9,7 milhões e roteiro de Amanda Moresco, filha de Bobby. Para dar conta do recado, o jovem cineasta montou, em Los Angeles, uma filial da sua empresa, a Lumiart, a qual tem como sócio seu primo Thiago Bento, de 27 anos. Cesar desempenha as funções de roteirista, ator, diretor, editor e produtor. Bento é o diretor executivo da empresa, responsável pelas negociações internacionais e captação de recursos. A parceria começou quando os dois ainda eram crianças e faziam filmagens amadoras. Na Lumiart, criada em Belo Horizonte, eles estão juntos há sete anos. CE Tallis Gomes26 anosCEO e fundador do Easy Taxi Tallis Gomes foi a uma feira de startups no Rio de Janeiro em 2011 com a ideia fixa: melhorar o trânsito com um aplicativo de ônibus. Ao sair do evento, ligou para uma cooperativa de táxis, que o deixou esperando mais de uma hora na chuva. Em meio à irritação, veio a epifania. “As pessoas não deixariam seus carros em casa para pegar ônibus, mas táxi, se fosse fácil, talvez deixassem”, conta o empreendedor. Assim surgiu a ideia para o Easy Taxi, aplicativo móvel de busca de táxis. Ele vendeu o carro e, com três sócios, levantou cerca de R$ 40 mil para lançar o app em abril de 2012. Menos de dois anos depois, embora não revele o faturamento, os números impressionam. A empresa está presente (com sede física) em 82 cidades de 23 países, com mais de mil funcionários e cerca de 100 mil taxistas e 5 milhões de passageiros cadastrados. Um dos diferenciais do Easy Taxi é ser recriado para cada país. “Se você estiver na Coreia, pode pedir em português com o seu app que o taxista receberá em coreano”, explica o CEO. Três rodadas de investimentos já trouxeram R$ 55 milhões. Nada mal para um jovem de 26 anos que começou a empreender aos 16 no interior de Minas Gerais revendendo celulares com câmera usados, comprados no Mercado Livre. LBT Cristian Trentin30 anosFundador da EcoBike Courier Não se espante caso, em breve, veja circular pelas ruas das cidades brasileiras ciclistas vestindo elegantes (e, no caso, inusitados) smokings: eles estarão ocupados distribuindo convites de casamento. Será mais um serviço criativo e simpático oferecido pela EcoBike Courier, do paranaense Cristian Trentin, a consumidores e empresas brasileiras que se preocupam com a degradação do ambiente urbano causada pela profusão de motocicletas usadas em entregas. “Criei, na metade de 2011, a companhia visando oferecer um serviço vital nos dias atuais – entregas rápidas e seguras –, que fosse economicamente viável (e a Ecobike já é lucrativa) e sustentável (nossas bicicletas, élógico, não emitem poluentes)”, detalha Trentin. Deu tão certo que hoje, além da matriz em Curitiba, já há uma filial da companhia em Cascavel (PR) – terra natal de seu fundador – e uma franquia operando na capital paulista. Para começar a empresa, ele investiu apenas R$ 50 mil, além de muito trabalho e uma boa dose de idealismo. Resultado: a previsão de faturamento para 2014 apenas da matriz de Curitiba da Ecobike é de R$ 1 milhão. Para os próximos anos, a meta da companhia é estar presente nas cinco maiores cidades de cada um dos 26 Estados do país – mas mantendo-se fiel a seu lema: “um mundo melhor a cada entrega”. AR Marcel Fukayama29 anosLíder nas organizações CDI, sistema B e Livestrong Empreendedorismo social: um conceito bastante adequado para definir a ação deste jovem. Ou melhor, as múltiplas ações que ele leva adiante: Marcel Fukayama é membro da direção executiva global da CDI, empresa que busca transformar a vida de moradores de comunidades carentes por meio da inclusão digital. A CDI conta hoje com 6.500 lan houses afiliadas e 780 espaços de inclusão digital em 13 países, os quais oferecem principalmente capacitação profissional a baixo custo. Ele também faz parte do conselho global do Sistema B, movimento que se propõe a usar o poder dos negócios para solucionar problemas sociais e, por fim, é o líder no Brasil da Livestrong, organização de combate ao câncer. “Tive câncer testicular em 2008. Venci a doença e, um ano depois, entrei na Livestrong. Há neste momento em todo o planeta 30 milhões de pessoas enfrentando esta doença, o câncer, em alguma de suas muitas manifestações. Elas precisam entender que o primeiro passo para a cura é a superação do medo, e do estigma, que o câncer causa – e quero ajudá-las nisso”, conta Fukayama. AR Camila Coelho25 anosBlogueira A mineira Camila Coelho, 25 anos, ficou conhecida por seus vídeos no YouTube com dicas sobre maquiagem. Aproveitou a fama e em abril de 2011 criou o blog Super Vaidosa para falar de moda e beleza. Seus posts e vídeos conquistaram admiradoras fiéis e hoje a blogueira profissional tem números invejáveis nas redes sociais: 958 mil curtidas noFacebook, 1,4 milhão de assinantes no YouTube e 1,7 milhão de seguidores no Instagram. O poder de influenciar suas seguidoras se reflete em contratos fechados: este ano ela lançará uma linha de produtos de maquiagem em parceria com a marca Sigma Beauty e desenvolverá algumas peças para a coleção de inverno da Riachuelo. Camila também foi convidada para participar de uma campanha publicitária da Le Postiche ao lado de Giovanna Antonelli e Didi Wagner. Sem contar os anúncios publicitários que seu blog consegue atrair. Ela mora em Boston desde 2006. É de lá que ela faz seus posts e vídeos em português para as brasileiras. Mas seu inglês fluente também lhe permite gravar conteúdo para as americanas. Camila tem atualmente 527 mil assinantes na versão em inglês do YouTube. CE *COORDENAÇÃO EDITORIAL DE ALEX RICCIARDI, PRODUÇÃO EXECUTIVA DE GABRIELA ARBEX, DIREÇÃO DE ARTE DE DUDA BOTTINI E FOTOS DE MARCELO SPATAFORA(COM PARTICIPAÇÃO DE CINTIA ESTEVES, FRANÇOISE TERZIAN E LUCAS BORGES TEIXEIRA)  © Forbes 2023. Todos os direitos reservados.", "url": "https://forbes.com.br/listas/2014/02/under-30-2014-30-destaques-brasileiros-abaixo-dos-30-anos/", "threshold": 1.0}