{"title": "Under 30 2015: 30 destaques brasileiros abaixo dos 30 anos", "content": "Início / Listas / Under 30 2015: 30 destaques brasileiros abaixo dos 30 anos  Eles têm 30 anos ou menos e, cada um em sua área de atuação, têm revelado iniciativa, criatividade e talento. Com espírito jovem, rara motivação e abertura para o novo, sobre eles repousa a responsabilidade que cabe aos transformadores: a de reinventar o Brasil e assumir as rédeas de nosso futuro. Você vai conhecer cada um deles abaixo: MALLU MAGALHÃES22 anosCANTORA E COMPOSITORA Em um cenário musical, o brasileiro, repleto de novas cantoras voltadas à MPB tradicional e preocupadas em serem aceitas por seus pares, Mallu Magalhães vem sendo um sopro de renovação: ela é pop, assume-se como tal, e, há alguns anos, optou por viver e trabalhar longe do eixo Rio-São Paulo. Aliás, muito longe: junto com seu marido, Marcelo Camelo, Mallu mora desde o segundo semestre de 2013 em Lisboa. “Adoro esta cidade, que é pequena mas tem muita vida cultural. Aqui posso fazer tudo a pé: vou a livrarias, shows, parques, estúdio”, conta ela, feliz. Mallu começou a compor aos 12 anos. Aos 15, conseguiu gravar quatro de suas músicas e colocou-as na internet. No início de 2008 apresentou-se pela primeira vez em um show e, desde então, vem cativando público e crítica a cada novo álbum (quando seu CD Highly Sensitive foi lançado nos EUA, o jornal “The New York Times” disse que a brasileira “soa como se estivesse cantando só para si mesma, e isso a faz sedutora”). Seu grande projeto atual é a Banda do Mar, que formou junto com Camelo e o músico português Fred Ferreira. “Sou eu que desenho todos os cartazes do grupo. Hoje em dia o artista tem de ter um papel mais ativo do que no passado. Não dá para ficar contratando pessoas que façam tudo por nós, sai muito caro”, afirma Mallu. Até mesmo nisso ela é, decididamente, moderna. AR BRUNO QUEIROZ24 anosCRIADOR DA THE ORIGINAL CUPCAKE “Muitas empresas começam e terminam com a novidade. Nós conseguimos passar pelo boom”, diz Bruno Queiroz sobre sua marca de cupcakes, a The Original Cupcake. Apesar de os bolinhos individuais não serem mais uma moda, mas um novo hábito de consumo, a rede de quiosques está indo muito bem. Cresceu 40% no ano passado e faturou uma média de R$ 12 milhões. “Abri a loja em 2009, quando conheci o cupcake lá fora e fiquei encantado pelo conceito, beleza e praticidade. Investi cerca de R$ 40 mil em um quiosque, comprando o doce de um revendedor. Um tempo depois, montei nossa primeira cozinha, de 90 m²”. Atualmente são 26 unidades espalhadas por São Paulo e uma fábrica de 700 m², no bairro do Ipiranga. Sempre atento às novidades, Bruno decidiu começar outra frente de negócio que era febre no ano passado: a The Original Cake, de bolos caseiros, hoje com 26 lojas que vendem os dois produtos, além de café, água e sorvetes. “Estamos expandindo a rede de bolos para outros estados, como Rio de Janeiro e Belo Horizonte. Já os cupcakes comercializaremos para todo o Brasil e também no varejo, em supermercados. Acabamos de fechar um negócio com o Sonda.” Para controlar a expansão das duas marcas, criou uma empresa — a NQZ Multi —, que também é responsável por uma rede de clínicas de estética e outra de reparos automotivos. Com apenas 24 anos, Bruno cuida de três empresas e ainda tem muito o que empreender no futuro. BT GABRIEL MEDINA21 anosSURFISTA Quem esperava que 2014 fosse o ano dos gramados para o Brasil, enganou-se: foi o ano do mar. No centro das atenções não estavam 11 nomes famosos no mundo inteiro com a amarelinha, mas um jovem de 21 anos sobre uma prancha. Assim Gabriel Medina terminou seu ano, como o número 1 do mundo do surfe. Nunca antes o esporte tinha atingido um patamar tão alto com um brasileiro. Na verdade, o paulista foi o primeiro surfista de língua não inglesa a ser campeão mundial (WTC). Nascido em São Sebastião, litoral norte de São Paulo, Medina começou a surfar aos 9 anos. Não demorou para chamar atenção. Aos 15 anos, tornou-se o atleta mais novo da história a vencer uma etapa mundial (ASP) e, aos 19, em 2012, estava entre os dez maiores do mundo, em sétimo lugar. Mas 2014 foi sem dúvida o grande ano da sua carreira até então. Sagrou-se campeão do WCT no Havaí com antecedência, nas quartas de final, superando ídolos do esporte como Kelly Slater e o tricampeão Mick Fanning. A título de curiosidade, Slater também tinha 20 anos quando ganhou seu primeiro mundial. Hoje, aos 43 anos, é o recordista absoluto com 11 títulos. Quem sabe daqui a 22 anos, em 2037, Medina não tenha ultrapassado o norte-americano? O caminho está traçado. LBT IGOR FARIA21 anosPRODUTOR Aos 14 anos, Igor Faria já sentia a necessidade de escrever sua história no mundo dos negócios. Começou a promover baladas no bairro da Mooca e conseguiu realizar oito edições da festa em um ano. Hoje, aos 21, é diretor-geral da Rinaldi Produções, criada por seu pai, no começo dos anos 90. A produtora é responsável pelo gerenciamento e expansão do fenômeno Patati Patatá. Somente em 2014, a dupla de palhaços movimentou mais de R$ 250 milhões no mercado, com shows, licenciamentos e produtos. “Eu amo o setor de entretenimento e, em especial, o infantil, pois lidamos com famílias e crianças todos os dias. Apesar de ser uma empresa da família, na qual sempre tive participação, eu realmente gosto do que faço.” Poucos anos atrás, aos 17, deixou de lado um futuro como jogador de futebol para entrar de cabeça na Rinaldi. “Sempre joguei futebol por prazer e por acreditar que eu tinha talento para seguir carreira. Em 2011, o Patati Patatá estreou no SBT e eu jogava profissionalmente em Curitiba. Esse momento foi o divisor de águas para mim. O lado empresarial e a chance de poder colaborar nessa nova empreitada falaram mais alto que o de atleta.” Desde então, Igor não parou mais. Ele dirige os DVDs da produtora, lidera novos projetos — como a série da dupla no canal Discovery Kids e a representação dos Bananas de Pijamas no país —, consolida as marcas da empresa e agora está investindo no segmento de música gospel. “Quero continuar acreditando e empreendendo. O céu é o limite e a alegria, a essência”, diz o jovem empresário, cheio de ideias. BT LUAN SANTANA23 anosCANTOR SERTANEJO O sertanejo está presente na vida de Luan Santana desde os 3 anos de idade. Bem pequeno, em sua cidade natal, Campo Grande (MS), ele chamava atenção da família e de amigos ao cantar clássicos como “Chico Mineiro” de forma correta e afinada. Com 14 anos, fez uma apresentação amadora numa festa com a música “Falando Sério” (da dupla sertaneja João Bosco e Vinícius). Um amigo do cantor filmou e postou o vídeo no YouTube, que se espalhou rapidamente e foi mais do que aprovado pelo público, que passou a pedir a música em rádios do Mato Grosso do Sul, Goiás, Rondônia e Paraná. Dois anos depois, em 2007, subiu ao palco pela primeira vez. O sucesso foi confirmado. Em 2009, a agenda do cantor fechou com 300 shows realizados em todo o Brasil. Hoje, aos 23 anos, a paixão continua a mesma, mas os números não param de crescer: além de oito CDs lançados e mais de 30 prêmios recebidos, o cantor possui uma fama sem igual nas redes sociais com mais de 1 milhão de inscritos no YouTube e 14 milhões de fãs no Facebook. Apesar de já estar envolvido no mundo da música sertaneja desde muito novo, as influências são variadas. Zezé Di Camargo & Luciano é o que não falta, mas Coldplay, Taylor Swift, Bruno Mars e Nickelback não ficam para trás. O enorme sucesso faz com que Luan Santana seja um dos grandes destaques do sertanejo universitário ao redor do mundo: o cantor já se apresentou nos palcos de Londres e de algumas cidades dos Estados Unidos. MSM FELIPE CATALDI E LUAN GABELLINI25 anosFUNDADORES DA BETALABS Em 2010 — último ano de seu curso de administração de empresas na Fundação Getulio Vargas (FGV/EAESP) —, ao identificarem como promissor o mercado de cloud computing (computação em nuvem), os jovens Felipe Cataldi e Luan Gabellini (ambos, à época, com 21 anos de idade) decidiram criar a Betalabs, uma companhia especializada no desenvolvimento de sistemas de gestão empresarial (ERP), e-commerce e softwares sob medida em cloud computing. Eles conciliavam o negócio com seus estudos e respectivos trabalhos: Cataldi era trainee no Itaú-Unibanco e Gabellini, gerente de captação internacional no Banco BBM. “O mercado de TI [Tecnologia da Informação] encontrava-se, de modo geral, carente de boa gestão, de bom atendimento e passava por um processo enorme de mudança de paradigma com o surgimento do cloud. Foi a oportunidade perfeita para que pudéssemos abrir a empresa”, lembra Gabellini. Eles investiram todo o salário que ganhavam no novo empreendimento, que começou a apresentar lucro já no primeiro mês. Em meados de 2011, a vontade de estar cada vez mais próximos do próprio negócio falou mais alto e os dois decidiram deixar seus empregos no ramo bancário para se dedicar integralmente ao projeto. “Começamos com uma salinha pequenininha de 40 m² e dois funcionários; um ano depois, em 2012, pegamos outra sala e dobramos de tamanho, já com 15 funcionários; mais um ano se passou e mudamos novamente, dobramos de tamanho e já atingíamos mais de 25 funcionários. Hoje estamos com mais de 35 pessoas na equipe e atendemos 180 clientes”, comemora Cataldi. O faturamento da Betalabs em 2014 foi de R$ 4 milhões. AR THIAGO CASTANHO27 anosCHEF Deu no “New York Times”: em 2014 um jovem chef paraense foi tema de uma matéria de primeira página no jornal americano – e isso exatamente no dia em que, no Brasil, acontecia o segundo turno das eleições daquele ano. A proeza foi conseguida por Thiago Castanho, que nos seus dois restaurantes em Belém (o Remanso do Peixe e o Remanso do Bosque) pratica uma gastronomia calcada em sabores nativos. Frutas e ervas da Amazônia, além de peixes dos rios da região, são seus principais ingredientes, e não raro ele surpreende — como quando oferece pratos que levam queijo feito de leite de búfalas da Ilha de Marajó ou serve um coquetel de sua autoria que mistura cachaça e jambu, uma erva com propriedades anestésicas. “O Brasil, em se tratando de gastronomia, é aquele adolescente que quer viver a vida intensamente, ansiosamente”, diz. “Sinto que a tendência no país é a descentralização da localização dos melhores restaurantes; isso vem ao encontro de uma demanda dos próprios clientes, que antes diziam só haver estabelecimentos de alto nível no exterior ou no eixo Rio-São Paulo, mas que hoje mudaram essa percepção.” Por sinal, na lista dos maiores chefs da América Latina feita pela revista britânica “Restaurant”, Thiago é o único brasileiro que trabalha fora desse eixo Rio-São Paulo. E quais serão seus próximos passos? “Quero seguir construindo uma equipe sólida em meus estabelecimentos, com capacidade criativa, sem precisar ‘importar’ mão de obra de outros estados”, responde. Penso em abrir uma escola técnica que prepare pessoas para esse mercado. E também abrir outros restaurantes, com outros conceitos, em Belém, no médio e longo prazo.” AR MARINA RUY BARBOSA19 anosATRIZ Sim, seu nome deixa claro: ela é tetraneta do jurista Rui Barbosa, personagem importante da vida política nacional durante os primeiros anos da República. Talvez seja dele que Marina Ruy Barbosa tenha herdado a facilidade para o estudo de línguas (aprendeu um pouco de sueco e de grego, por exemplo, visando interpretar personagens) e o gosto pela música clássica (em 2010, durante um programa de TV, tocou Beethoven no piano que pertenceu à sua tataravó Maria Augusta, esposa do antepassado famoso, durante uma visita à Fundação Casa de Rui Barbosa, no Rio de Janeiro). No entanto, seus belos cabelos ruivos — dos quais é extremamente zelosa, e que denotam o cuidado que tem com a própria imagem — dão pistas do quanto Marina é alguém de nosso tempo: “Tenho bastante calma na gestão de minha carreira, mas sei bem o que quero. Vejo o teatro muito presente em meu futuro profissional, por exemplo. Também pretendo cursar uma faculdade de cinema”, relata. Ela, por sinal, já estreou nos palcos, em um musical, e foi bastante elogiada por sua performance. Também apresentou um programa infantil. Atualmente, Marina dá vida a uma das principais personagens de Império, novela da Rede Globo. Mas 2015 está longe de resumir-se a isso para ela: “Tenho me dedicado a dois projetos para a TV, além da novela. Não posso falar a respeito no momento, mas estou bastante entusiasmada. AR CHAY SUEDE22 anosATOR E MÚSICO Com a inquietação típica da juventude, Chay Suede — ou Roobertchay Domingues da Rocha Filho, nome inventado pelo avô e herdado do pai — reconhece que 2014 foi um ano especial. O garoto que ganhou certa notoriedade ao conquistar o quarto lugar do reality show musical Ídolos, em 2010, na Rede Record, participou da novela e da boyband Rebeldes, formada na sequência, e foi apresentador de televisão, lembra que o ano começou devagar. “Eu estava em busca de novas possibilidades, mas não imaginava o que estava por vir”, conta. E o que veio mudou sua vida. O convite para um teste e a conquista do personagem do comendador José Alfredo na primeira fase de Império, novela do horário mais nobre da TV Globo, virou seu mundo de cabeça pra baixo. Um processo que começou com a mudança temporária de São Paulo para o Rio, passou por uma rotina intensa de trabalho que foi até o dia da estreia, e culminou com o sucesso nacional. “Fiquei muito feliz de interpretar um herói diferente dos tradicionais”, diz. A repercussão abriu caminho para a concretização de vários outros sonhos e projetos. Um deles foi conhecer o ídolo Caetano Veloso. O outro foi garantir um papel de destaque na próxima novela da Globo, Babilônia, que tem estreia prevista para março. Nela, Chay vai viver o filho de um casal gay formado pelas atrizes Fernanda Montenegro e Nathalia Timberg. “Estou ansioso”, confessa. Tem, ainda, na agenda deste ano, Menino do Rio, filme de Bruno Barreto que deve estrear nos últimos meses de 2014. “Gosto de fazer várias coisas ao mesmo tempo”, conta o garoto, que canta, toca, atua, anda de moto e, entre um e outro, pensa em empreender. Chay já foi, por um tempo, dono de um restaurante em Vitória. Alguma nova ideia na cabeça? “Tenho, mas ainda não posso contar.” Ok, vamos ter que deixar para uma próxima entrevista. GA BELLA FALCONI29 anosEMPRESÁRIA A empresária e musa fitness Bella Falconi, de 29 anos, tem motivos de sobra para sorrir. Nascida em Belo Horizonte, vive nos Estados Unidos há oito anos e segue um estilo de vida saudável — de exercícios e alimentação — desde 2011. “Eu era bastante sedentária, comia mal e esquecia da minha saúde. Tive pedra nos rins cinco vezes e colesterol alto por alguns anos. Precisava mudar de vida”, conta. Durante o processo, baixou o Instagram e começou a postar fotos de academia e receitas. De repente, milhares de pessoas passaram a segui-la e, hoje, a mineira conta com 1,2 milhão de seguidores e mais de 500 mil curtidas no Facebook. “Fiquei muito surpresa no início, não achei que repercutiria tanto. Tenho muito orgulho de ter sido uma das pioneiras desse ramo nas redes sociais.” No mundo dos negócios, tem uma infinidade de projetos. Realizou recentemente um de seus sonhos e abriu uma academia, a VFlex, nos EUA. “Não foi fácil investir em um negócio novo, mas eu não imagino a minha vida profissional dedicada a outro mercado que não fosse esse. Decidi arriscar e está dando super certo. A academia tem a minha cara, é o meu universo”. Além do espaço, a atleta tem uma loja on-line, que leva seu nome e vende uma série de produtos licenciados, como linha de óculos da Mormaii e acessórios esportivos da Vollo, e suas marcas próprias: a Vitaflex (rede americana de lojas de suplementos) e Mega Store (loja de cosméticos). Bella também cursa nutrição, dá palestras sobre motivação, lançará um livro neste ano e está na fase mais importante de sua vida: grávida de seu primeiro rebento, uma menina. “No momento, minha prioridade número um é ser uma ótima mãe. Vou viver um dia de cada vez, sem me preocupar com o corpo. Tudo se ajustará normalmente”, diz, radiante. BT FABIANA JUSTUS28 anosEMPRESÁRIA (POP UP STORE) Personalizar a marca de sua empresa e assim se distinguir em um mercado competitivo; projetar o próprio estilo de vida nas peças de roupa que produz e vende, de forma a que todos percebam que esses itens são uma extensão de um estilo próprio; e por fim adotar uma estratégia de vendas pulverizada — lojas físicas, loja on-line, redes multimarcas. Esses são alguns pontos de um plano de negócios concebido por Fabiana Justus quando ainda cursava o MBA em negócios da moda e varejo na Universidade Anhembi Morumbi. Era um projeto tão bem delineado que acabou por transformar-se em algo mais que um simples trabalho de conclusão de curso (TCC): transformou-se na Pop Up Store, uma marca de vestuário que já conta com cinco lojas, além de estar presente em 150 magazines pelo país. “Embora hoje eu me dedique bastante à parte criativa do processo, não sou estilista, mas sim empresária”, frisa ela. “Sempre quis ter meu próprio negócio. Começamos, eu e minha sócia Dani Mattar, com uma primeira loja na Rua Oscar Freire, em São Paulo. Varamos a noite diversas vezes montando o estabelecimento, ficando mais tempo lá do que nas nossas casas. Foi aí que percebemos que realmente havíamos criado um empreendimento, e nossas vidas nunca mais iam ser as mesmas.” Fabiana divulga a Pop Up Store pela sua conta no Instagram (onde tem mais de 210 mil seguidores) e da conta da própria marca (110 mil seguidores) — é ela quem administra ambas. Além disso, há seu site e o da loja, páginas no Facebook etc. “Quando você tem uma empresa, nunca mais dorme 100% tranquila. Você se sente responsável pelo rumo que a companhia irá tomar e também pelos empregos que gera. São muitas preocupações… E eu tinha só 23 anos quando comecei tudo, uma garota muito precoce”, lembra ela. AR RENE SILVA21 anosPRESIDENTE DA ONG VOZ DAS COMUNIDADES “Sempre gostei muito de ler jornais e revistas. Mas nunca via minha comunidade representada em um jornal de grande circulação, pois esses veículos na maioria das vezes só falavam de nós quando ocorriam tiroteios por aqui.” É assim que Rene Silva relata o início de seu contato com a palavra escrita; logo ele começou a usá-la para defender os moradores do Morro do Adeus, na Zona Norte da capital fluminense, onde até hoje mora. Aos 11 anos, criou um pequeno jornal voltado ao bairro e passou a cobrar serviços públicos melhores para o lugar. Em 2010, um episódio marcou sua vida: as Forças Armadas ocuparam o Complexo do Alemão (onde fica o Morro do Adeus) e Rene relatou via Twitter, em tempo real, o que estava acontecendo. “Eu tinha cerca de 600 seguidores no meu perfil pessoal e 180 no do jornal que editava; de repente, o número de pessoas que me acompanhava pulou para 10 mil, enquanto o do jornal chegou a 35 mil seguidores em menos de 24 horas.” Desde então ele segue usando sua proeminência para trazer recursos, públicos e privados, para seu bairro e outras comunidades carentes do Rio de Janeiro. Ano passado, participou como palestrante do Simpósio Internacional sobre Conexão Digital, na universidade americana de Harvard. Antes disso, em 2011, foi escolhido o melhor produtor de conteúdo no quesito Inovação pela Shorty Awards, uma espécie de “Oscar” do Twitter. Rene pretende continuar militando em prol do Morro do Adeus: “Concluí o ensino médio em 2013, aproveitei 2014 para aprender inglês e frequentar cursos ligados ao jornalismo”. AR ÉVERTON RIBEIRO25 anosJOGADOR DE FUTEBOL O futebol está tão enraizado na nossa cultura que quase toda criança tem um time de coração e um ídolo dentro de campo. Destacar-se jogando bola já é um sonho para a maioria dos meninos por aqui. Mas e, aos 25 anos, já ter dois títulos nacionais com um dos maiores clubes do país enquanto ganha o prêmio de craque do Brasileirão dois anos consecutivos? Conheça Éverton Ribeiro. O Cruzeiro sagrou-se tetracampeão brasileiro no ano passado com duas rodadas de antecedência. Foi o segundo ano consecutivo em que o clube mineiro levantou a taça antes do fim do campeonato. No meio, o jovem paulista era um dos destaques do elenco, tanto que ganhou o prêmio em 2013 e 2014. A habilidade do atleta não passou despercebida por Dunga, que o convocou pela primeira vez para a seleção principal em um amistoso contra a Colômbia, em setembro. Para a sorte dos cofres do Cruzeiro, mas para a tristeza da torcida, o mundo também ficou de olho no meia. Em janeiro deste ano, Éverton foi vendido ao Al Ahli, dos Emirados Árabes Unidos, por cerca de 15 milhões de euros (algo como R$ 46 milhões), dos quais quase 9 milhões de euros (R$ 27 milhões) ficaram com o time da Toca da Raposa, que detém 60% do passe. O jogador deve ficar no Oriente Médio até 2018, ano da Copa da Rússia. Com as mudanças frenéticas do mercado da bola atualmente, é difícil prever onde de fato ele estará jogando. Mas se o nível do meio-campista se mantiver, não seria nada improvável vê-lo vestindo a camisa da seleção. LBT CAMILA COUTINHO27 anosBLOGUEIRA A recifense Camila Coutinho ama comunicar-se. Por meio de seu blog, o Garotas Estúpidas, mostra tendências, looks, viagens e as mais variadas dicas de beleza. Aliás, foi a pioneira no conceito de veículo de moda no Brasil. “Criei como uma brincadeira, aos 18 anos, para trocar matérias de blogs internacionais com as minhas amigas.” O que era para ser uma diversão, hoje é um negócio sério e muito bem-sucedido. Tem 6 milhões de visualizações por mês e está em quinto lugar no ranking dos 99 blogs de moda mais influentes do mundo. A vida da it girl, que tem 1 milhão de seguidores no Instagram, é repleta de viagens e reuniões. Esteve, recentemente, na Rússia e já foi também para Dubai, Paris e Londres, sempre a trabalho. Agora, dedica-se a uma nova atividade relacionada ao blog, seu canal no YouTube. Criou quadros, como o “De Carona”, no qual entrevista famosos dentro do carro, e o reality “Cami e Vic Take”, ao lado de sua amiga Vic Ceridono, editora de beleza da “Vogue”. Camila assina também coleções de sapato com a Dumond, roupas com a Riachuelo e Malwee e campanhas para a Nivea no Nordeste. “Sempre gostei muito de misturar peças de grife com roupas mais acessíveis. Acho que essa versatilidade ajuda no sucesso e crescimento do blog.” Para o futuro, a morena quer que o Garotas Estúpidas se firme cada vez mais como uma veículo de comunicação e está investindo na imagem pessoal. “De uns três anos para cá, começaram a procurar pela pessoa Camila. Estou adorando trabalhar o meu nome, assinar linhas e planejar parcerias.” BT TIAGO ABRAVANEL27 anosATOR E CANTOR Ser descendente de um dos maiores nomes da comunicação no Brasil deve abrir muitas portas e tornar fácil a trajetória no meio artístico. Se é isso que você pensa de Tiago Abravanel, neto de Silvio Santos, está enganado. O paulista estreou no teatro aos 17 anos no musical TeenBroadway, em 2004. Seis anos e quatro peças depois, viu uma oportunidade que mudaria sua vida: audiência para o papel principal em Tim Maia — Vale Tudo. “Quando cheguei lá, o diretor estranhou: paulista e branco, mas fui o primeiro a me apresentar e, depois, ele disse que sabia que seria eu”, conta Tiago. O musical foi sucesso de crítica e público ao redor do país e projetou o ator, então com 24 anos, nacionalmente. Foi quando entrou para a televisão, em Amor e Revolução, do SBT, para depois ser contratado pela Globo. Sua voz também chamou atenção e ele passou a ser convidado para cantar em eventos e festas com a banda do musical. As apresentações foram crescendo e, de repente, Tiago teve de fazer as contas para ver se havia espaço para mais uma tarefa na sua paleta artística. No final do ano passado, o jovem paulista lançou seu primeiro single, Eclético, título que não poderia vir mais a calhar. “Ele fala do que eu sou, essa mistura.” Agora, seu dia a dia é uma correria. “Praticamente moro dentro do avião”, brinca. Sem pressa, Tiago diz que pretende fechar o repertório do seu primeiro disco para lançá-lo no final do ano. Sobre substituir o avô, que procura sucessores para se aposentar, à frente de um programa de auditório no SBT, ele não comenta: “Estou bem feliz na Globo” — embora assuma que quer trabalhar com televisão ao vivo. Pelo visto, genética e talento ele tem de sobra. LBT MARIANA PENAZZO E BARBARA DINIZ27 e 29 anosFUNDADORAS DA DRESS & GO Trata-se do primeiro endereço virtual brasileiro que aluga vestidos de festa assinados por grandes estilistas. A Dress & Go é uma iniciativa brilhante em sua simplicidade, e que vem trazendo reconhecimento e sucesso às suas criadoras, Barbara Diniz e Mariana Penazzo. “Oferecemos o closet dos sonhos de qualquer mulher, com vestidos e acessórios para todas as ocasiões, a preços superacessíveis”, diz Barbara. Mariana é quem conta como tudo começou: “Eu estava na casa da Barbara, experimentando alguns vestidos dela para um casamento. Foi quando tivemos a ideia de oferecer tal serviço às mulheres — vestidos de estilistas consagrados disponíveis por uma fração de seu preço em loja. No dia seguinte, navegando em sites ingleses, descobri que isso já existia em Londres, e logo em seguida tomamos conhecimento de uma loja on-line americana de sucesso no setor, a Rent The Runway. Decidimos então apostar no formato.” Juntas elas adaptaram a iniciativa ao Brasil, criando um modelo de negócios que contempla desde a limpeza das peças, possíveis danos aos vestidos, escolha do tamanho adequado de roupa até a possibilidade de a cliente se apaixonar pelo item que alugou e decidir comprá-lo. “Acredito muito na moda nacional. Nossos estilistas têm uma mão incrível para desenhar e criar, e ninguém como eles sabe exatamente como valorizar cada detalhe do corpo da mulher brasileira.” AR HELENA BORDON28 anosBLOGUEIRA Helena Bordon cresceu no mundo da moda. Sua mãe, Donata Meirelles, trabalha no ramo desde cedo e sempre levou a filha em suas viagens. Aos 7 anos, ia para Milão e Paris e ficava encantada com os showrooms de Dolce & Gabbana e Valentino. Arriscou seguir outro caminho, mas não teve para onde correr. “Logo após a escola, comecei a cursar publicidade e cheguei a estagiar na DM9. Resolvi que queria fazer algo diferente e até tentei fugir da moda.” Após um ano de faculdade, foi para Londres estudar administração e trabalhou na área de promoções e eventos da renomada Selfridge. “Aprendi muito durante os dois anos e meio que fiquei por lá e voltei só para abrir a 284”, conta, referindo-se à marca jovem e mais acessível da Daslu, que criou ao lado de Luciana e Marcella Tranchesi, em 2008. No começo deste ano, a jovem empresária resolveu deixar o negócio para dedicar-se 100% ao site. “Quero que meu nome vire uma marca. O meu site é uma curadoria de tudo que eu acho bacana. Mostro meu lifestyle, minha visão sobre a moda, viagens… Também estou investindo muito no mercado internacional para que o portal seja cada vez mais uma referência mundial.” E esse esforço já está trazendo resultados. São 300 mil visitantes únicos e 2,5 milhões de pageviews por mês — 25% correspondendo a cliques fora do Brasil. No Instagram, Helena conta com mais de 450 mil followers e está sempre fazendo parcerias e linhas de produtos com marcas, como Hope, Lool e Martha Medeiros. Um exemplo para suas seguidoras, tem presença constante na primeira fila dos desfiles mais bacanas das semanas de moda e não deixa de lado o trabalho e celular. “Como não consigo ir todos os dias ao escritório, tenho um grupo no Whatsapp com a equipe do site para monitorar tudo.” BT LUCAS LUCCO23 anosCANTOR Foi por meio da internet que uma das vozes mais conhecidas do sertanejo atual foi descoberta. Lucas Lucco costumava postar seus vídeos no YouTube há cerca de dois anos, quando seu empresário o encontrou. Apesar disso, em sua opinião, o reconhecimento só apareceu de verdade quando ele se tornou o “Mozão”, título de uma de suas músicas mais famosas. Nascido no interior de Minas Gerais, o cantor de 23 anos tem um pai radialista, que é, inclusive, uma das maiores inspirações de sua vida e sua carreira — sentimento reforçado na música “11 Vidas”, feita em homenagem a ele. “Quando pequeno, treinava locução no banheiro, mas logo outros caminhos chamaram minha atenção”, conta. Quem pensa que na vida de Lucas Lucco só há espaço para música sertaneja está enganado: entre suas influências estão nomes como Cazuza, Legião Urbana, Coldplay, Soja, Lil Wayne. O cantor possui mais uma grande paixão. “Amo exercícios físicos. Musculação, corrida, trilhas de bicicleta, gosto de conhecer cachoeiras e de estar em contato com a natureza.” Hoje, após ter se tornado fenômeno nacional e com cerca de 20 shows mensais, o jovem mineiro afirma com certeza que 2014 foi o melhor ano de sua vida. A ideia de criar novos projetos e surpreender o público com novos trabalhos é seu grande combustível. “Pretendo gravar meu segundo DVD, lançar músicas inéditas. São tantas ideias.” Para ele, só há uma explicação para o sucesso: “Coisa de Deus”. MSM PEDRO FRANCESCHI E HENRIQUE DUBUGRAS18 e 19 anosFUNDADORES DA PAGAR.ME Stanford pode esperar, principalmente quando o que está em jogo é uma startup com potencial para agilizar os pagamentos on-line. É o caso da Pagar.me, solução digital voltada aos empreendedores virtuais: a ferramenta atua como facilitadora entre as empresas e toda a burocracia que elas enfrentam para receber por seus serviços e produtos. Seus criadores, Henrique Dubugras e Pedro Franceschi, foram aprovados na universidade situada no Vale do Silício, porém resolveram trancar matrícula (por enquanto) para se dedicar à Pagar.me. Eles, por sinal, têm história no empreendedorismo digital: “Comecei a programar quando tinha 12 anos de idade”, lembra Dubugras. “Aos 14, trabalhei em uma empresa que vendia ingressos on-line. Aos 15, com dois amigos, criei um site que ensinava o processo seletivo de universidades americanas, o qual recebeu um aporte de R$ 30 mil da Fundação Lemann.” A trajetória de Franceschi não é menos impressionante: “Eu comecei a programar com 9 anos. Aos 12, fiz o primeiro desbloqueio de um iPhone 3G do mundo. Com 14 traduzi o assistente pessoal da Apple (Siri) para o português. Devido à minha experiência com segurança em iPhones, fui chamado para trabalhar na empresa que cuida da parte móvel da operadora de cartões Cielo, onde aprendi bastante sobre a indústria de pagamentos”. Após se conhecerem em um debate no Twitter, resolveram unir talentos. A Pagar.me recebeu aporte de mais de R$ 1 milhão do Arpex Capital e da Grid Investiments. Companhias como Endeavor Brasil, Catarse, Ingresse.com e Geração de Valor já a usam. Até o fim de 2015, a expectativa é que sejam transacionados mais de R$ 500 milhões por meio de sua ferramenta. AR JOÃO PEDRO MOTTA19 anosCRIADOR DO PLAAY Aos 19 anos, João Pedro Motta é um garoto hiperativo. É, também, um poço de ansiedade (que o confirmem as cinco visitas diárias que faz ao McDonald’s). Mas o fator que mais o diferencia é sua habilidade em entender o mundo virtual. Começou a destacar-se ainda garoto. “Um dia, lancei o blog Web Dicas para escrever sobre tecnologia e dar dicas de apps e tutoriais. Era um espaço em que eu podia falar dos meus programas com credibilidade. Isso foi o diferencial do site por muito tempo, pois como era eu que criava boa parte do que postava, era sempre uma novidade exclusiva.” Por seu talento na programação, foi procurado para trabalhar em grandes empresas, como Google e Twitter. “Não aceitei, queria focar nas minhas criações. A liberdade de tentar, errar e tentar de novo era algo que me agradava muito.” Até que um dia, depois de juntar dinheiro e vir para São Paulo — João é de Governador Valadares, interior de Minas Gerais —, criou o Plaay, um app de streaming. “Minha empresa surgiu da necessidade de existir um serviço que unisse rede social e música no país. Sabíamos que os grandes players iriam chegar ao mercado — Spotify, Deezer, entre outros —, mas isso não nos intimidou. Tínhamos em mente um público-alvo bem definido (jovens, da classe C) e a noção de como atingi-lo.” Inicialmente, o app foi colocado no mercado sem investimento. Ganhou usuários e, com isso, uma marca patrocinadora. Seis meses depois, recebeu aporte do Grid Investments. Já tem dois outros apps em testes, que estão funcionando bem. Por tudo isso, João ainda quer começar uma graduação, já que está 100% focado no Plaay, nas outras criações e preparando-se para lançar uma nova empresa, voltada ao mercado publicitário. BT LAIS TAVARES25 anosDESIGNER Em maio, ocorrerá no Instituto Europeo di Design (IED) do Rio de Janeiro (que ocupa o prédio do antigo Cassino da Urca) uma exposição dedicada a uma brasileira cujos caminhos recentemente cruzaram, de forma decisiva com Paris. A carioca Lais Tavares morou na capital francesa durante três meses de 2014 a convite do Google Cultural Institute, e lá desenvolveu um projeto que repercutiu enormemente entre seus pares: o About Gesture, no qual ela — com a ajuda de engenheiros do Google — mapeou movimentos das mãos de pessoas de todo o mundo. “A decisão de acompanhar apenas os movimentos das mãos surgiu porque elas estão simbolicamente relacionadas ao processo de ‘fazer’”, explica Lais. “Isso significa que são responsáveis por transformar o intangível em tangível. Elas ajudam a subjetividade a manifestar-se em uma forma física.” Lais foi uma das três pessoas selecionadas em todo o mundo para o programa do instituto, e seu sucesso demonstra a excelência do design nacional. De volta ao Rio, onde hoje trabalha (“Me atrai o ritmo do dia a dia de uma agência de design, mas sinto falta da verticalização conceitual que só um projeto experimental tem. Pretendo assumir essa dualidade e seguir assim”), ela reflete acerca do futuro de sua profissão no Brasil: “Vejo que cada vez mais as novas gerações crescem com o interesse pela tecnologia no sangue. Penso que nossa perspectiva em termos de mão de obra é ótima; o maior perigo, no entanto, é o Brasil não criar mercado para que essas pessoas possam ficar e trabalhar por aqui. Mas isso é um risco que enfrentamos em todas as áreas”. AR CAIO GUIMARÃES24 anosINVENTOR “Eu já nasci curioso”, diz o jovem de 24 anos que adora tocar violão e que está prestes a se apresentar na Photonics West, uma das maiores feiras de tecnologia do mundo, em São Francisco. E foi por conta disso que Caio Guimarães chegou onde está hoje. Por meio do Ciências sem Fronteiras, o jovem teve a oportunidade de fazer parte de uma pesquisa que pode salvar a vida de milhões de pessoas. Em 2014, ele fez um estágio no Wellman Center, laboratório de Harvard e do Instituto de Tecnologia de Massachusetts (MIT). Lá, um grupo de cientistas havia descoberto uma nova maneira de matar bactérias resistentes a antibióticos. Certa frequência específica de luz é capaz de eliminar uma infecção bacteriana em cerca de 60 minutos. O método, porém não era eficaz nos tecidos mais profundos da pele e, para isso, Caio desenvolveu uma série de microagulhas com fibra ótica capazes de penetrar nas partes mais difíceis. Apesar do grande avanço, o jovem estudante não estava satisfeito. “Aquilo ainda precisava ser mais prático. Eu precisava ajudar mais”, conta. O estudo é financiado pelo Exército americano, que tem seus soldados infectados regularmente por bactérias. “A máquina que emite luz é enorme e não seria nada prática para essas pessoas que ficam, muitas vezes, em condições precárias.” Para ajudar, Caio desenvolveu uma lanterna portátil – todas as peças foram compradas na Amazon – capaz de emitir o mesmo feixe de luz. “Assim, os soldados podem andar com um kit no bolso.” Apesar da grandiosidade de seu projeto, Caio não é nada diferente de um jovem comum: “Para o futuro, quero acabar a faculdade de engenharia elétrica”. MSM RAFAEL BELMONTE E DANIEL ARCOVERDEAmbos com 25 anosFUNDADORES DA NETSHOW.ME A ideia é objetiva — e brilhante: o Netshow.me, criado por Daniel Arcoverde e Rafael Belmonte, é uma plataforma de transmissão que permite aos artistas (músicos, comediantes, vloggers etc.) apresentarem-se on-line para sua audiência onde quer que ela esteja e ainda ganhar dinheiro por isso. Os fãs, além de curtirem uma apresentação exclusiva em um ambiente intimista, podem interagir e apoiar seus artistas favoritos com gorjetas. De sua parte, os artistas podem recompensar seus principais apoiadores com prêmios criativos como CDs autografados, camisetas exclusivas, jantares e ligações ao vivo, por exemplo. “Iniciar o Netshow.me foi o resultado de um mix de nossa vontade de inovar com a visualização de uma oportunidade latente em um mercado ainda inexplorado”, conta Arcoverde. Artistas como Fresno, Wanessa Camargo, Eduardo Sterblitch, Lucy Alves, PC Siqueira e centenas de outros já se apresentaram pela plataforma. “O empreendedorismo digital no Brasil nunca esteve tão em alta. Cada vez é mais comum nos depararmos com amigos, conhecidos, parentes ou colegas de trabalho largando suas carreiras estáveis e promissoras em grandes empresas para empreender. E o destino quase certo que muitos deles tomam é o mercado digital, talvez porque muitos vejam os cases de sucesso vindos desse setor”, afirma Belmonte. AR ROBERTA VASCONCELLOS26 anosCEO DA TYSDO Roberta quer realizar sonhos. Os dela e os de quem mais baixar seu aplicativo Tysdo, lançado em abril de 2013. O nome da ferramenta, criada para dar uma forcinha nos projetos de vida de seus usuários, é a abreviação de “things you should do”. Viajar, emagrecer, entrar na faculdade ou abrir o próprio negócio. Não importa qual seja o sonho, o Tysdo acredita que fica mais fácil alcançá-lo quando ele é compartilhado com amigos. Nessa espécie de rede social para celular, os usuários clicam em um botão de incentivo, como se fosse o “curtir” do Facebook, para demonstrar apoio aos desejos compartilhados. Além disso, é possível dar dicas aos colegas. “As pessoas se deixam levar pela rotina e ficam sem motivação para correr atrás de seus sonhos”, afirma Roberta, de 26 anos, que tem três sócios: o irmão Pedro Vasconcellos, de 24 anos, Raphael Felício, 27, e Lucas Araújo, 33. Em novembro de 2013 o aplicativo recebeu um investimento-anjo de R$ 440 mil. Agora, está em negociação com fundos de investimento para mais um aporte. Eleito pela Apple como um dos melhores aplicativos de 2014, o app conta atualmente com 50 mil usuários e mais de 220 mil desejos cadastrados. Roberta garante que não haverá propaganda no Tysdo. A receita do aplicativo vem, por exemplo, de parcerias com grandes marcas como a que ocorreu no ano passado com a Mondelez, dona da Halls. A fabricante elaborou uma lista especial de desejos para seus consumidores dentro do Tysdo, a qual era desbloqueada por meio de um código de barras na embalagem da bala. CE GEAN CHU E GILBERTO VERONAAmbos com 25 anosFUNDADORES DA LOS PALETEROS Que viva México! Em 2012, dois engenheiros de computação paranaenses com vocação para o empreendedorismo (Gilberto Verona e Gean Chu, este último de ascendência chinesa) espantaram-se ao perceber que um dos itens mais saborosos da culinária mexicana, as paletas — espécie de picolé recheado, mais espesso que o brasileiro — não era vendido em lugar algum por aqui. “Viajamos pelo México conhecendo as técnicas de confecção artesanal desse alimento, fizemos cursos de sorvete, visitamos indústrias e fabricantes de máquinas visando aprender sobre produção em larga escala”, conta Chu. “Para realizar no Brasil a fabricação maciça desse produto, as paletas, optamos por trabalhar com muitas máquinas customizadas, inovação na qual continuamos investindo até hoje”, conta ele. A empresa está sediada na cidade de Barracão (PR), onde fica sua principal fábrica, a qual produz cerca de 3 milhões de paletas por mês. A rede conquistou um faturamento de R$ 70 milhões em 2014 e projeta atingir R$ 130 milhões em 2015 via abertura de mais 75 lojas (hoje possui 73). “Felizmente, o food service é um dos setores menos penalizados quando ocorrem problemas macroeconômicos, como agora, pois é algo essencial ao dia a dia da população”, ressalta Verona. “A Los Paleteros nasceu para ser grande. Foi como a idealizamos, e trabalhamos diariamente para levá-la cada vez mais longe, sempre com o mesmo espírito de inovação e qualidade com que criamos a empresa”, finaliza Chu. AR AMANDA GOMES19 anosBAILARINA O balé é uma arte notoriamente exigente para com aqueles que a praticam. Seus movimentos, embora tão graciosos, cansam músculos e ossos tanto quanto qualquer trabalho braçal. E é preciso começar muito cedo quando se deseja fazer da dança uma profissão. Mas Amanda Gomes — nascida em Goiânia, depois radicada em Santa Catarina e hoje morando na Rússia — sempre soube que era isso o que queria para si. A atual solista da companhia de balé de Kazan (cidade de 1,5 milhão de habitantes a pouco mais de 700 km de Moscou) nunca receou ir longe para atingir seus objetivos. “Agora estou em excursão pela Europa, junto com meus colegas. Está sendo ótima a viagem, aprendo mais a cada dia”, disse a jovem a FORBES Brasil diretamente da Holanda, onde se preparava para outra apresentação. Amanda é uma das maiores revelações do balé brasileiro desde o surgimento de Ana Botafogo na década de 1980, e sempre mirou alto: recebeu, ao longo dos anos, propostas de companhias dos EUA e da Suíça bastante vantajosas – mas recusou todas. Queria dançar na Rússia, pois é lá que estão os melhores bailarinos do mundo. A jovem, profundamente católica (“Sei que Deus tem um plano para mim e para minha família”), decidiu que iria seguir carreira na dança aos 5 anos de idade. Seus pais mudaram-se para Joinville (SC), para que lá ela pudesse estudar na única unidade que a Academia de Balé Bolshoi mantém fora de seu país natal. Conseguiu formar-se após 6 anos (dois a menos que a duração normal desses estudos) e, na metade de 2014, foi admitida na companhia de balé russa onde hoje está. Mas ela não pretende parar por aqui: “Estou feliz em Kazan, mas sonho em dançar nas companhias de Moscou e São Petersburgo, as mais importantes da Rússia”, revela Amanda. Sonho que, não há por que duvidar, ela também concretizará. AR RODRIGO SALVADOR E ANDRÉ SIMÕES25 e 28 anosFUNDADORES DO PASSEI DIRETO O carioca Rodrigo Salvador tinha uma ideia, mas para executá-la teria de achar um sócio à altura. Alguém entendido de tecnologia, o que não era seu caso, um estudante de comunicação. Lembrou-se de um amigo que possuía alguns contatos. “Eu pago R$ 100 para você me apresentar alguém realmente bom em tecnologia”, pediu. No dia seguinteconheceu André Simões, um estudante de engenharia da computação que, coincidentemente, tinha a mesma vontade de Salvador: criar uma rede social de compartilhamento de materiais de estudo e ideias voltada para universitários. “Aqueles R$ 100 foram o melhor investimento da minha vida”, diz. Em setembro de 2013, o Passei Direto fez seu lançamento oficial e atualmente possui 3 milhões de usuários. A previsão é de aumento de quase 70% até o final deste ano. O grupo Xangô, um desenvolvedor de startups, apostou R$ 550 mil na ideia. Pouco tempo depois, a Redpoint, empresa de venture capital que já investiu em companhias como Netflix, fez um aporte de R$ 4 milhões. “Nos próximos meses receberemos mais do que o dobro do investimento captado até o momento”, afirma Simões sem revelar o valor exato. Redpoint, Bozano Investimentos e Valor Capital serão responsáveis pelo novo aporte. Salvador, de 25 anos, e Simões, de 28 anos, comandam uma equipe de 30 pessoas e cumprem expediente de bermuda e chinelo em um escritório a um quarteirão da praia de Copacabana. Como pretendem ganhar dinheiro? Cedendo espaço para empresas fazerem anúncios publicitários no site da rede social. Companhias que vendem livros; empresas especializadas em aulas on-line e interessadas em contratar estagiários estão no radar. CE ETIENE MEDEIROS23 anosNADADORA O número sete ficou marcado para o esporte brasileiro em 2014. Não, não se trata da rigorosa derrota sofrida pela seleção de futebol no Mineirão, em Belo Horizonte. Foi no dia 7 de dezembro que Etiene Medeiros tornou-se a nadadora mais rápida do mundo em Doha, no Qatar. É a primeira brasileira a conseguir esse feito. A pernambucana venceu o mundial de 50 metros costas em piscina curta, à frente de nomes fortes como Emily Serhbolm, quatro vezes medalhista olímpica. Além disso, quebrou o recorde da prova: 25s67. “Minha meta era uma medalha, mas a competição foi passando e fui me sentindo mais confiante”, conta a nadadora. Para chegar ao topo, sua rotina não é fácil. Treina cerca de oito horas por dia, de segunda a sábado, no Sesi em São Paulo. A dieta tem de ser controlada, sem abusar de doces ou comidas gordurosas. Há ainda toda uma preparação psicológica. E o lazer? “Coisas tranquilas, como ir a um restaurante no final de semana e sair com o namorado. Também amo o mar.” Não é para menos, 2015 será um ano agitado. Etiene disputará, em abril, o Troféu Maria Lenk, um dos principais torneios do país e seletiva para os Jogos PanAmericanos de Toronto, em julho, e para o Mundial de Kazan, na Rússia, no segundo semestre. Ela diz que o objetivo é uma medalha no Canadá. Pelo o que vimos em 2014, esse sonho nunca esteve tão próximo da realidade. LBT FELIPE BURANELLO E EDUARDO PIRRÉ27 e 25 anosSÓCIOS NA MARIA BRASILEIRA Surgida em 2012, a Maria Brasileira é uma rede de franquias especializada na prestação de serviços voltados à limpeza, conservação e cuidados domésticos e comerciais. Na sociedade brasileira, na qual trabalhadores especializados em atividades domésticas e de caráter geral se tornam cada vez mais raros, a empresa vem crescendo a olhos vistos. “Hoje, a rede possui mais de 100 unidades espalhadas por 21 estados”, conta um de seus sócios, Felipe Buranello. “Vi a empresa nascer e, com muito trabalho e comprometimento de todos os colaboradores e franqueados, virar referência do setor.” A companhia surgiu em São José do Rio Preto, no interior paulista, cidade que por sinal é um dos maiores polos de empreendedorismo nacionais. “O setor de serviços se consolidou com o passar dos anos. Esse mercado é bastante amplo e tem muito ainda a se expandir. Seu fortalecimento virá por meio da sua profissionalização, qualificação de mão de obra e também via mudanças culturais no Brasil”, observa Eduardo Pirré, diretor de operações da companhia. A Maria Brasileira possui um portfólio de 15 serviços, dentre os quais os mais requisitados pelos clientes são faxina, dog walker (na qual um profissional especializado leva um animal de estimação para realizar passeios e exercícios), Bom Vizinho (onde o morador contrata alguém para que vá à sua casa e verifique o que for preciso) e cuidados pessoais em geral para crianças e idosos. AR TÁSSIA MAGALHÃES25 anosCHEF Dinamarca: esse país escandinavo, terra de alguns dos melhores restaurantes do planeta, foi fundamental na formação de Tássia Magalhães. Foi para lá que ela se mudou quando resolveu deixar de lado a ideia de especializar-se em doces em troca do sonho de tornar-se uma das melhores chefs do Brasil. Na ocasião (início dos anos 2010 ), Tássia abandonou seu cargo de confeiteira no Pomodori (um sofisticado bistrô paulistano) e conseguiu emprego no AOC, restaurante famoso de Copenhague. A experiência a marcou: “Aprendi muitas coisas lá que foram importantes no meu trabalho. Para obter uma boa base em cozinhas de outros países, também viajei por França e Itália e conheci mais a gastronomia desses lugares”. Ao retornar ao Brasil, ela voltou a trabalhar no Pomodori, onde galgou postos até assumir como chef do estabelecimento um pouco mais tarde. Na ocasião, reformulou totalmente o cardápio da casa, agradando à crítica especializada e sendo indicada a diversos prêmios de chef revelação. Ainda assim, não estava satisfeita. “No ano passado fuinovamente para a Dinamarca, onde passei por mais três restaurantes visando aprimorar minhas técnicas: Amass, Geranium e Kadeua”, conta ela. E como Tássia enxerga o futuro da culinária e do food service no Brasil? “Eu vejo que a gastronomia por aqui cresceu muito. Ela tem atingido um número bem maior de pessoas e os programas de culinária, em canais abertos e fechados, são também responsáveis por essa expansão. Eu acredito que hoje o brasileiro quer sair para comer fora, quer ter acesso às novidades, conhecer os grandes chefs e alimentar-se bem sem gastar muito”, responde ela. Palavras de uma chef que conhece largamente a culinária dinamarquesa – e, ainda mais, a brasileira. AR MALLU MAGALHÃES22 anosCANTORA E COMPOSITORA Em um cenário musical, o brasileiro, repleto de novas cantoras voltadas à MPB tradicional e preocupadas em serem aceitas por seus pares, Mallu Magalhães vem sendo um sopro de renovação: ela é pop, assume-se como tal, e, há alguns anos, optou por viver e trabalhar longe do eixo Rio-São Paulo. Aliás, muito longe: junto com seu marido, Marcelo Camelo, Mallu mora desde o segundo semestre de 2013 em Lisboa. “Adoro esta cidade, que é pequena mas tem muita vida cultural. Aqui posso fazer tudo a pé: vou a livrarias, shows, parques, estúdio”, conta ela, feliz. Mallu começou a compor aos 12 anos. Aos 15, conseguiu gravar quatro de suas músicas e colocou-as na internet. No início de 2008 apresentou-se pela primeira vez em um show e, desde então, vem cativando público e crítica a cada novo álbum (quando seu CD Highly Sensitive foi lançado nos EUA, o jornal “The New York Times” disse que a brasileira “soa como se estivesse cantando só para si mesma, e isso a faz sedutora”). Seu grande projeto atual é a Banda do Mar, que formou junto com Camelo e o músico português Fred Ferreira. “Sou eu que desenho todos os cartazes do grupo. Hoje em dia o artista tem de ter um papel mais ativo do que no passado. Não dá para ficar contratando pessoas que façam tudo por nós, sai muito caro”, afirma Mallu. Até mesmo nisso ela é, decididamente, moderna. AR *Coordenação editorial de Alex RicciardiProdução executiva de Gabriela ArbexDireção de arte de Duda BottiniFotos de Marcelo Spatafora, Marcelo Tabach, Maíra Coelho, Heudes Régis e Letícia Moreira(com participação de Beatrice Teizen, Cintia Esteves, Lucas Borges Teixeira e Mariana Saad Masotti)  © Forbes 2023. Todos os direitos reservados.", "url": "https://forbes.com.br/listas/2015/02/under-30-2015-30-destaques-brasileiros-abaixo-dos-30-anos/", "threshold": 1.0}