{"title": "Under 30 2020: 90 destaques brasileiros abaixo dos 30 anos - Forbes", "content": "Início / Listas / Under 30 2020: 90 destaques brasileiros abaixo dos 30 anos A lista Forbes Under 30 destaca empreendedores, criadores e game-changers brasileiros abaixo dos 30 anos Desde 2014, a lista Forbes Under 30 destaca os mais brilhantes empreendedores, criadores e game-changers brasileiros abaixo dos 30 anos. Nesta edição, selecionamos seis nomes (em alguns casos, representados por duplas ou trios) em cada uma das 15 categorias. Eles foram eleitos entre aqueles que se inscreveram (ou foram indicados pelos leitores) na plataforma Under 30 do site da Forbes (forbes.com.br/under30/), entre os que foram sugeridos pelos líderes e especialistas das respectivas áreas e entre os nomes pesquisados pelos jornalistas da Forbes. As categorias são as seguintes: Arte (artes plásticas e literatura); Artes dramáticas (cinema, teatro e televisão); Ciência e educação; Design, arquitetura e urbanismo; Esportes; Finanças e venture capital; Gastronomia; Indústria (inclui infraestrutura e logística); Marketing e publicidade; Moda; Música; Tecnologia e inovação; Terceiro setor e empreendedorismo social; Varejo e e-commerce; e Web (inclui e-sports). VEJA TAMBÉM: Under 30 2019: Os 90 destaques brasileiros Cada candidato é avaliado segundo uma série de critérios e métricas objetivas e subjetivas, como faturamento, criatividade, ineditismo, benefícios sociais reais e projetados, número de pessoas impactadas e potencial de transformação no setor, no mercado, na comunidade, no país e no mundo. Veja, na galeria de fotos abaixo, os destaques brasileiros da lista Under 30 2020. ARTES DRAMÁTICAS (CINEMA, TEATRO E TELEVISÃO) JÉSSICA ELLEN, 28 Foi em uma peça encenada junto a um projeto social que Jéssica Ellen percebeu que gostava da experiência de ser outra pessoa – e que gostaria de fazer isso mais vezes. Estudou artes cênicas, canto e dança. Por ironia do destino, seu papel de maior destaque está sendo Camila, da novela “Amor de Mãe”, da Globo, uma jovem com quem tem tanto em comum. Assim como sua personagem, Jéssica foi a primeira da família a entrar na faculdade. “Recebi muitas mensagens de pessoas que se sentiram representadas. Ela fala diretamente com as pessoas porque é real. Se você não é a Camila, você conhece uma Camila.” Jéssica não conseguiu concluir o curso por “questões burocráticas”, mas a pedra no meio do caminho de um grande sonho se tornou oportunidade. Após a sugestão de uma amiga, fez um teste de elenco para a Globo. Semanas depois, recebeu a resposta positiva de que faria parte de “Malhação”. E não parou mais: fez “Geração Brasil”, “Santo Forte” (primeira série brasileira do canal AXN), “Totalmente Demais”, “Justiça”, “Filhos da Pátria” e “Assédio”. Nos palcos, depois de muitos testes que não deram certo, foi convidada para ser a protagonista de “Meu Destino É Ser Star”, musical inspirado nos hits de Lulu Santos. Nas telonas, ganhou espaço em “Três Verões”, lançado nas plataformas por causa do fechamento dos cinemas durante a pandemia. Jéssica relembra a importância do seu ofício na quarentena: “Espero que as pessoas entendam a função da arte. É fundamental para o nosso senso crítico. Desejo que seja respeitada e valorizada como já foi. Para 2021, desejo muita saúde e arte”. ARTES DRAMÁTICAS (CINEMA, TEATRO E TELEVISÃO) HUMBERTO CARRÃO, 29 O ator iniciou a carreira ainda criança, aos 8 anos, no seriado “Bambuluá”, da Globo. Em 2004, entrou para o elenco de “Malhação” e, desde então, vem emendando novelas no currículo como o remake de “Ti Ti Ti”, “Cheias de Charme”, “Sangue Bom” e “A Lei do Amor”. Antes da interrupção das gravações por causa da pandemia, estava no ar em “Amor de Mãe” como Sandro e era um dos destaques da trama das 9. Carrão também atuou nos filmes “Aquarius”, indicado à Palma de Ouro em Cannes, “O Animal Cordial”, “Paraíso Perdido”, “Aurora” e “Marighella”. Diretor de dois curtas premiados, ele apresenta o programa “Pausa pro Café”, do Canal Brasil, e escreve o roteiro de seu primeiro longa-metragem ao lado da autora Ana Maria Gonçalves. ARTES DRAMÁTICAS (CINEMA, TEATRO E TELEVISÃO) MARINA MOSCHEN, 24 A jovem atriz faz parte da nova leva de artistas que estrelam as novelas da Globo. Depois de breve passagem pela TV Record, onde atuou em “Os Dez Mandamentos”, viveu sua primeira mocinha global em “Malhação: Seu Lugar no Mundo”, em 2015. Caiu no gosto do público e emendou trabalhos: “Rock Story”, “Deus Salve o Rei” e está escalada para a próxima novela das 9 do prestigiado autor João Emanuel Carneiro, que foi adiada para 2022 por causa da pandemia. ARTES DRAMÁTICAS (CINEMA, TEATRO E TELEVISÃO) YASMIN THAYNÁ, 27 Ela descobriu o cinema pelos camelôs que vendiam filmes em Nova Iguaçu (RJ), onde cresceu. Hoje luta por mais representatividade e acesso à cultura. Seu primeiro curta, “Kbela”, sobre a experiência de ser mulher negra, ganhou o prêmio da Academia Africana de Cinema, o “Oscar da África”. É fundadora da Afroflix, plataforma gratuita de filmes produzidos por negros. Seu trabalho mais recente, “Sorriso Rei”, homenageia grandes artistas negros do país. ARTES DRAMÁTICAS (CINEMA, TEATRO E TELEVISÃO) HENRY ZAGA, 27 O brasiliense Henrique Gonzaga é filho de Admar Gonzaga, ex-ministro do TSE, e vem se destacando internacionalmente em uma área bem diferente da do pai. Inicialmente, estudou administração nos EUA, mas logo aceitou a verdadeira vocação e se mudou para Los Angeles para estudar cinema. Uma vez na meca do entretenimento, não demorou muito até ser descoberto. Desde então, já atuou em séries de sucesso como “Teen Wolf”, da MTV, “13 Reasons Why” e “Gatunas”, da Netflix, e “The Stand”, baseada em livro de Stephen King, da CBS. No cinema, Henry estrelou “Os Novos Mutantes”, spin-off da franquia X-Men, da Marvel (ele interpreta o personagemMancha Solar). Ao seu lado, a brasileira Alice Braga, além de outras jovens promessas de Hollywood, como Anya Taylor-Joy (“O Gambito da Rainha”) e Maisie Williams (a Arya Stark de “Game of Thrones”). ARTES DRAMÁTICAS (CINEMA, TEATRO E TELEVISÃO) ANA HIKARI, 26 A atriz, que iniciou a carreira ainda na adolescência, ficou conhecida do grande público ao dar vida a Tina, uma das protagonistas de “Malhação: Viva a Diferença”, que está sendo reexibida pela Rede Globo. A temporada da novela foi premiada com o Emmy Internacional e conquistou o público de tal forma que, três anos após ser exibida, ganhou uma série original do Globoplay, “As Five”, que acompanha as protagonistas no início da vida adulta. Primeira atriz de ascendência asiática a protagonizar uma novela do canal, Ana é formada em artes cênicas pela USP. Ela já está escalada para a próxima novela das 7, “Quanto Mais Vida Melhor”, com estreia prevista para o primeiro semestre de 2021. No Instagram, onde compartilha os bastidores do trabalho e promove conversas com os fãs sobre temas como feminismoe questões raciais, Ana ultrapassou a marca de 1,3 milhão de seguidores. ARTES (ARTES PLÁSTICAS E LITERATURA) JARID ARRAES, 29 Filha de cordelista, xilogravador e poeta com uma professora, Jarid divide a infância em Juazeiro do Norte (CE) em duas fases: uma de subir em árvores e outra de dedicar todo tempo livre à leitura. Infernizava tanto a avó perguntando o significado das palavras, que ganhou um dicionário de presente. “Com oito anos, tomei consciência real do que era poesia, comecei a ler Drummond, Ferreira Gullar, Paulo Leminski, Augusto dos Anjos. Gostava de estudar, especialmente Português, História, Sociologia, e amava conjugar verbos. Apesar do desejo de me tornar escritora, entendia que era um caminho impossível. Só conhecia escritores homens, do Sudeste, de meia-idade, tudo distante da minha realidade. Foi só aos 19 anos que descobri Conceição Evaristo, a primeira escritora negra da minha vida.” O mergulho de cabeça na literatura veio com a mudança para São Paulo, onde chegou no Réveillon de 2014. A receita de escrever ouvindo óperas tem dado bons resultados. “Redemoinho em dia quente” recebeu o Prêmio APCA de Melhor Livro de Contos de 2019, o Prêmio Biblioteca Nacional 2020 e foi um dos cinco finalistas do Jabuti 2020. “Acho que já estamos na 10ª reimpressão de “Heroínas Negras Brasileiras em 15 cordéis”. O “As Lendas de Dandara” foi traduzido para o francês e teve os direitos para o audiovisual comprados pela Globo.” Jarid também escreveu “Um Buraco com meu nome” e criou o “Clube da Escrita Para Mulheres”, um grupo online com 700integrantes, que já revelou autoras como Gabriela Soutello. Saudades do Cariri? “Da comida, do sotaque, de ouvir zabumba, triângulo e pífano na praça.” ARTES (ARTES PLÁSTICAS E LITERATURA) MARINA AMARAL, 26 A mineira de Belo Horizonte une duas paixões – história e arte – na habilidade ímpar de colorir digitalmente imagens antigas, talento descoberto em 2015. Seu perfeccionismo a gabaritou às mais exigentes instituições, como History Channel e New York Times. O livro “The Colour of Time: A New History of the World”, de 2018, de Marina e Dan Jones, é best-seller mundial, traduzido para 13 idiomas. Em 2020, lança “The World Aflame”. “Me envolvi na produção do documentário sobre Billie Holiday. Foram mais de 100 fotos restauradas e colorizadas em cerca de um ano e meio.” Aos 25 anos, descobre que tem autismo. “Conviver com uma deficiência não é fácil, mas tenho certeza de que jamais teria o interesse e a obsessão que desenvolvi pela ideia de colorizar fotos em preto e branco, se eu não fosse autista.” ARTES (ARTES PLÁSTICAS E LITERATURA) NATHALIE EDENBURG, 28 A modelo mineira de Juiz de Fora começou a pintar nas viagens solitárias do mundo das passarelas. Em 2015, com o fotógrafo Rogério Mesquita, cria o “How Do I Feel Today Project”, que vira projeto social para crianças. “Uma pintura por dia, por um ano, para mostrar meu estado de espírito.” Em 2018, lança “Nathalie Edenburg Art Jewelry”: “peças de arte para serem vestíveis”. Em 2020, com a série de pinturas Alcatruz, assina painel da exposição “Drive Thru Art”. ARTES (ARTES PLÁSTICAS E LITERATURA) IAN UVIEDO, 21 Na cena literária paulistana, há quem destaque a produção de Ian por sua “densidade psicológica, multiplicidade de assuntos e capacidade imagética”. O escritor e artista atua no grupo de criação coletiva La Tosca, publica textos desde 2016 e é coordenador editorial da RevistaRia. Em 2017, entra no grupo líteromusical Trovadores do Miocárdio. Em 2019, o primeiro livro: “Éter – Novela de Narcolepsia”. A segunda obra (“Sexo! Sexo! Sexo!”) deve ser lançada em 2021. ARTES (ARTES PLÁSTICAS E LITERATURA) HANNA LUCATELLI, 28 A energia feminina das personagens pintadas por Hanna Lucatelli tem o poder de segurar o olhar do espectador. A contemplação leva a reflexões orientadas por palavras como “Amai-vos”. Com traços de diferentes etnias, as mulheres são concebidas por uma aura sagrada. Formada em design de moda, a paulistana que cresceu em Pirituba é mãe de Henrico, de 10 anos, e Dara, de 10 meses. Hanna teve um brechó online por quatro anos, período em que fez desenhos diários que evoluíram para muros (o primeiro foi o da mãe). O resultado agradou tanto que suas mulheres poderosas começaram a nascer em empenas ao lado do Minhocão, Praça Pôr do Sol e Beco do Batman. No exterior, deixou sua marca em Londres, Dubai e nos EUA. Em 2021, a rua segue como plataforma principal, mas Hanna quer produzir mais no ateliê e, “quem sabe, preparar uma exposição.” ARTES (ARTES PLÁSTICAS E LITERATURA) YASMIN NIGRI, 30 Filha única, com infância e juventude entre Botafogo e Copacabana, Yasmin sempre gostou de escrever. Achava que seria jornalista. Na hora de decidir a faculdade, enveredou para a filosofia. E por que filosofia? “Porque li Platão e decidi que dedicaria a minha vida a aprender como se pensa.” Na Universidade Federal Fluminense, se aprofundou em filosofia da arte. “Tanto meu TCC quanto minha dissertação de mestrado trataram da mudança no estatuto da arte a partir da segunda metade do século 20. Foi imprescindível treinar minha sensibilidade e desenvolver um olhar crítico. A poesia entrou no caminho. Encontrei nela tudo que eu necessitava para expressar meu universo interior fora da escrita engessada da academia.” “Bigornas”, livro de estreia, tem 70 poemas. Na antologia “50 Poemas de Revolta”, ela assina Pluma Azul. Em “As 29 Poetas Hoje”, organizado por Heloisa Buarque de Hollanda, Yasmin participa com quatro poemas. CIÊNCIA E EDUCAÇÃO KARINE OLIVEIRA, 27 Com nome inspirado no filme “Pantera Negra”, que retrata um país liderado por negros com uma narrativa pontuada porancestralidade, empoderamento e tecnologia, Karine Oliveira fundou a Wakanda Educação Empreendedora em 2018. Antesdisso, a soteropolitana já tinha anos de experiência à frente de negócios, em áreas como moda e produtos de beleza afrocentrados, além de ter atuado em políticas públicas. Com a Wakanda, propõe traduzir abordagens do empreendedorismo tradicional em uma linguagem acessível à população periférica, com foco nas competências de gestão financeira, vendas e planejamento. Produtos incluem o Acelerando Seu Corre, que busca digitalizar microempreendedores que trabalham por necessidade durante a pandemia; o Pitch de Buzu, que desenvolve o discurso de vendedores de ônibus; e o Deusas do Empreendedorismo, imersão focada em mulheres. A participação na mais recente temporada do programa “Shark Tank Brasil”, do canal Sony, e o subsequente aporte da investidora Camila Farani impulsionaram as metas da empresa: “O planejamento de 2021 era previsto para daqui a três anos, mas no programa tivemos a validação de que existe uma enorme demanda pela nossa metodologia, e realizaremos muito mais”, conta a fundadora. Com o método de educação empreendedora digitalizado por causa da Covid-19, a empresa vai licenciar seus produtos, com expansão prevista para São Paulo, Rio, Amapá, Minas Gerais e Maranhão. Outra prioridade é o segmento B2B, em que empresas compram o produto da Wakanda por R$ 50 mil e conseguem atender 360 pessoas da periferia de uma vez, com relatórios de impacto. “Muitas empresas querem apoiar a economia local e trabalhar em uma relação positiva entre as pessoas e suas marcas, e queremos que a Wakanda seja esse canal”, ressalta. CIÊNCIA E EDUCAÇÃO PEDRO MIRANDA, 30 Fundador do Instituto Pedro Miranda, que usa uma metodologia própria para o ensino médico no país, o jovem radiologista viveu um ano diferente em 2020, ao atuar na linha de frente do combate ao novo coronavírus: coordenou uma força-tarefa de capacitação de profissionais da saúde com simulação realística em vários estados, atingindo a marca de mais de 5 mil profissionais treinados. Pedro tem, ainda, um lado empreendedor. Durante a pandemia, criou o HubThink, polo de incubação para startups de saúde na capital goiana. Também investe em negócios do setor, como a Medthink, plataforma online de cursos e educação continuada que usa a realidade virtual para aperfeiçoar as técnicas de estudo dos profissionais de medicina. Sua paixão, no entanto, é o projeto Medicina que Transforma, que seleciona alunos de baixa renda e os prepara para o curso de Medicina. CIÊNCIA E EDUCAÇÃO BIA SANTOS, 24, E MARDEN RODRIGUES, 25 Quando percebeu que a educação financeira era essencial para mudar de vida, Bia Santos, jovem administradora do subúrbio carioca, decidiu escalar esse conhecimento. Criou, em 2016, a Barkus, junto com o economista Marden, apaixonado por iniciativas de impacto social. Hoje, o negócio promove ações voltadas ao planejamento financeiro, uso do crédito de forma saudável e lições para investir. Cerca de 10 mil pessoas já foram contempladas, 3.500 delas de forma gratuita. O faturamento saiu de R$ 25 mil nos primeiros anos para uma previsão de R$ 2,5 milhões em 2021. CIÊNCIA E EDUCAÇÃO ALBERTO DAVID, 24 Aos 20 anos, no início da faculdade, Alberto foi coautor de um dos livros de nefrologia mais usados no país. Aos 22, foi selecionado para um concorrido estágio em pesquisa, no laboratório do imunologista Jorge Kalil. No mesmo ano, foi aprovado para outro estágio, desta vez na Harvard Medical School. Em 2020, o futuro médico teve a chance de exercitar sua veia empreendedora e criou o Movimento #2EM2. Em sete meses, a iniciativa realizou gratuitamente quase 27 mil testes de Covid-19. CIÊNCIA E EDUCAÇÃO ALEXANDRE MALULI, 25 Enquanto cursava o 5º semestre de Administração no Insper, uma das principais escolas de negócios do país, Alexandre percebeu que algumas matérias tinham um alto índice de reprovação, ao mesmo tempo em que vários de seuscolegas gastavam muito em aulas particulares. Criou, então, um site de videoaulas e conteúdos de estudo que, com o tempo, evoluiu para uma plataforma mais ampla e monetizada. Cinco anos depois, quando acumulava 1.200 professores cadastrados, mais de 15 mil materiais produzidos e 3 milhões de usuários, a Estudar com Você foi vendida para a italiana Docsity. A operação foi concluída em agosto, em plena pandemia, por valor não revelado. Desde então, o jovem paulistano estuda seus próximos passos, ainda cercados de mistério. CIÊNCIA E EDUCAÇÃO ARTHUR LIMA, 28 Para combater o racismo enfrentado por pacientes e profissionais de saúde negros, o dentista soteropolitano Arthur Lima criou a AfroSaúde, que atende a oferta e demanda para um atendimento mais humanizado. A plataforma foi cofundada com o jornalista Igor Leonardo, que enfrentava dificuldades em encontrar especialistas para tratar problemas específicos da pele negra. O app da healthtech lista mais de 600 profissionais como médicos, fisioterapeutas, dentistas e terapeutas em São Paulo, Rio e Bahia, e oferece telemedicina – tecnologia que a startup também utilizou para atender centenas de pessoas remotamente durante a pandemia. Em 2021, a AfroSaúde avança com um braço educacional focado em empreendedorismo para profissionais de saúde, uma assinatura mensal e pagamento das consultas pelo app, além de prontuários eletrônicos. A meta é mais do que dobrar a base de profissionais e expandir em território nacional. DESIGN, ARQUITETURA E URBANISMO LEONARDO DIAS, 28 Proteção contra uma doença mortal, informação de qualidade e memorial às vítimas da Covid-19. Apoiado nesse tripé, o arquiteto e urbanista paulistano, que cresceu desenhando mangás em bairros como Aricanduva e Penha, criou um totem que disponibiliza água e sabão para higienizar as mãos; dados confiáveis da OMS (Organização Mundial de Saúde) e de órgãos competentes sobre o vírus para evitar a disseminação de fake news; e, para fugir à frieza dos números divulgados diariamente, fotos dos que sucumbiram à pandemia. A ideia ficou tão redonda que Léo ganhou o concurso internacional Corona Virus Design Competition (votação popular), que contou com 114 propostas. Em São Paulo, o totem virou realidade e 20 foram instalados por três meses em várias regiões. Fã da arquitetura de Lina Bo Bardi e do escritório suíço Herzog & De Meuron, a visão social da profissão norteia os trabalhos de Léo, formado pela Universidade Federal do Rio Grande do Norte em 2017 e contratado em 2018 pelo renomado escritório franco-brasileiro Triptyque Architecture. Antes disso, fundou o próprio escritório em Natal (RN), o Lot Studio, quefuncionou de 2016 a 2018, e o Lado Arquitetura, em São Paulo, que desenvolve projetos residenciais e produz imagens para o mercado imobiliário. Entre premiações e reconhecimentos, já são 12 projetos. Nos EUA, teve duas experiências importantes no Illinois Institute of Technology (intercâmbio com bolsa de estudos), em Chicago, e no Studio Vural (estágio remunerado), em Nova York. DESIGN, ARQUITETURA E URBANISMO RODRIGO BELLI, 23 “Eu acredito que devemos lutar contra a desigualdade social e criar ferramentas de mobilidade social.” Foi com essa crença que o fluminense de Niterói aproveitou a oportunidade de desenvolver um projeto de empreendedorismo social no curso de Design de Produto (PUC Rio). A partir de um estudo em grupo do processo de urbanização informal no Estado, entenderam a situação dramática de acesso à água tratada em diversas comunidades. “Para as pessoas conseguirem beber uma água segura, em geral, precisava-se de quatro etapas: captar, transportar, armazenar e filtrar a água. Criamos [em 2020] o kit Água Camelo com mochila de 15 litros, filtro portátil [validade de dez anos] e suporte de parede. A meta em 2021 é impactar pelo menos 75 mil pessoas, a partir da distribuição de 5 mil kits em todos estados brasileiros.” DESIGN, ARQUITETURA E URBANISMO AIRON MARTIN, 28 ANOS Com raízes familiares no Ceará e no Pará, ele nasceu em Sinop (MT). Influenciado por processos multidisciplinares de Geraldo de Barros (1923-1998), Airon fundou a Misci, que desenvolve mobiliário (como a Cadeira Misci001), acessórios e roupas inspirados na miscigenação dos elementos estéticos, com loja em Pinheiros (SP). Em 2018, a Misci assinou a primeira coleção de mobiliário e vestuário. Após tentar Direito e Medicina, ele cursou design no IED, em São Paulo. DESIGN, ARQUITETURA E URBANISMO MARIA EUGÊNIA ANTUNES, 27 “Desde pequena, sempre fui muito ligada à criação e à pintura. Vi no curso [Desenho Industrial na FAAP, 2015] a possibilidade de trabalhar estes dois pontos. Ao entender as diversas atuações do design, fui apresentada à cerâmica.” Inspirada por mãe e avó – ambas com afinidade com artesanato e artes plásticas, a paulista começou pintando porcelana em Araçatuba, fez curso em Londres e trabalhou no ateliê Cerâmica Serafine, até criar a marca Marô Antunes. DESIGN, ARQUITETURA E URBANISMO STEPHANIE RIBEIRO, 27 “Sou filha de uma auxiliar de dentista que me criou por anos sem a presença do meu pai. Minha avó trabalhava numa fábrica têxtil e meu avô, que influenciou minha escolha profissional, era pintor em obra civil. Ele é negro fruto da relação de uma indígena e um negro; e minha avó é branca. O importante é destacar que me considero uma mulher feminista negra.” É assim que a arquiteta e escritora, paulista de Araraquara graduada em Arquitetura e Urbanismo pela PUC Campinas, apresenta sua ascendência. Ela recebeu em 2018 o prêmio Most Influential People of African Descent e, em 2020, assumiu a apresentação e a criação de projetos do “Decore-se”, no canal GNT. “Meu interesse pela área nasceu de forma engraçada: sou apaixonada por televisão e era muito fã do ‘Castelo Rá Tim Bum’. Eles tinham um cenário muito marcante, e isso nunca saiu da minha memória.” DESIGN, ARQUITETURA E URBANISMO PEDRO ÁVILA, 30 Espaço multidisciplinar de arquitetura e design, o Estúdio Orth é fundado por Pedro Ávila e Seba Orth. Com estética brutalista, adota materiais naturais. “Tudo é maciço, fundido, não usamos verniz nas peças”, diz Pedro sobre o bureau criativo organizado nos Jardins (SP) há três anos. O brasiliense está em São Paulo desde 2008. Chegou para cursar Design Industrial, no Senac. Em 2018, o estúdio é contratado pela Vitacon para desenvolver o prédio e a estratégia de vendas do Chez VN. No início de 2019, Pedro vai a Londres colaborar com a marca Away To Mars e fazer especializações em fundição, molde e escultura. No fim do ano, Pedro e sócios são convocados a assinar os troféus do prêmio anual YouTube Works, pedidoque se repete em 2020. Em novembro, Pedro lança o e-commerce Noda. Ao lado do diretor de arte Otávio Françoso, assinam uma seleção de objetos de cozinha de artesãos brasileiros. ESPORTES BRENNER DA SILVA, 20 A história de Brenner com o São Paulo começou quando ele tinha apenas 11 anos: foi descoberto por um observador dotime em Cuiabá (MT). O menino passou a morar no CT de Cotia e se destacou nas categorias de base. O atual camisa 30 logo mostrou o faro de gol. Ele foi artilheiro da Copa Nike Sub-15 (2015, sete gols), da Copa Santiago Sub-18 (2017, oito gols) e do Campeonato Paulista Sub-17 (2017, 28 gols). Foi promovido por Rogério Ceni ao time profissional aos 17 anos e estreou na derrota para o Atlético-PR, em junho de 2017. O primeiro gol saiu no mesmo ano, no empate com o Bahia, na despedida de Lugano. No entanto, o jogador foi emprestado ao Fluminense em 2019 (de 2017 a 2019, em 35 jogos marcou só quatro gols). Brenner chegou a pensar em desistir da carreira. A história teria outra reviravolta em 2020, com uma nova oportunidade de integrar o elenco principal do São Paulo. “O Fernando Diniz [técnico] conversou comigo, coloquei na cabeça que aquela era a chance da minha vida e que eu teria que agarrá-la de qualquer maneira. É o que venho procurando fazer diariamente, com muito trabalho e entrega.” O jogador virou o artilheiro do São Paulo na temporada, com 20 gols até o dia 17 de dezembro. Brenner é um dos cinco jogadores com até 20 anos com mais dobletes (dois gols na mesma partida) da história do time. Ele aparece na quarta posição, ao lado de Müller, com seis dobletes. “Sonho e vou trabalhar bastante para ter muitas conquistas. E quem sabe um dia realizar o sonho de jogar pela seleção brasileira principal.” ESPORTES RICHARLISON DE ANDRADE, 23 Richarlison começou no futebol em escolinhas de Nova Venécia (ES). O primeiro time profissional foi o América-MG. O Pombo, como é conhecido, foi contratado pelo Fluminense no fim de 2015. No time carioca, sofreu uma fratura no pé que o afastou dos gramados no início de 2016.  No início de agosto de 2017, transferiu-se para o Watford, da Inglaterra. Na temporada seguinte, foi para o Everton. O atacante já é o quinto brasileiro com mais gols na história da Premier League (33 até 16 de dezembro). A primeira convocação para a seleção brasileira foi em agosto de 2018 para amistosos contra os Estados Unidos e El Salvador, contra quem marcou. Foi campeão da Copa América de 2019. Ativo nas redes sociais, o atacante mostra sua luta pelas causas sociais. Ele postou sobre os assassinatos de George Floyd Jr. e do adolescente brasileiro João Pedro. ESPORTES ANA SÁTILA, 24 Influenciada pelo pai e ex-técnico Cláudio Vargas, Ana Sátila começou a remar aos 9 anos, em Primavera do Leste (MT). A mineira de Iturama, aos 16 anos, foi a integrante mais jovem da delegação brasileira na Olimpíada de Londres (2012): ficou em 16º no K1 (caiaque). No Rio (2016), ela terminou em 17º.  Em 2020, Ana conquistou suas primeiras medalhas de ouro em etapas da Copa do Mundo de canoagem slalom no C1 (canoa), na Eslovênia e na França. ESPORTES LUISA STEFANI, 23 Luisa começou a jogar tênis aos 10 anos e alcançou em 2020 a 32ª posição no ranking mundial de duplas, melhor marca da carreira. A paulistana conquistou o WTA de Lexington e o WTA 125 de Newport Beach. Ela também foi vice noWTA de Estrasburgo e do Premiere de Ostrava. Chegou às quartas do US Open e às oitavas em Roland Garros. Ao lado de Hayley Carter, disputou três Grand Slams e venceu seis jogos. Foi bronze nas duplas no Pan de Lima (2019). ESPORTES AMANDA RIBAS, 27 Apontada como uma futura desafiante ao cinturão da categoria peso-palha (até 52 kg) no UFC, Amanda Ribas começou no esporte aos 3 anos, na academia do pai, o lutador Marcelo Ribas. Aos 14 anos, deixou Varginha (MG) para morar em Belo Horizonte e se dedicar ao judô. A atleta chegou a ser selecionada para uma seletiva para os Jogos de Londres (2012). Uma nova lesão a fez desistir do esporte e voltar à cidade natal para estudar. Um novo convite, porém, alevou para o MMA.  Com um cartel de dez vitórias e uma derrota na carreira, fez sua estreia no UFC em junho de 2019. Desde então venceu as quatro lutas que fez no UFC (Emily Whitmire, Mackenzie Dern, Randa Markos e Paige VanZant). Nona colocada no ranking peso-palha, ela pega a brasileira Marina Rodriguez, dia 23 de janeiro, no UFC 257, em Abu Dhabi. ESPORTES DAMIRIS DANTAS, 28 Começou a jogar basquete na escola, em Ferraz de Vasconcelos (SP). Defendeu times brasileiros e espanhóis antes de ser escolhida no Draft da WNBA de 2012 pelo Minnesota Lynx. Atuou também no Atlanta Dream. Em sua sétima temporada na liga norte-americana, Damiris teve as melhores médias da carreira em pontos, rebotes e cestas de 3 pontos pelo Minnesota Lynx. O time foi até a semifinal e renovou o contrato da pivô até 2022. A brasileira anotou recordes na carreira: 13 rebotes contra Dallas e 28 pontos contra o Chicago.  Após o fim da temporada nos EUA, fechou com o Vera Cruz Basquete (Campinas, SP). O acordo vale só pelo Campeonato Paulista. O destaque da Damiris não fica restrito às quadras; ela se posiciona fora também. “Estou muito ativa na minha luta contra o racismo.” Pela seleção brasileira, ela foi campeã da Copa América de 2011 e jogou duas Olimpíadas (Londres e Rio). FINANÇAS NATHALIA RODRIGUES, 21  O canal @NathFinanças completou dois anos no YouTube e já acumula mais de 200 mil inscritos; no Instagram são quase300 mil seguidores que acompanham as dicas de economia e investimentos da Nath, uma garota de Nova Iguaçu (Rio de Janeiro), que descobriu matemática financeira na faculdade e percebeu que finanças pessoais não era algo tão complicado assim. Faltavam, porém, influenciadores que abordassem o assunto de forma acessível. “Não aguentava ver gente do mundo das finanças, que nunca morou na periferia, dizer pra mim o que tenho que fazer com o meu dinheiro ou tratar desse assunto como uma questão de mérito, porque ninguém é pobre porque quer”, relembra. “Não me sentia representada.” Depois do primeiro vídeo, ela não parou mais. No começo, trabalhava, estudava e gravava para o canal usando um celular e um tripé improvisado. Quando terminou a faculdade, saiu do emprego e passou a se dedicar totalmente ao canal. Chamou a atenção da imprensa internacional, deu entrevistas, viajou pela primeira vez de avião e viu a empresa crescer ao ponto de ser chamada pelo Spotify para lançar o podcast “Boletos Pagos”. Agora, prestes a chegar ao seu primeiro milhão de reais, Nathalia contratou consultoria para estruturar sua empresa, montou uma equipe de 20 funcionários, incluindo a mãe, que é responsável pela gestão da agenda, e se prepara para voos mais altos. Em janeiro, ela vai lançar o livro “Orçamento sem Falhas”, começará um mestrado emEconomia e Finanças, provavelmente na Unicamp, e se prepara para ser investidora anjo para apoiar empreendedores negros. FINANÇAS LARA LEMANN, 27 Por trás de grandes problemas estão as grandes oportunidades. Foi acreditando nessa máxima que Lara e sua sócia Monica Saggioro lançaram em 2018 a Maya Capital. Trata-se de um fundo de venture capital focado na América Latina. Esse fundo tem a função de fazer o aporte inicial em startups com soluções para ineficiências encontradas em diversos segmentos, como saúde, transporte, serviços financeiros e educação, entre outros.  Em dois anos, o fundo captou US$ 41 milhões. Tais recursos foram transformados em investimentos destinados a 26 negócios. “Tenho o melhor emprego do mundo”, confessa Lara. “Passo o dia falando com visionários que estão construindo soluções para os grandes problemas do nosso país e, em alguns casos, eu tenho a oportunidade de poder ajudá-los nesse sonho.” FINANÇAS LOUISE BARSI, 26 Filha caçula do megainvestidor brasileiro Luiz Barsi, Louise decidiu em 2019 levar à internet a receita de sucesso da família. Lançou cursos nos quais sintetiza os 50 anos de experiência do pai na bolsa. Em 2020, a proposta atraiu 7 mil participantes, entre alunos e assinantes. Agora, ela pretende incluir o “Jeito Barsi de Investir” como disciplina em programas de pós-graduação e continuar o legado do pai atuando em Conselhos de grandes empresas. FINANÇAS MURILO DUARTE, 25 Com 377 mil seguidores no Instagram, 236 mil inscritos no canal e mais de 4 milhões de views no YouTube, o perfil @faveladoinvestidor, criado em 2019, se tornou um fenômeno na internet ao falar de investimentos para o público de baixa renda. Morador da favela do Jardim João 23 (zona oeste de São Paulo), Murilo prepara cursos, e-books e parcerias como a realizada com o Kondzilla. O próximo passo será o lançamento do podcast Faveladocast. FINANÇAS BETINA ROXO, 29 Ao aliar planilhas e números a uma comunicação descomplicada, a analista de ações da XP Investimentos virou sucesso nas redes sociais. Com a receita (que parece simples, mas, como toda receita, tem seus segredos…), viu seu número de seguidores dar um salto para 85 mil. O bom desempenho não passou despercebido pelos altos escalões: recebeu uma promoção. Então, desde agosto de 2020, é estrategista-chefe da Rico Investimentos, corretora que faz parte do grupo XP. Primeira mulher a ocupar esta posição, Betina tem como objetivo falar de investimentos, de um jeito descontraído e divertido, democratizando o mercado de capitais e atraindo mais jovens e mulheres. No YouTube, a ideia já está funcionando. O canal da corretora, que tem 600 mil seguidores, registra que, desde a chegada de Betina, o número de mulheres inscritas subiu de 30% para 45%. FINANÇAS LARISSA MARANHÃO, 26 Desde pequena, a alagoana sabia o que queria ser. Ela estabeleceu a primeira grande meta da vida em 2003: soube do curso de economia em Harvard e, na pergunta “sonho” da agenda do Scooby-Doo, trocou “voar de mochila a jato” por “estudar economia em Harvard”. Foi rejeitada na primeira tentativa, entrou na segunda e se formou em 2017. Larissa faz parte do time fundador da Brex, a startup que conquistou o Vale do Silício oferecendo cartão de crédito para outras startups. A ideia surgiu em 2017 a partir da própria dificuldade dos sócios Henrique Dubugras e Pedro Franceschi em conseguir crédito para seus projetos. Os três desenvolveram a startup, lançada em 2018. Larissa montou uma rede poderosa com mais de 100 aceleradoras e venture capital que fez bombar a marca nos Estados Unidos. A boa performance atraiu investidores. Hoje, a empresa tem mais de 500 funcionários. A valuation alcança US$ 2,6 bilhões. GASTRONOMIA FRANCO SAMPOGNA,29 A gastronomia entrou para a vida de Franco quando ele se mudou para a França, aos 17 anos. Na infância, ele acreditava que seria advogado. Mas, ao chegar ao país europeu, encantou-se pela tradição, respeito e paixão que os franceses têm pela gastronomia. Trabalhou por quase dez anos no que define como uma experiência “superintensa e difícil para um estrangeiro” em restaurantes 3 estrelas de Paris, como Guy Savoy e Alain Ducasse au Plaza Athenée. Decidiu, então, ir atrás do sonho de morar em Nova York. Lá trabalhou por dois anos e percebeu que era o momento de dar o próximo passo: abrir seu próprio restaurante. Ao lado do sócio português Bernardo Silva, abriu o Frevo em Greenwich Village. Projetado em estilo speakeasy junto a uma galeria de arte com obras do francês Toma-L, o empreendimento foi descrito como um restaurante que representa o que é Nova York atualmente: menos caótica, mais acolhedora, mas sem perder o dinamismo e, claro, sem deixar de lado a alta gastronomia. O empreendimento foi avaliado com duas estrelas pelo “The New York Times” e é promessa de estrela no Guia Michelin de 2021. O impacto da Covid-19 para o mercado foi grande em Nova York, um dos epicentros de transmissão da doença. O Frevoficou fechado por mais de oito meses. Mas, para o futuro, Franco tem o sonho de colaborar com um hotel no Brasil: “Seria muito interessante a criação de um conceito no país, um sonho que eu espero que se realize em breve”. GASTRONOMIA GABRIELLI FLEMING, 29 Gabrielli Fleming é sócia do Cepa, restaurante do bairro do Tatuapé, em São Paulo, que entrou neste ano na lista Bib Gourmand, do Guia Michelin, de restaurantes com excelente custo-benefício. Lá, ela é sommelière, enquanto o companheiro e sócio, Lucas Dante, é o chef. Conta que entrou no salão pela primeira vez “para ajudar no fim de semana”. E ficou. Virou sommelière formada pela Wine & Spirit Education Trust (WSET) e deixou o posto de consultora de investimentos em uma seguradora. Depois de passar por Osteria del Pettirosso e Hospedaria, onde foi gerente, chefe de sala e assinou sua primeira carta de vinhos, ela hoje cuida dos rótulos (incluindo uma seleção de naturais) do Cepa. “Tratamos cozinha e salão como iguais, não tem essa de ser um mais importante que o outro, o trabalho é complementar para garantir a experiência do cliente”, afirma. GASTRONOMIA JULIA FRAGA, 29 Julia Fraga é uma das não tantas mulheres no mundo cervejeiro brasileiro. Ao lado do marido, Fábio Comolatti, ela toca dois bares focados na bebida: a premiada casa de cervejas artesanais brasileiras Ambar, aberta há cinco anos, e o recém-inaugurado brewpub TANK, que une fábrica (com capacidade para até 8 mil litros) e bar. Julia é beer sommelière pelo Instituto da Cerveja (ICB), formada em administração pela FAAP, com uma pós-graduação em gestão de mercado. GASTRONOMIA LEONARDO MACEDO, 30 Formado em gastronomia, o curitibano Leonardo Macedo é fundador e CEO da Nanica, casa especializada em torta banoffe (de doce de leite e banana). Em menos de um ano da abertura, em 2018, a marca – que tem Tito Barcellos e Tiago Abravanel como sócios –, se tornou líder no segmento de doces dentro da Rappi. Hoje, tem oito unidades, todas lojas próprias, sendo quatro físicas e quatro no formato delivery. A Nanica produz mais de 130 mil fatias de torta ao mês. GASTRONOMIA GABRIEL BERNARDES, 24 O primeiro vídeo do jovem Gabriel Bernardes na cozinha foi gravado há três anos, em 2017, e contabilizou 2 mil visualizações. Era o início de uma trajetória bem-sucedida no mundo gastronômico. Hoje, a marca Downlicia, de brigadeiros gourmet, é um sucesso de público, e ele, uma celebridade das redes sociais, com quase 170 mil seguidores no Instagram e 630 mil no TikTok. A síndrome de Down nunca foi empecilho para o rapaz, que fez cursos de gastronomia e, com a ajuda da família, montou a marca de doces – os sabores vão de tradicional a uísque ou pistache. Além de vendas diretas, trabalha com parcerias com empresas: a food bike do Downlicia já esteve em QGs de companhias como Coca-Cola, Facebook e Google. “Cozinhar é servir o outro. Não há nada melhor na vida do que servir. Por isso que empreender na cozinha me completa”, fala o jovem chef. GASTRONOMIA JOÃO DIAMANTE, 29 Vindo do Nordeste para morar em uma comunidade do Rio de Janeiro ainda pequeno, João Diamante passou dificuldades antes de se tornar um chef conhecido. Mas, com uma história vencedora, que inclui estágio ao lado do ícone da gastronomia mundial Alain Ducasse no restaurante da Torre Eiffel, Les Jules Verne, em Paris, e o posto de chef executivo do agora fechado Fazenda Culinária, no Museu do Amanhã, no Rio, ele virou o jogo. Do início assando pães escondido em uma padaria perto de casa ao posto de ajudante de cozinheiro na Marinha Brasileira, ele hoje tem a inclusão como foco, além da comida. Formado pela Estácio de Sá, João Diamante é criador do projeto social Diamantes na Cozinha e embaixador do Instituto Identidades do Brasil pela igualdade racial. Atualmente, comanda dois restaurantes, é jurado do reality “Fora da Rota”, no Globoplay, e protagoniza a websérie “Comida Que Transforma”, do canal GNT, entre outros projetos. INDÚSTRIA BRUNO LIMA, 25 Foi em busca de sentir paixão pelo que faz que Bruno Lima deixou a engenharia de lado para fundar a Caffeine Army, empresa que produz o Supercoffee, um suplemento que caiu no gosto dos atletas e influenciadores fitness. Atleta amador de alto rendimento e adepto de um estilo de vida holístico, que contempla cuidados com corpo, mente, nutrição e espiritualidade, Bruno percebeu não havia um espaço na web que falasse desses assuntos. Foi então que desenvolveu a plataforma, juntando especialistas, médicos, nutricionistas dentro do conceito de lifestyle medicine, que trata as doenças não com remédios, mas com um estilo de vida que evite que elas apareçam. Em 2018, o grupo reunia 70 mil seguidores orgânicos no Instagram que, entre vários assuntos, trocavam receitas sobre o Bulletproof Coffee, uma combinação de café, óleo de coco e manteiga ghee. Bruno adaptou a receita para o Brasil com o objetivo de desenvolver uma bebida natural, energética, à base de café que, além de dar um estímulofísico, proporcionasse um estímulo cognitivo e maior concentração. O produto foi lançado apenas para e-commerce em dezembro de 2018 e, no primeiro ano, 70 mil latas foram vendidas.  Em 2020, a Caffeine Army ultrapassou a marca de 720 mil unidades. A estratégia, que começou focada em atletas, com a pandemia passou a buscar o público interessado em bem-estar, oferecendo ainda mais conteúdo nas redes sociais. “A ideia é inspirar pessoas a conquistarem suas melhores versões por meio de recursos naturais”, explica Bruno. INDÚSTRIA GABRIEL TORMIM FERNANDES PAGLIARIN, 24 Com 20 anos, ele fundou a Shark Logística. A ideia era ser uma transportadora sem caminhões, apenas terceirizandoserviços. Mas a demanda cresceu, e ele passou a alugar os caminhões da família e montar sua própria frota. Estruturado no ramo de logística para a indústria de eletrodomésticos e eletroeletrônicos, Gabriel enfrentou em 2020 um novo desafio: ampliar o foco para setores que demandavam mais na pandemia, como os setores de alimentos e higiene e limpeza. Deu certo. Hoje com 300 equipamentos na rua e faturando R$ 5 milhões por mês, ele se prepara para abrir uma empresa de logística internacional door-to-door e comanda a Seattle Armazéns Gerais, com 8 mil m². Baseado em pessoas e tecnologia, seu modelo de gestão chamou tanta atenção que ele fundou a Shark Consulting: consultoria de negócios a empreendedores de vários setores. INDÚSTRIA ALBERTO FLEITH LEMUCH, 28 Aos 18 anos e no primeiro ano da faculdade de Engenharia, Alberto resolveu montar uma construtora para atuar no segmento do Minha Casa Minha Vida. Atualmente, a LBX Construtora atua em mais de dez cidades no Paraná e em SãoPaulo. Fatura R$ 100 milhões por ano. O diferencial é utilizar um método de construção de melhor qualidade e mais barato que a concorrência. Em pleno processo de expansão, ele quer lançar 5 mil unidades por ano em 2025. INDÚSTRIA AMANDA PINTO, 29 Foram mais de três anos de pesquisas e viagens até que Amanda encontrasse a fórmula para substituir o ovo em receitas, ovos mexidos e maioneses. Assim surgiu, em setembro de 2019, a N.Ovo, primeira startup de foodtech focada em alimentos plant-based do Brasil. Segunda geração da família fundadora do Grupo Mantiqueira, um dos maiores do agronegócio brasileiro, Amanda empreende com foco em sustentabilidade, bem-estar animal e questões globais, como a fome. INDÚSTRIA ANDRÉ MACHADO, 30 André trocou a carreira no setor financeiro pela oportunidade de revolucionar o modelo de negócio da empresa da família. Em cinco anos, ele causou uma transformação. A Vex Logística e Transporte, até então simplesmente uma empresa de entregas, se tornou uma solução omnichannel de logística, com um amplo leque de ações, atendendo tanto às plataformas de e-commerce como ao atacado e à indústria. Para movimentar mais 550 mil toneladas de carga por ano (o que equivale a 4 milhões de mercadorias), além das 24 bases esparramadas pelo estado de São Paulo, a empresa se empenhou em reunir um ecossistema com diferentes parceiros empreendedores de tecnologia. O intuito dessa parceria foi desenvolver soluções que vão desde a comprovação de entrega e mapeamento até a roteirização. INDÚSTRIA PEDRO RIO, 27 Uma startup para ajudar pequenos e médios empresários a economizarem na conta de luz. Foi com esse objetivo que Pedro e os sócios Rodrigo Camargo, 25, e Victor Copque, 25, fundaram a Clarke Energia, em dezembro de 2019, em Salvador. O processo envolve um aplicativo que simula a possibilidade de a empresa entrar para a Tarifa Branca (que reflete o uso da rede de distribuição de energia elétrica conforme o horário de consumo) e uma consultoria de eficiência energética. A Clarke analisa a conta e sugere ajustes tarifários que geram economia de até 30%. A proposta é tão boa que em maio de 2020, cinco meses após o lançamento, a empresa captou um investimento de R$ 3,2 milhões liderado pela Canary e com participação da EDP Ventures, do Grupo EDP de energia. A companhia agora quer chegar a outros estados em 2021, além de estudar a criação de um marketplace de produtos focados em eficiência energética. MARKETING E PUBLICIDADE MANU GAVASSI,27 Manoela Gavassi conhece seu público como ninguém. Em parte porque cresceu junto com ele, mas muito por ser fruto dageração “faça você mesmo”, que aposta no próprio feeling e faz acontecer. Manu ficou conhecida do nicho jovem pela revista “Capricho” ainda na adolescência, quando lançou suas primeiras músicas. Hoje, soma mais de 15 milhões de seguidores no Instagram e teve o nome feminino mais procurado de 2020 no Google. A virada mais recente aconteceu ao aceitar se expor para o país e entrar no “Big Brother Brasil”. Decidiu que só o faria se conseguisse, ao mesmo tempo, beneficiar o seu trabalho: em 12 horas gravou mais de 100 vídeos para todas as situações que pudessem acontecer no programa e se transformou em um grande case de branding, marketing de comunidade e storytelling. “Tive confiança em quem eu era. Nunca pensei que ia abrir portas dessa forma, corri riscos, porque poderia ter sidonegativo, mas eu sabia o que queria para a minha carreira. Grandes histórias começam quando saímos da zona de conforto”, relembra.  Manu, que já foi muito criticada por fazer de tudo um pouco, agora encontra a paz em se apresentar como um pacote completo. As marcas compraram a ideia: mais do que uma garota-propaganda, a jovem atua como diretora criativa de diversas campanhas, trazendo a essência que funciona com seu público fiel. “Quando descobri que havia esse interesse, me frustrava um pouco porque eu sou artista, não queria me vender ou sentir que enganava as pessoas. Tentei mudar um mercado em que eu não acreditava.” No portfólio, Tanqueray, O Boticário, Paco Rabanne e Redken. MARKETING E PUBLICIDADE CHRISTIANE SILVA PINTO, 29 Formada em jornalismo, a paulistana da Vila das Mercês migrou para a área de RH em 2013, ao ser admitida como estagiária no Google Brasil. No ano seguinte, cofundou o comitê AfroGooglers, formado por funcionários negros e aliados, com o objetivo de gerar consciência interna em torno da justiça racial. Desde então, é a responsável pela iniciativa, que conta com 250 funcionários. Chris gerencia a estratégia de marketing das soluções do Google para micro e pequenas empresas. Em 2020, liderou ações de grande escala focadas nas comunidades mais afetadas economicamente pela pandemia, como a Semana do Afroempreendedor e o programa Black Ads Academy, que impactaram 15 milhões de pessoas. É TED Speaker e integra o conselho consultivo do RenovaBR ao lado de nomes como Cristina Junqueira e Luciano Huck. MARKETING E PUBLICIDADE ALEX PINHOL DA SILVA, 29 Alex é o fundador da Webfoco, agência que ganhou o selo Google Partner Premier. Em 2009, ele decidiu abandonar um emprego estável para apostar no marketing digital. A empresa já atendeu mais de 3 mil clientes em 40 segmentos, como 123 Milhas, Hang Loose, Cia. Marítima, Kickante e Atacadão. Em 2018, a Webfoco foi finalista do prêmio Google Awards Premier Partner e ficou entre as cinco melhores agências do mundo na categoria Mobile Marketing. MARKETING E PUBLICIDADE ANDRÉ ABREU, 26 Em 2017, ainda na faculdade, André cofundou a BossaBox, marketplace que propõe a aceleração da transformação digital de grandes empresas por meio da conexão com times remotos de tecnologia. Como CEO da empresa, realizou no último ano uma rodada de investimento de R$ 8 milhões liderada pela Astella Investimentos. Hoje, a empresa tem uma base de aproximadamente 12 mil profissionais cadastrados e conta com clientes como Unimed, Corteva e Neonergia. MARKETING E PUBLICIDADE FELIPE HATAB, 29 Com especialização em administração industrial, marketing estratégico e publicidade, Felipe atua como diretor de marketing de marcas premium da Ambev Brasil. Dentro da companhia já foi responsável pela gestão de marketing das marcas Corona, Skol, Brahma e Antarctica. Em 2020, liderou a criação de projetos como a iniciativa de lives “Buteco Bohemia” em parceria com o cantor Gusttavo Lima, que conseguiu bater o recorde de transmissão ao vivo com a maior quantidade de acessos simultâneos na história do YouTube – título que antes pertencia à cantora Beyoncé. Ele ainda desenvolveu o lançamento da cerveja alemã Beck’s no Brasil, com um modelo de parcerias com o festival Tomorrowland, e contribuiu com as iniciativas “Ajude um Buteco” e “Voltadeira Bohemia”, que injetaram mais de R$ 5milhões na economia de bares, ajudando muitos a sobreviverem à crise. MARKETING E PUBLICIDADE DEBORAH FOLLONI, 27 Ela começou sua carreira como designer gráfico em 2011. Alguns anos depois, fundou a Chiligum Creatives, empresa que usa a tecnologia para automatizar parte do trabalho que ela fazia como designer. Como CEO, Deborah conduziu a captação de R$ 2 milhões das investidoras-anjo GVAngels e BRAngels em meio à pandemia. Em 2020, a startup obteve um faturamento 130% maior em relação ao ano anterior, triplicando a quantidade de clientes ativos na plataforma – entre eles estão alguns dos maiores anunciantes do país, como Magazine Luiza, iFood e Rappi. A empresa fornece ferramentas para a produção de mais de 7 milhões de peças de acordo com a identidade visual de cada marca. O salto atingiu a equipe de colaboradores, que aumentou três vezes de tamanho. A Chiligum ainda é a única parceira de creatives oficiais do Facebook na América Latina. MODA RITA CARREIRA, 27 A determinação e a vontade de se destacar são máximas que permeiam a trajetória da Rita, modelo plus-size agenciada pela Ford Models Brasil desde outubro de 2018. Descoberta aos 16 anos, quando estava trabalhando na produção da primeira edição da semana de moda plus-size do Brasil, é bem clara quando afirma que o processo de contratação frequente para trabalhos foi bem demorado, o que a levou a trabalhar como vendedora de lojas e corretora de seguros: “Trabalhava diretamente com mulheres e sempre falava que os meus sonhos eram sair na capa da ‘Vogue’ e desfilar no SPFW. Ninguém acreditava e falava que eu era muito sonhadora. Eu tive todos os motivos para ter desistido.” Mas os sonhos se concretizaram: sua primeira participação na semana de moda paulistana aconteceu em 2017, momentocrucial para a carreira deslanchar de vez. As capas digital e impressa da revista em questão vieram em 2020, junto a campanhas para marcas e palestras. Consciente do lugar que ocupa, Rita utiliza sua voz como agente de mudanças: “Costumo dizer que sou uma modelo que fala. O meu papel é fazer diversos questionamentos, como aumentar a grade de tamanho de marcas, e procuro sempre trazer a pauta racial para todas as conversas. A minha vida é pautada nisso. O meu trabalho tem um propósito muito grande. O meu objetivo é que cada vez mais mulheres fora do padrão sejam bem-sucedidas e ocupem lugares de importância”, conclui. MODA JULIA PAK, 28 A estilista capixaba descobriu o dom de criar vestidos de noivas aos 22 anos, quando recebeu um pedido inesperado de uma prima para que desenhasse e executasse o seu vestido de casamento. Um ano depois, em 2015, inaugurou seu primeiro ateliê, na Bela Vista, o qual mudou de endereço no último ano, para a Rua Oscar Freire. Em 2019 foi vencedora do programa “Prova de Noiva”, do Discovery Home & Health, sua segunda participação em competições televisivas – a primeira foi no programa “Um Show de Noiva”. Em 2020, lançou o MEL (Mulheres de Espírito Livre) by Julia Pak, e-commerce de roupas sob medida, que se apoia em tecnologia para entregar aos clientes um serviço de alta-costura online e oferece ampla grade de tamanhos. Suas criações são frequentemente vistas na dupla Anavitória. MODA RAFAEL CALDEIRA, 29 O publicitário de formação e especialista em tecnologias exponenciais pela Singularity University divide seu tempo entre a agência Soko/Flagcx e a marca Milk Supply, da qual é cofundador. A empresa é pioneira no modelo de negócios de camisetas por assinatura, as quais são “genderless”. Guiada pelo conceito de minimalismo, a marca desincentiva o consumo excessivo e também se responsabiliza por recolher peças antigas dos assinantes e doá-las. MODA CAIRÊ MOREIRA, 26 Moreira é formado em Animação 3D e pós-graduado em MBI Confecção 4.0 no Senai CETIQT. Em 2015, fundou a startup Genyz, consultoria de pesquisa e desenvolvimento de soluções em 3D. Entre seus feitos, a criação de um sistemade escaneamento do corpo das pessoas para confecção de roupas sob medida, o qual foi comprado pela varejista Renner em 2020. Com o uso de tecnologia, tem como objetivo extinguir os tamanhos universais P-M-G. MODA BELLY PALMA, 27 Especialista em moda inclusiva, Izabelle Marques, mais conhecida como Belly Palma, é a atual gestora do Programa de Moda Inclusiva da Secretaria de Estado dos Direitos da Pessoa com Deficiência de São Paulo, o SEDPcd. Formada em administração de empresas, é ativista dentro e fora das redes sociais, educando pessoas físicas e jurídicas sobre a importância da inclusão em todas as esferas da sociedade. Constantemente com um sorriso no rosto, Belly esporadicamente participa de desfiles e estrela campanhas de moda, caso da collab entre a Riachuelo, Barbie e a La Garçonne, marca de Alexandre Herchcovitch, lançada em dezembro de 2019. No momento está em vias de lançar oficialmente a sua consultoria, Vinclus, que trará soluções inclusivas e customizadas para marcas e negócios. MODA RAFAELLA CANIELLO, 25 A sua Neriage, fundada em 2017, é uma evolução do projeto de conclusão de curso da estilista na Faculdade Santa Marcelina. No primeiro ano da marca, estreou na Casa de Criadores e desde abril de 2019 passou a compor o line-up das edições do São Paulo Fashion Week, mesmo ano em que inaugurou sua primeira loja própria, nos Jardins, em São Paulo. Entre as premissas da marca estão os projetos sociais e cocriações, como a parceria com a Associação de Mulheres Indigenas do Alto do Rio Negro, que resultou em bolsas apresentadas na coleção inverno 2020. Toda sua produção é 100% nacional, com uso de tecidos brasileiros, parte deles com selo de sustentabilidade (o objetivo é aumentar o uso a cada coleção) e mão de obra local, em confecções parceiras comandadas por mulheres. O resultado são peças autorais, com shapes interessantes, materializados em cores que já se tornaram marca registrada, como o vermelho e azul royal. MÚSICA PEDRO SAMPAIO,23 Ele é o produtor do momento, destacando-se pelo “faro para as tendências”. Desde que ainda tocava como amador,começando a se acostumar com os equipamentos em festas de conhecidos na adolescência, já sentia vontade de se diferenciar e empreender. Começou, então, a produzir vídeos curtos com remixes e publicar nas redes sociais. Viralizou e passou a se apresentar fora do Rio de Janeiro. Quando decidiu lançar a primeira música autoral, driblou os “nãos” dos artistas colocando a própria voz na faixa. Deixou a faculdade de comunicação por não estar conseguindo se dedicar como gostaria, já que sua verdadeira vontade era trabalhar com música. Essa dedicação aos projetos é o que faz com que Pedro tenha lançado poucas músicas, mas já acumule mais de 3 milhões de ouvintes mensais no Spotify e mais de 3 milhões de seguidores no Instagram, além de um contrato de embaixador com a Samsung – é dele o jingle da campanha do Galaxy que você vê na TV. “Eu lanço poucas músicas porque demora para chegar ao nível que eu quero. Gosto de pensar também na parte visual, nas estratégias delançamento, tudo tem que estar redondo. Não faço hoje e lanço amanhã”, explica. O tempo dentro de casa durante a pandemia permitiu que Pedro produzisse com mais calma e pudesse programar umcalendário de lançamentos para 2021. Ele também conseguiu angariar mais marcas parceiras para melhorar a qualidade do seu produto e chamar atenção lá fora. Por enquanto, o plano está dando certo: durante a quarentena, ele foi elogiado pela rapper Cardi B ao fazer um remix com toque brasileiro para o megahit “WAP”. MÚSICA GUSTAVO MIOTO, 23 O paulista começou a cantar e compor ainda criança, influenciado pela família de músicos. Quando percebeu que a mãe e a avó cantavam suas músicas autorais, começou a acreditar que se focasse na carreira poderia ir além e ser ouvido por mais pessoas. Deu certo: Mioto entrou na lista das 50 mais virais do mundo no Spotify e teve a música mais tocada do ano nas rádios do país, “Com ou sem Mim”. Depois de trabalhar com sucesso de forma independente, 2020 ainda trouxe a consagração de assinar contrato com a gravadora Universal Music. Gustavo profetiza: “Foi o ano de juntar as moedas para distribuir em 2021. Será o melhor ano da minha carreira”. Já estão planejadas colaborações com artistas internacionais em inglês e espanhol e é forte a torcida para poder voltar à estrada, onde Gustavo se inspira para compor. MÚSICA KVSH, 27 O DJ e produtor Luciano Ferreira, conhecido pelo nome artístico KVSH, se destaca por ir além dos palcos. Em adição aos mais de 3 milhões de ouvintes mensais no Spotify, 61 milhões de visualizações no YouTube e shows por todo o país, com apresentações em grandes festivais como Lollapalooza e Rock in Rio no currículo, ele criou também uma marca para comercializar seus produtos, uma festa própria e uma gravadora, a Lemon Drops, para revelar novos talentos da cena. MÚSICA GABRIELE LEITE, 23 Ela já demonstrava afinidade com a música desde a infância, quando transformava baldes e vassouras em instrumentos na casa da família em Cerquilho, interior de São Paulo. Iniciou os estudos de violão clássico no Projeto Guri, passou pelo renomado Conservatório de Tatuí e se formou em música da Unesp. Vencedora do concurso internacional de violão Hubert Kuppel, da Alemanha, agora estuda na prestigiada Manhattan School of Music, onde conquistou uma bolsa de mestrado. MÚSICA KEVIN O CHRIS, 23 Um dos maiores nomes do funk atualmente, o fluminense iniciou a carreira na música tocando na banda da igreja que frequentava. Na adolescência, foi ao seu primeiro baile e decidiu seguir carreira. Fez parte do movimento 150 BPM, que modificou o gênero musical nos últimos anos, acelerando o ritmo das batidas. Ultrapassou a marca de 22 milhões de ouvintes mensais no Spotify e foi o único artista do funk a estar entre os dez homens mais ouvidos da plataforma em 2020. Além de fazer sucesso entre os brasileiros, Kevin também chama a atençãodos artistas internacionais. No ano passado, subiu ao palco do rapper norte-americano Post Malone no Lollapalooza Brasil e gravou um remix do seu hit “Ela É do Tipo” em inglês com o rapper canadense Drake. MÚSICA GIULIA BE, 21 Ela começou a carreira há pouco mais de dois anos, quando conheceu a banda Maroon 5 nos bastidores do Rock in Rio e foi incentivada pelo guitarrista a investir em seu talento. Publicou vídeos no YouTube e foi descoberta pela gravadora Warner Music. Giulia já conta com os hits “Menina Solta” e “Se Essa Vida Fosse um Filme” e marca presença no Top 10 das mais ouvidas do país no Spotify, com 5,5 milhões de ouvintes mensais na plataforma. Seu primeiro EP, “Solta”, recebeu certificado de platina. Ela considera o que viveu até agora como o prefácio de sua carreira, enquanto prepara o lançamento de seu primeiro álbum. “Encerrei 2020 com gosto de gratidão na boca. Passei a encarar os problemas que se apresentam como oportunidades de sair da caixa e a confiar a minha arte e visão na mão de uma equipe que acredita no meu projeto com a mesma intensidade. Eu me sinto, mais do que nunca, pronta para vivê-lo intensamente.” TECNOLOGIA E INOVAÇÃO FELIPE VILLELA, 28 ANOS Desde a infância em meio às plantações de laranja da família em Limeira (SP), Felipe Villela cultiva um fascínio por questões relacionadas ao mundo natural. Ao visitar a Amazônia com 18 anos de idade, comprovou o impacto das monoculturas e do desmatamento no bioma. “Comecei a me questionar: sei que é necessário atender as indústrias [com commodities agrícolas], mas será que não é possível fazer isso de forma que dialogue e inclua a natureza?”, conta. Felipe então conheceu a agricultura regenerativa e agroflorestal e se mudou para a Holanda em 2015, com o intuito de estudar o tema e fazer conexões com investidores, gestores de políticas públicas e experts do campo da sustentabilidade.  Em parceria com o holandês Marco de Boer, criou a reNature em 2017 como uma fundação para apoiar agricultores e comunidades locais de países com altas taxas de desmatamento como a Indonésia e Brasil na adoção de sistemas agroflorestais sustentáveis, com o apoio de fundos filantrópicos. Dois anos depois, o braço comercial surgiu para atender empresas buscando formas sustentáveis de produzir suas culturas agrícolas, como a Nespresso. A reNature atraiu investidores globais, e conta com Fernando Russo, herdeiro da fortuna dos laboratórios Fleury, entre seus apoiadores. Em 2021, Felipe quer trazer a agricultura regenerativa para o mainstream no Brasil, com uma plataforma que mede e precifica o impacto em biodiversidade, e um serviço de transição e capacitação para introduzir o método em cooperativas que atendem empresas privadas. O fundador pretende chegar a 1 milhão de hectares de áreas regeneradas até 2030. TECNOLOGIA E INOVAÇÃO ANDRÉ FERRAZ, 29 Formado em Ciências da Computação, o recifense usou seu conhecimento acadêmico para criar, há uma década, uma tecnologia de geolocalização que cruzava sinais de wi-fi, bússola e acelerômetro 30 vezes mais eficiente do que o GPS. Em 2011, fundou a InLoco Media, com soluções baseadas em dados geolocalizados e mobile advertising. A tecnologia evoluiu e passou a ser usada como uma forma de autenticação por bancos e varejistas. Em janeiro, André mudou-se para Palo Alto, de olho no potencial da IoT. Com a pandemia e o fechamento do varejo físico, a receita com a solução de publicidade digital derreteu. André, então, precisou se reinventar. Vendeu a InLoco Media para o Magalu. E criou, nos EUA, a Incognia, para focar nas soluções de prevenção de fraudes em plataformas móveis. A expectativa é que, em 2020, o faturamento da empresa seja o dobro do registrado em 2019. TECNOLOGIA E INOVAÇÃO RENATO BORGES, 28 Filho de produtores rurais do Mato Grosso do Sul, Renato conhece bem as agruras do agrobusiness. Formado em Engenharia da Computação, criou, em 2017, a Agrointeli, dona de uma solução que monitora as fazendas por meio de imagens de satélites, combina e analisa essas informações numa plataforma e permite o acompanhamento da lavoura do plantio à colheita, identificando meios de reduzir custos e aumentar a produtividade. Hoje, a tecnologia desenvolvida por Borges já monitora cerca de 300 fazendas em 18 estados brasileiros e quatro países. TECNOLOGIA E INOVAÇÃO RAPHAEL MAYER, 26, MATHIEU ANDUZE, 27, E TADEU SILVA, 30 Os três paulistas deixaram empregos estáveis em multinacionais para fundar, em 2017, a Simbiose Social. A iniciativa nasceu da constatação de que propostas sociais que poderiam gerar impactos importantes eram engavetadas por falta de recursos. Eles então desenvolveram uma plataforma que cria uma ponte entre empresas que dispõem de dinheiro para projetos e organizações sociais. Atualmente, mais de 30 companhias do porte de IBM, Unilever, Facebook e Volkswagen usam a ferramenta, que já movimentou R$ 350 milhões em investimentos de incentivos fiscais no país. TECNOLOGIA E INOVAÇÃO GIULIANO BITTENCOURT, 29 Com a motivação de transformar a relação das pessoas com o meio ambiente e a alimentação, o mineiro Giuliano Bittencourt fundou a BeGreen, primeira fazenda urbana da América Latina e a nona do mundo. A tecnologia da empresa permite uma produção 28 vezes superior à do campo, com uma economia de 40% no tempo de cultivo. O sistemautiliza estufas, hidroponia e aquaponia, em que os peixes ajudam na limpeza e na nutrição da água de irrigação, gerando uma economia de 90% no consumo de água. As três fazendas urbanas estão instaladas em shoppings em Belo Horizonte e no Rio de Janeiro, além da fábrica da Mercedes-Benz, em São Bernardo do Campo (SP). Durante a pandemia, a empresa teve um aumento de 320% na base de assinantes de suas cestas de hortaliças. Em 2021, a BeGreen deve inaugurar outras quatro unidades, em São Paulo, Campinas, Salvador e Goiânia. TECNOLOGIA E INOVAÇÃO NATHÁLIA SECCO, 29 Apesar de ter tido uma banda de rock na adolescência e se formado em música, o ouvido de Nathália Secco sempre esteve ligado nas reuniões da empresa do agronegócio dos pais, em que tecnologia era um assunto recorrente. Depois de cursar um MBA na FGV em 2015, a goiana de Rio Verde assumiu os projetos de inovação no negócio da família, e logo percebeu que as tecnologias exponenciais de startups não chegavam ao Centro-Oeste, e que poderia gerar mais impacto na região. Fundou a Orchestra Innovation Center em 2019, que coinveste, acelera e apoia startups como a britânica Hummingbird e a paulista Nuvem UAV na aplicação de soluções no contexto local, junto a empresas do agro. Em 2021, Nathália deve expandir a atuação para a região no entorno de Brasília e Mato Grosso e abrir um braço no Vale do Silício, onde pretende fazer uma captação inicial de US$ 3 milhões para apoiar o crescimento da empresa. TERCEIRO SETOR E EMPREENDEDORISMO SOCIAL ENZO CELULARI, 23 O jovem empreendedor está sob os holofotes desde o nascimento, quando foi apresentado ao Brasil pelos pais famosos, Claudia Raia e Edson Celulari. Duas décadas depois, Enzo afirma que quando era mais novo tentava fugir dos flashes, porque não via sentido em ser reconhecido sem estar fazendo seu próprio trabalho para isso. Com a maturidade, conseguiu ressignificar o ônus, focar no bônus e usar sua fama para buscar auxílio para as causas sociais. Abraçou o chamado e criou o Grupo Dadivar, que auxilia empresas a trilharem um caminho social mais consciente, além de criar projetos em parceria com ONGs. “No começo, achavam que eu fazia por marketing, pela minha imagem. Depois viram que existia consistência, um trabalho sério. Também me criticavam por eu não conhecer a realidade de quem eu pretendia ajudar. Mas existe empatia, entendo a dor do outro, a falta de oportunidade”, relembra.  Apesar de ter pensado em desistir do projeto durante a pandemia, por se sentir impotente ao acompanhar tantas notícias desalentadoras, teve as forças renovadas ao conseguir arrecadar mais de R$ 1 milhão para o Fundo Emergencial de Saúde e a ONG Ação da Cidadania, além de reunir mais de 20 parceiros, incluindo Facebook e Instagram. Para o futuro, Enzo mantém viva a esperança de dias mais igualitários. “Quero que o empreendedorismo social esteja na pauta dos brasileiros, que seja ensinado nas escolas. Espero que antes de eu completar 30 anos a gente consiga ver que o individual não faz sentido, cada um faz a sua parte porque cada um tem seu papel na sociedade. É o único caminho a seguir daqui para a frente.” TERCEIRO SETOR E EMPREENDEDORISMO SOCIAL LAYLA VALLIAS, 30 Uma das maiores especialistas do país do mercado de longevidade. Cofundadora do Hype50+, núcleo de inteligência de marketing especializado no consumidor sênior. Mercadóloga de formação, com especialização em marketing digital pela Universidade de Nova York. Mineira de BH, Layla é uma das responsáveis pelo estudo Tsunami 60+, sobre hábitos de consumo, sexualidade, trabalho, lazer e viagens de brasileiros entre 55 e 89 anos. Para a pesquisa quantitativa (2018), foram entrevistadas 2.242 pessoas nessa faixa etária em todos os estados: dados inéditos sobre uma população crescente no país. Um dos produtos desse profundo estudo é o livro “Trendbook 2019”. O resultado da pesquisa custa R$ 42.650 e já foi adquirido por cerca de 20 empresas do porte de Rede Globo, Santander, Unilever, Pepsico e Grupo Fleury. TERCEIRO SETOR E EMPREENDEDORISMO SOCIAL DANIELLE MATOS, 27 Foi a partir de um post no Facebook, em que pedia indicações para uma vaga, que Danielle criou o Indique Uma Preta: consultoria especializada em conexões entre a comunidade negra e o mercado de trabalho. O projeto reúne 7 mil pessoas. A consultoria ajuda empresas a diminuírem o gap de diversidade com programas para mudança de cultura e para processos de seleção. Twitter, Unilever, Spotify, Facebook, CI&T, Movile e Magazine Luiza estão entre os clientes. TERCEIRO SETOR E EMPREENDEDORISMO SOCIAL JÚLIA EVANGELISTA TAVARES, 29 A advogada Júlia é a segunda mulher a assumir a presidência do IEE (Instituto de Estudos Empresariais), formado por cerca de 250 associados que representam 23% do PIB do Rio Grande do Sul. O instituto forma jovens lideranças empresariais no contexto da economia de mercado e da livre iniciativa, com palestras internas e o Fórum da Liberdade, que é anual. Mesmo na pandemia, Júlia realizou mais de 35 eventos com nomes como Michel Temer e Hamilton Mourão. TERCEIRO SETOR E EMPREENDEDORISMO SOCIAL AMANDA COSTA, 25 Com múltiplas ações de âmbito nacional e global, Amanda da Cruz Costa é dedicada a engajar jovens e endereçar as áreas de crise climática, sustentabilidade e negritude, que considera interligadas, dado o impacto do racismo na justiça ambiental. Formada em relações internacionais, é mobilizadora da rede Youth Climate Leaders, que forma lideranças climáticas, e é articuladora da Global Shapers Community, iniciativa do Fórum Econômico Mundial de jovens com potencial paratransformar suas realidades. Seu próprio projeto, o Perifa Sustentável, busca democratizar o conhecimento sobre clima, meio ambiente e igualdade de direitos na periferia. Em 2021, a ativista deve se envolver em projetos comerciais como podcasts, em paralelo à sua participação em diálogos globais e na construção de políticas públicas, e na influência de tomadores de decisão. TERCEIRO SETOR E EMPREENDEDORISMO SOCIAL KAREN SANTOS, 28 Posicionar mulheres negras como protagonistas na criação da economia digital foi a motivação da designer Karen Santos para fundar a UX para Minas Pretas. A iniciativa criada em 2019 insere mulheres no mercado de User Experience (UX), cujo foco é a experiência que um usuário tem ao utilizar o site ou aplicativo de uma marca. Gerido por Aline Santos e Patricia Gonçalves com outras oito voluntárias em várias áreas, o projeto já treinou mil mulheres negras e lidera ações de empoderamento e articulação com uma rede que engaja mais de 20 mil pessoas.  Natura, Accenture, Nubank, PicPay e QuintoAndar estão entre as empresas que contratam as profissionais da comunidade. Em 2021, o plano é treinar mais de 3 mil mulheres em território nacional através do método, agora digitalizado por causa da pandemia, e criar produtos para garantir a sustentabilidade financeira da iniciativa. VAREJO E E-COMMERCE MARIA EDUARDA CAMARGO, 24 Ainda na faculdade, Maria Eduarda resolveu criar uma marca que fosse capaz de tornar o período menstrual das mulheres não só mais prático e confortável, mas também mais sustentável. Em agosto de 2017, depois de muita pesquisa e estudo, os primeiros modelos de calcinha da marca Pantys, que eram diferentes de qualquer outro produtodisponível no mercado, foram lançados de forma totalmente online. Apenas dois meses depois, uma loja pop-up da marca foi aberta na Rua Oscar Freire – e o sucesso foi absoluto. “Eu acreditava muito no modelo online, que é ótimo, mas as lojas físicas permitem que as clientes entrem em contato com os produtos, sintam a tecnologia e comecem a quebrar um pouco o tabu que ainda existe em torno desse assunto”, diz Maria Eduarda.  Falando em quebra de tabu, toda a identidade da marca foi pensada para distanciar o máximo possível aquela ideiaultrapassada de que menstruação é algo sujo e que deve ser escondido. Com uma paleta de cores delicada e feminina e um perfume que é uma verdadeira assinatura digital presente nas lojas, na sacola e nos produtos (que hoje vão além das calcinhas), a marca leva as mulheres a abraçarem mais esse período e esse fenômeno tão intrínseco à natureza feminina.  Outro fator de extrema importância para a empresa é a sustentabilidade: “A questão da sustentabilidade nasceu junto com a marca. Nós nos tornamos recentemente carbono neutro, e as calcinhas causam bem menos danos ao meio ambiente que os absorventes descartáveis”, afirma a jovem empreendedora. VAREJO E E-COMMERCE NATHAN ROMEIRO, 28, JOÃO PAULO MACHADO, 27, E LUCAS STEHLING, 26 Os três sócios começaram o negócio a partir de uma lista de problemas que eles gostariam de resolver, e entre as ideias que surgiram uma chamou a atenção do trio: o ato de comprar produtos desnecessariamente. Os sócios acreditam que em um futuro bem próximo as pessoas irão priorizar o acesso a algum produto em detrimento da posse definitiva dele. A partir desse pensamento, nasceu, no início de 2020, a Boomerang, uma empresa de “não-compra”. Por meio dela é possível possuir por um determinado período uma grande variedade de produtos sem ter a necessidade de comprá-los. Os produtos não pertencem à Boomerang, mas a lojas parceiras que se cadastram na plataforma. A startup fica responsável pela curadoria dos itens ofertados, assim como a logística de entrega para o usuário e de retirada. VAREJO E E-COMMERCE DANIELA VIANNA, 28 A Ephemeris é uma plataforma por meio da qual é possível calcular os mapas astrais de eventos específicos e transformá-los em um pôster, em uma pulseira ou em um colar. Antes de cofundar a Ephemeris, Daniela chegou a ter uma agência de marketing digital. Mas foi por obra do destino, como gosta de acreditar, que ela e seu sócio tiveram a ideia certa no momento certo e fundaram a plataforma, que já é um verdadeiro sucesso nos Estados Unidos. VAREJO E E-COMMERCE FERNANDA PENTEADO, 27, E FERNANDA DI NARDO, 29 Em 2013, Fernanda Penteado criou, com apenas 20 anos de idade, a marca de doces Sweet Shot Atelier. Cerca de seis meses mais tarde, Fernanda Di Nardo entrou como sócia e, juntas, elas alavancaram o negócio. Ambas são formada em pâtisserie e pasta americana pela renomada escola Le Cordon Bleu de Londres. A loja da dupla empreendedora funciona em um ateliê na Vila Nova Conceição, em São Paulo, onde também são oferecidos cursos de pâtisserie. VAREJO E E-COMMERCE ÉDER MEDEIROS, 29 Em 2015, Éder Medeiros teve a ideia de criar um modelo de negócio que fosse capaz de resolver um problema que ele enfrentou anos antes: a dificuldade do pequeno lojista em se manter competitivo no setor de e-commerce. Sem nenhum investimento inicial, ele programou o próprio site e pouco a pouco foi construindo a Melhor Envio, uma plataforma que conecta pequenos e médios vendedores às principais transportadoras e empresas de logística no país. Desde seu lançamento, a plataforma cresceu ano após ano. Em 2020, apesar da pandemia, a receita líquida superou R$ 30 milhões, contra R$ 8 milhões em 2019, e a empresachegou a 100 mil clientes ativos na base. Em dezembro, pouco depois de a plataforma ter completado cinco anos de existência, ela foi comprada pela Locaweb com o preço de fechamento da aquisição acertado em R$ 83 milhões. VAREJO E E-COMMERCE CAROLINA MATSUSE, 29, E YURI GRICHENO, 29 A Insider Store nasceu comercializando apenas um produto, uma undershirt, aquela camiseta fininha para vestir por baixo de camisas. A ideia do produto veio de uma necessidade pessoal de Yuri, que fez faculdade e morou nos Estado Unidos. Ele sentia falta do produto no mercado brasileiro. As undershirts lançadas em 2017 foram produzidas a partir de uma tecnologia desenvolvida para proteger o tecido do suor, dos odores e da proliferação de bactérias. Mais tarde, a marca lançou outros produtos, como uma linha completa de roupas de baixo masculinas, camisetas tradicionais e camisetas esportivas. Até 2020, a marca era voltada somente para o público masculino. Uma das grandes novidades do ano foi o lançamento de uma linha para o público feminino. A segunda novidade de 2020 foi o lançamento da linha antiviral, que utiliza um tecido desenvolvido pela marca a partir de tecnologia avançada. WEB (INCLUI E-SPORTS) LUCCAS NETO, 28 Pais e mães de crianças pequenas já devem ter ouvido falar bastante sobre Luccas Neto. Com mais de 33 milhões deinscritos, seu canal no YouTube é o quinto maior do Brasil e está na liderança da categoria de vídeos infantis. Sua carreira na internet teve um início conturbado. “Eu não tinha ideia do que estava fazendo, das responsabilidades que viriam”, conta o criador de conteúdo. “Quando o canal começou a tomar um caminho infantil, os pais me davam um feedback que não era o que eu queria receber.” Foi quando Luccas percebeu a necessidade de contratar uma equipe de professores, psicólogos e pedagogos para realizar a curadoria dos vídeos. “Tudo passou a ter aprovação de profissionais da área.” Com o crescimento dos números, ele decidiu transformar seu canal em um negócio e criou, em 2017, a Luccas Neto Studios (Lunes). São produzidas seis horas de conteúdo inédito por dia, com cerca de 50 pessoas no set para a gravação de um vídeo. O estúdio no Rio de Janeiro tem duas torres com cinco andares cada uma, totalizando 2 mil metros quadrados. Além de ser sócio-proprietário, Luccas trabalha como ator, diretor e roteirista de todos os conteúdos audiovisuais produzidos. “Antes, eu era youtuber. Hoje, tenho uma empresa de entretenimento.” Mais uma prova disso são as plataformas nas quais a empresa passou a marcar presença: a Lunes produziu oito filmes para a Netflix, criou um boneco que vendeu mais de 1 milhão de unidades, vendeu mais de 2 milhões de livros e lançou o aplicativo Luccas Toon, que teve mais de 2 milhões de downloads, além de criar mais e mais projetos, entre shows, campanhas publicitárias, jogos, animações e ações sociais. Para o futuro, o plano é internacionalizar a marca e ampliar o público-alvo, “para as crianças crescerem e continuarem consumindo os produtos da empresa”, afirma Luccas. “Sabe o legado que Didi e Xuxa criaram? Queremos fazer o mesmo.” WEB (INCLUI E-SPORTS) PEQUENA LO, 24 Lorrane Silva, conhecida como Pequena Lo, surfou a onda do TikTok e alcançou o status de uma das maiores criadoras de conteúdo da plataforma. A mineira publica mais de dois vídeos por dia, trazendo cenas cômicas do cotidiano. Psicóloga por formação, sua trajetória na internet começou em 2015, quando ela publicou seus primeiros vídeos no YouTube falando sobre suas vivências como pessoa com deficiência. Criou seu perfil no TikTok no início de 2020 e, desde então, atraiu mais de 3 milhões de seguidores. Isso colaborou para que ela fosse elencada como garota-propaganda da rede social no Brasil, além de marcas como Samsung, iFood e Globoplay. Lorrane ama dançar e participou, em 2016, da cerimônia de abertura das Paraolimpíada no Rio de Janeiro. Sua carreira é gerenciada pelo também Under 30 Felipe Didonih. WEB (INCLUI E-SPORTS) PEDRO PACIFICO, 28 Advogado por formação, Pedro descobriu sua verdadeira paixão na leitura. Ele é o idealizador do podcast “Daria um Livro” e do canal BookSter, um dos maiores perfis brasileiros do Instagram dedicado à literatura, com mais de 278 mil seguidores. Durante a quarentena, realizou uma série de lives com personalidades, como Christian Dunker, Mario Sergio Cortella e Lilia Schwarcz. Em 2019, foi convidado para falar em um TEDx sobre como tornar a leitura um hábito diário. WEB (INCLUI E-SPORTS) FLÁVIO LUZ, 30 Foi cursando Estatística pela Universidade Federal do Paraná que Flávio começou a atuar no backend do universo digital. Consultor e estrategista de audiência, o mineiro desenvolveu um método estatístico – guardado a sete chaves – para potencializar perfis nas redes sociais, por meio da aplicação de algoritmos. Nomes consolidados de influenciadores e celebridades, como Bianca Andrade, Kéfera, Viih Tube e Ronaldo Fenômeno, confiaram sua reputação digital a seu recurso secreto. WEB (INCLUI E-SPORTS) CAMILLA DE LUCAS, 26 A carioca se tornou uma sensação na internet durante a pandemia graças, principalmente, à febre do TikTok no país. Natural de Nova Iguaçu, Camilla conquistou seu espaço na mídia com vídeos de comédia que vão desde esquetes cômicassobre situações do dia a dia até dublagens de séries como “Todo Mundo Odeia o Chris”. Ela começou no universo digital em 2017, quando compartilhava dicas de cuidados para cabelos crespos no YouTube. Com a quarentena, enxergou no TikTok uma nova maneira de fazer vídeos – e multiplicou seus números. Camilla conquistou mais de 7 milhões de seguidores nas redes sociais e suas publicações atingiram mais de 8 milhões de visualizações. Além de despertar a atenção de famosos, como Taís Araújo e Regina Casé, tornou-se um nome recorrente para publiposts das marcas O Boticário, Netflix, Nestlé, Skol, entre outras. WEB (INCLUI E-SPORTS) GKAY, 28 Do município de Solânea (PB) para o mundo digital: Gessica Kayane, ou simplesmente GKay. Antes de atingir mais de 10 milhões de seguidores no Instagram, a humorista trabalhou como vendedora, recepcionista e entregadora de panfletos. Lançou-se na internet em 2013 com vlogs de humor e obteve rapidamente sucesso regional, posteriormente alavancado ao nível nacional. Um de seus projetos mais notórios é a Farofa da GKay, festa realizada desde 2017 exclusivamente para influenciadores. Após a edição de 2019, a produtora de conteúdo alcançou a marca de 1 bilhão de impressões no Instagram, sendo a primeira brasileira a realizar tal feito na plataforma. Outro trabalho que chama atenção é seu papel na série “Os Roni”, do Multishow. Em 2020, tirou as ideias do papel e gravou um filme para a Netflix (com previsão de lançamento para 2021), realizando o sonho de atuar no cinema. ARTES DRAMÁTICAS (CINEMA, TEATRO E TELEVISÃO) JÉSSICA ELLEN, 28 Foi em uma peça encenada junto a um projeto social que Jéssica Ellen percebeu que gostava da experiência de ser outra pessoa – e que gostaria de fazer isso mais vezes. Estudou artes cênicas, canto e dança. Por ironia do destino, seu papel de maior destaque está sendo Camila, da novela “Amor de Mãe”, da Globo, uma jovem com quem tem tanto em comum. Assim como sua personagem, Jéssica foi a primeira da família a entrar na faculdade. “Recebi muitas mensagens de pessoas que se sentiram representadas. Ela fala diretamente com as pessoas porque é real. Se você não é a Camila, você conhece uma Camila.” Jéssica não conseguiu concluir o curso por “questões burocráticas”, mas a pedra no meio do caminho de um grande sonho se tornou oportunidade. Após a sugestão de uma amiga, fez um teste de elenco para a Globo. Semanas depois, recebeu a resposta positiva de que faria parte de “Malhação”. E não parou mais: fez “Geração Brasil”, “Santo Forte” (primeira série brasileira do canal AXN), “Totalmente Demais”, “Justiça”, “Filhos da Pátria” e “Assédio”. Nos palcos, depois de muitos testes que não deram certo, foi convidada para ser a protagonista de “Meu Destino É Ser Star”, musical inspirado nos hits de Lulu Santos. Nas telonas, ganhou espaço em “Três Verões”, lançado nas plataformas por causa do fechamento dos cinemas durante a pandemia. Jéssica relembra a importância do seu ofício na quarentena: “Espero que as pessoas entendam a função da arte. É fundamental para o nosso senso crítico. Desejo que seja respeitada e valorizada como já foi. Para 2021, desejo muita saúde e arte”. * TEXTOS AMANDA TUCCI, ANGELICA MARI, DÉCIO GALINA, GABRIELA ARBEX, GIULIANNA IODICE, HELENA ARNONI, JULIANA VENTURA, MATTHEUS GOTO, REBECCA SILVA, SOLANGE GUIMARÃESFOTOS ANDREA MARQUES E VICTOR AFFAROARTE ZÉ RENATO MAIA, ROGÉRIO MAROJA, BRUNO EIDEDIÇÃO JOSÉ VICENTE BERNARDO A ELABORAÇÃO DA LISTA FORBES UNDER 30 2020 CONTOU COM A AJUDA DOS SEGUINTES ESPECIALISTAS, A QUEM AGRADECEMOS:ANA FONTES (REDE MULHER EMPREENDEDORA), ARNALDO RIBEIRO (SPORTV), CAMILA FARANI (G2 CAPITAL), CAMILA YUNES GUARITA (KURA ARTE), CAROLINA DA COSTA (MAUÁ CAPITAL E INSPER), CHICO TATTINI (INTZ), CRIS NAUMOVS (APEGO), EMILIO FRAIA (COMPANHIA DAS LETRAS), FERNANDO GAVINI (OTD), FLAVIO PRIPAS (REDPOINT), GIOVANA PINHEIRO (OTD), KATIA RUBIO (USP), MAITÊ LOURENÇO (BLACK ROCKS STARTUPS), MARCIO KOGAN (STUDIO MK27), PIERRE LUCENA (PORTO DIGITAL), RICARDO DIAS (ADVENTURES), RONALDO BRESSANE (ESCRITOR) E ROSENILDO FERREIRA (VALE DO DENDÊ). Reportagem publicada na edição 83, lançada em dezembro de 2020 Siga FORBES Brasil nas redes sociais: FacebookTwitterInstagramYouTubeLinkedIn Siga Forbes Money no Telegram e tenha acesso a notícias do mercado financeiro em primeira mão Baixe o app da Forbes Brasil na Play Store e na App Store. Tenha também a Forbes no Google Notícias.  © Forbes 2023. Todos os direitos reservados.", "url": "https://forbes.com.br/listas/2021/02/under-30-2020-90-destaques-brasileiros-abaixo-dos-30-anos/", "threshold": 1.0}