{"title": "IBM100 - The IBM 700 Series", "content": "In 1954, Ronald Reagan, who was a TV personality for General Electric at the time, visited the GE Aircraft Jet Engine Plant in Evendale, Ohio. During this visit, GE manager Herbert Grosch spent a few minutes introducing the future US president to the IBM 701. 1957, Max Mathews of Bell Labs wrote a program called MUSIC for the IBM 704. One of the first computer sound-generating programs. 1962, physicist John L. Kelly Jr., also of Bell Labs, used an IBM 704 computer to synthesize speech, recreating the song Daisy Bell with musical accompaniment from Max. The IBM 700 series made scientific calculations and commercial operations easier, but the machines also provided the world with some entertainment. On February 24, 1956, Arthur Samuel’s Checkers program, which was developed for play on the IBM 701, was demonstrated to the public on television. In 1962, self-proclaimed checkers master Robert Nealey played the game on an IBM 7094 computer. The computer won. Other games resulted in losses for the Samuel Checkers program, but it is still considered a milestone for artificial intelligence, and offered the public in the early 1960s an example of the capabilities of an electronic computer. IBM paired with Georgetown University language scholars in 1952 to develop translation software for use on computers. On January 7, 1954, they demonstrated an experimental software program that enabled the IBM 701 computer to translate from Russian to English. In 1959, the Mark 1 Translating Device, which was developed for the US Air Force, produced its first automated Russian-to-English translation. The Mark 1 was demonstrated for the public at the IBM Pavilion at the New York World’s Fair in 1964. University of Alberta Department of Computing Science GAMES Group In 1954, a team of scientists ran millions of simulated hands of blackjack on an IBM 701 in an attempt to determine the best playing decision for every combination of cards. The result of this study was one set of correct rules for hitting, standing, doubling or splitting in a blackjack game. These rules are still the same today.", "url": "https://www.ibm.com/ibm/history/ibm100/us/en/icons/ibm700series/impacts/", "threshold": -0.6586269520471839}