{"title": "Supervised vs. Unsupervised Learning: What’s the Difference? | IBM", "content": " 12 March  2021 5 min read By:  Julianna Delua, SME, IBM Analytics, Data Science/Machine Learning Share this page on TwitterShare this page on FacebookShare this page on LinkedInE-mail this page The world is getting “smarter” every day, and to keep up with consumer expectations, companies are increasingly using machine learning algorithms to make things easier. You can see them in use in end-user devices (through face recognition for unlocking smartphones) or for detecting credit card fraud (like triggering alerts for unusual purchases). Within artificial intelligence (AI) and machine learning, there are two basic approaches: supervised learning and unsupervised learning. The main difference is one uses labeled data to help predict outcomes, while the other does not. However, there are some nuances between the two approaches, and key areas in which one outperforms the other. This post will clarify the differences so you can choose the best approach for your situation. Supervised learning is a machine learning approach that’s defined by its use of labeled datasets. These datasets are designed to train or “supervise” algorithms into classifying data or predicting outcomes accurately. Using labeled inputs and outputs, the model can measure its accuracy and learn over time. Supervised learning can be separated into two types of problems when data mining: classification and regression: Unsupervised learning uses machine learning algorithms to analyze and cluster unlabeled data sets. These algorithms discover hidden patterns in data without the need for human intervention (hence, they are “unsupervised”). Unsupervised learning models are used for three main tasks: clustering, association and dimensionality reduction: The main distinction between the two approaches is the use of labeled datasets. To put it simply, supervised learning uses labeled input and output data, while an unsupervised learning algorithm does not. In supervised learning, the algorithm “learns” from the training dataset by iteratively making predictions on the data and adjusting for the correct answer. While supervised learning models tend to be more accurate than unsupervised learning models, they require upfront human intervention to label the data appropriately. For example, a supervised learning model can predict how long your commute will be based on the time of day, weather conditions and so on. But first, you’ll have to train it to know that rainy weather extends the driving time. Unsupervised learning models, in contrast, work on their own to discover the inherent structure of unlabeled data. Note that they still require some human intervention for validating output variables. For example, an unsupervised learning model can identify that online shoppers often purchase groups of products at the same time. However, a data analyst would need to validate that it makes sense for a recommendation engine to group baby clothes with an order of diapers, applesauce and sippy cups. Choosing the right approach for your situation depends on how your data scientists assess the structure and volume of your data, as well as the use case. To make your decision, be sure to do the following: Classifying big data can be a real challenge in supervised learning, but the results are highly accurate and trustworthy. In contrast, unsupervised learning can handle large volumes of data in real time. But, there’s a lack of transparency into how data is clustered and a higher risk of inaccurate results. This is where semi-supervised learning comes in. Can’t decide on whether to use supervised or unsupervised learning? Semi-supervised learning is a happy medium, where you use a training dataset with both labeled and unlabeled data. It’s particularly useful when it’s difficult to extract relevant features from data — and when you have a high volume of data. Semi-supervised learning is ideal for medical images, where a small amount of training data can lead to a significant improvement in accuracy. For example, a radiologist can label a small subset of CT scans for tumors or diseases so the machine can more accurately predict which patients might require more medical attention. Machine learning models are a powerful way to gain the data insights that improve our world. To learn more about the specific algorithms used with supervised and unsupervised learning, we encourage you to delve into the Learn Hub articles on these techniques. We also recommend checking out the blog post that goes a step further, with a detailed look at deep learning and neural networks. To learn more about how to build machine learning models, explore the free tutorials on the IBM Developer Hub. The Data Differentiator: Learn how to weave a single technology concept into a holistic data strategy that drives business value. SME, IBM Analytics, Data Science/Machine Learning Be the first to hear about news, product updates, and innovation from IBM Cloud.             Artificial intelligence           By:Shannon Cardwell         10 May  2023       icons             Artificial intelligence           By:Udi Barzelay, Tal Drory, Andrew Cabral, and Calin Furau         21 April  2023       icons             Artificial intelligence           By:IBM Cloud Team         20 April  2023       icons             Be the first to hear about news, product updates, and innovation from IBM Cloud           Get updates to your inbox.", "url": "https://www.ibm.com/cloud/blog/supervised-vs-unsupervised-learning", "threshold": -0.8156687328747565}