{"title": "What is Supervised Learning?  | IBM", "content": "Supervised learning, also known as supervised machine learning, is a subcategory of machine learning and artificial intelligence. It is defined by its use of labeled datasets to train algorithms that to classify data or predict outcomes accurately. As input data is fed into the model, it adjusts its weights until the model has been fitted appropriately, which occurs as part of the cross validation process. Supervised learning helps organizations solve for a variety of real-world problems at scale, such as classifying spam in a separate folder from your inbox. Train, validate, tune and deploy foundation and machine learning models, with ease Watson Studio SPSS Statistics Supervised learning uses a training set to teach models to yield the desired output. This training dataset includes inputs and correct outputs, which allow the model to learn over time. The algorithm measures its accuracy through the loss function, adjusting until the error has been sufficiently minimized. Supervised learning can be separated into two types of problems when data mining—classification and regression: Various algorithms and computations techniques are used in supervised machine learning processes. Below are brief explanations of some of the most commonly used learning methods, typically calculated through use of programs like R or Python:   Unsupervised machine learning and supervised machine learning are frequently discussed together. Unlike supervised learning, unsupervised learning uses unlabeled data. From that data, it discovers patterns that help solve for clustering or association problems. This is particularly useful when subject matter experts are unsure of common properties within a data set. Common clustering algorithms are hierarchical, k-means, and Gaussian mixture models. Semi-supervised learning occurs when only part of the given input data has been labeled. Unsupervised and semi-supervised learning can be more appealing alternatives as it can be time-consuming and costly to rely on domain expertise to label data appropriately for supervised learning. For a deep dive into the differences between these approaches, check out \"Supervised vs. Unsupervised Learning: What's the Difference?\" Supervised learning models can be used to build and advance a number of business applications, including the following: Although supervised learning can offer businesses advantages, such as deep data insights and improved automation, there are some challenges when building sustainable supervised learning models. The following are some of these challenges: Build and scale trusted AI on any cloud. Automate the AI lifecycle for ModelOps.  Connect the right data, at the right time, to the right people anywhere.  Hybrid. Open. Resilient. Your platform and partner for digital transformation.  In this article, we’ll explore the basics of two data science approaches: supervised and unsupervised.  Explore some supervised learning approaches such as support vector machines and probabilistic classifiers Supervised learning models can be a valuable solution for eliminating manual classification work and for making future predictions based on labeled data. However, formatting your machine learning algorithms requires human knowledge and expertise to avoid overfitting data models. IBM and its data science and AI teams have spent years perfecting the development and deployment of supervised learning models with numerous business use cases. With the help of powerful tools such as IBM Watson Studio on IBM Cloud Pak for Data, organizations can create highly scalable machine learning models regardless of where their data lives, all while being supported by IBM's robust hybrid multicloud environment. ", "url": "https://www.ibm.com/topics/supervised-learning", "threshold": -0.9819231176261886}