{"title": "Alphabet’s Intrinsic launches Flowstate, a robotic app development platform | TechCrunch", "content": "The hottest corner of the robotic space right now isn’t the robots themselves. Those companies have done an excellent job getting their systems out into places like warehouses and factories, but the broader question of actually managing and programming them is a bit fuzzier. Proprietary software for these robotics systems is generally difficult to develop for and won’t work with third-party systems. When it was announced back in 2021, Alphabet X graduate Intrinsic offered the following insight into its plans: Over the last few years, our team has been exploring how to give industrial robots the ability to sense, learn, and automatically make adjustments as they’re completing tasks, so they work in a wider range of settings and applications. Working in collaboration with teams across Alphabet, and with our partners in real-world manufacturing settings, we’ve been testing software that uses techniques like automated perception, deep learning, reinforcement learning, motion planning, simulation, and force control. This morning, the company announced its first product, Flowstate, a development platform designed to deliver on some of those promises. The software is designed to help non-roboticists develop workflows for these hardware systems. “Our first product is a solution builder,” CEO Wendy Tan White tells TechCrunch. “With Intrisic Flowstate, what we’re saying is: you can design it, build it and deploy it. We’re very aware the world is still early in the skills available. They can be put together in this workflow that we’re offering. We’re also going to allow [third-party] skills to be available, too. We want the broader ecosystem to start to be involved. One of the advantages of coming out of Alphabet is some of the more sophisticated skills like vision and force feedback where you require some machine learning or even deep reinforcement learning. We’ve been able to create some of those skills as well. What you’ll find in flow state is not just the solution builder itself, but a library of skills, some of which don’t exist or are not easy to access today.” At the core of the system is a graphical tree that allows users to string together more complex workflows. Existing skills include pose estimation, manipulation, force-based insertion and path planning. The platform will also be opened to third-party developers who can design their own skills to be integrated into flows. Image Credits: Intrinsic Image Credits: Intrinsic The other big piece of this is simulation. It’s the key most robotics deployments these days, affording users the ability to run scenarios simultaneously in a virtual world to determine real-world outcomes. The platform uses Gazebo, an open-source platform stewarded by Open Robotics, which also managed the robotic operating system, ROS. The connected for-profit arm, Open Source Robotics Corporation, was acquired by Intrinsic last December. “What we’ve done with the acquisition is the core engineering team that used to work under OSRF (Open Source Robotics Foundation) is now working at Intrinsic,” says Brian Gerkey, the Open Robotics CEO who now serves as the director of Open Robotics at Intrinsic. “You should think of Intrinsic as perhaps one of the more important, but really just one player within the ROS ecosystem. We happen to employ a bunch of engineers and we’ve committed to supporting them to develop and contribute back to the ROS community.” The news follows a massive round of layoffs felt across Alphabet, including Every Day Robotics. “The EDR (Every Day Robotics) team has moved in with what became (Google) Brain,” she explains. “That product has merged with Google Deep Mind. We were working a lot with DeepMind already. The fully integrated Google DeepMind team fully intends to help us build more skills, including ones that would have been used with EDR potentially.” Tan White says that in spite of a 40-person reduction of Intrinsic’s workforce, the company wasn’t majorly impacted by layoffs. Rather, she explains, the shakeups were part of a small pivot within the company. “We made some specific layoffs,” she says. “We graduated and we’ve actually made a couple of acquisitions. We were getting clear on what this project was. There were a couple of projects that were more hardware based, and we made a choice to not focus on that. That’s what the layoffs were actually about. It was to focus on the software and the AI part of what we’re doing and that first product. I think what confused the external world at that time is we were obviously doing the acquisition with Open Robotics. They were related in the sense that we’ve decided we want to be software focused, which is where Open Robotics fit in really well.” The company also acquired Vicarious in April of last year. Tan White says around 80% of that team is currently still working for Intrinsic. “Their expertise in certain applications has been critical,” she adds. “Some of the applications you’re going to see in the skills we have are based on the Vicarious Code.” Flowstate is now available as a beta. Intrinsic says it had more than 100 signups in the first hour of going live.", "url": "https://techcrunch.com/2023/05/15/alphabets-intrinsic-launches-flowstate-a-robotic-app-development-platform/", "threshold": 0.9829636976811522}