{"title": "The best Bluetooth trackers for 2023 | Engadget", "content": "If you’ve ever been derailed from an on-time departure by a set of lost keys or misplaced wallet, you’ll benefit from a Bluetooth tracker. These small gadgets attach to your stuff and use your smartphone to keep tabs on where they are. There aren’t a ton of players in the field yet, but we tested out some of the most popular options to see what each tracker does well so you can decide which is the best Bluetooth tracker for you.                        Quick Overview                    Best OverallChipolo One $25                        $25 at Amazon                                    $25 at Amazon            Best for iPhonesApple AirTag$29                        $29 at Amazon                                     $29 at Amazon             Best for AndroidTile Pro $35                        $35 at Amazon                                    $35 at Amazon            Best wallet trackerTile Slim $28                        $28 at Amazon                                    $28 at Amazon             Bluetooth trackers are small discs or cards that rely on short-range, low-energy wireless signals to communicate with your smartphone. Attach one to your stuff and, if it’s in range, your phone can “ring” the chip so you can find it. These tracking devices offer other features like separation alerts to tell you when you’ve left a tagged item behind, or where a lost item was last detected. Some can even tap into a larger network of smartphones to track down your device when you’re out of range. Depending on what you want the tracker to do, there are a few specs to look for when deciding which to get. Like most things from the folks in Cupertino, AirTags only work with other Apple products. The company has opened up access to its Find My network to third-party manufacturers, including Chipolo, though. Its One Spot and Card Spot finders work with Apple's large tracking network, but only pair with Apple devices. Chipolo’s classic trackers will work with either Android or Apple devices, as will Tile trackers. Crowd-sourced finding capabilities are what make headlines, with stories about recovering stolen equipment or tracking lost luggage across the globe. Using anonymous signals that ping other people’s devices, these trackers can potentially tell you where a tagged item is, even if your smartphone is out of Bluetooth range. Apple’s Find My network is by far the largest, with over a billion iPhones in service all running Apple’s Find My app by default. So unless an iPhone user opts out, their phone silently acts as a location detector for any nearby AirTags. While Android phones outnumber iPhones globally, they don’t have a similar, unified “find-my”network. (Though, reports that Google may be working on AirTag rival means such a system may be coming.) In the meantime, Tile offers the second-largest finding grid, with every smartphone that runs the Tile app acting as incognito locators. After Life360 acquired Tile, the 47 million users of that app were added to the 50 million existing Tile users, creating a sizable network. In our tests, AirTags offered nearly real-time location data and were quickest to find items abandoned in spots around Albuquerque, including a bar, bookstore and coffee shop in Nob Hill, along with various outdoor hangouts on UNM’s campus. Tile trackers were able to locate our lost items most of the time, though not with the same pin-point accuracy as AirTags. Chipolo’s Spot trackers operate on the same Find My network and perform on par with the AirTags. Chipolo’s classic trackers, on the other hand, don’t have much of a crowd-sourced network to speak of. Yet as we used the trackers, the size of the finding network started to feel less important in the face of typical, everyday use cases. It was their ability to out-perform in every other way that boosted Chipolo’s classic trackers to the top of our list. Here’s where a tracker’s day-to-day utility really shines. A separation alert lets you know when you’ve traveled too far from your tagged items, which is useful if you want to make sure your laptop bag, or jacket or umbrella always comes with you when you leave the house. These notifications work when you’re out and about too. If you’ve got a tracker in your wallet and walk out of a restaurant without it, the separation alert should kick in, resulting in fewer lost items. This feature also tells you where your tagged item and phone were last paired, allowing you to retrace your steps if you happen to miss the alert. Each tracker handles left-behind items differently. Both AirTags and Chipolo include the feature by default. Tile trackers require a yearly subscription to enable the alerts (currently $30 per year). Both AirTags and Tiles allow you to turn off separation alerts at certain locations, meaning you can set your home as a “safe” place where items can be left behind, but alerts will still trigger elsewhere. Chipolo doesn’t offer safe locations, but you can toggle out-of-range alerts on a per-item basis. In our tests, the Chipolo sent an alert after we got between 250 and 450 feet away from our tagged item. AirTags alerted us between the 600- and 1,400-foot mark. And Tiles sent a notification after about an average of 1,500 feet. The notifications were not consistent on an iPhone, but worked well when operating with an Android phone. The feature you may use most often is the simple “find my keys” function. If you have your phone, but no idea where your tagged keys are, you can tap a button in the tracker’s app to make the tracker ring. The ability to consistently and quickly connect with your phone is important for making it out the door with less stress. Tile and Chipolo classic trackers will also let you double click the device itself to make your phone ring, but AirTags and Chipolos running on the Find My app don’t offer this feature. The volume of the tracker may determine whether you can find an item buried in your couch cushions or in a noisy room. AirTags have a reputation for being on the quiet side, and that aligned with what we saw (measuring roughly 65 decibels). Chipolo’s keychain-style tags, both the Apple-only version and the device-agnostic version, and the Tile Slim wallet tracker were the loudest, measuring between 83 and 85 decibels. Design will determine what you can attach the tracker to. AirTags are small, smooth discs that have no way of securing to anything without accessories, which are numerous, but that is an additional cost to consider. Both Chipolo and Tile offer trackers with holes that easily attach to your key ring, and both companies also offer card-shaped versions designed to fit in your wallet. Batteries are replaceable for AirTags, Chipolo One and Tile Pro. Tile Mate and all card-shaped trackers don’t have replaceable batteries, which means you’ll have to replace the entire unit whenever it dies. AirTags have recently gotten a lot of attention for bad actors planting them on people in order to stalk them. While this fact may not influence your buying decision, any discussion of Bluetooth trackers should note what steps both Apple and Tile have taken to address the issue. If an AirTag is detected moving with you and apart from its owner, the device will ring to alert you of its presence. If you have an iPhone, as long as you have location services and Bluetooth turned on, you’ll automatically get an alert on your phone, with no further steps required. If you have an Android, you can download a special app that can detect unknown AirTags. Tile offers a similar feature through its standard app, and it doesn’t require a Tile account to search for suspicious nearby trackers. Recently, Tile launched a feature called Anti-Theft Mode, which enables you to render one of its trackers undetectable by others. That means if someone steals your tagged item, they won’t be able to use the anti-stalking features to find its precise location and disable the tracker. Of course, that potentially makes a Tile easier to use as a stalking device, so in order to enable the feature, you have to verify your ID and agree to a $1 million penalty for misuse. In general, a Bluetooth tracker may or may not be the best option for combating theft. Anecdotal stories abound in which people have recovered stolen goods using a tracker — but other tales are more cautionary. Apple still doesn’t promote its trackers or finding networks as a way to deal with theft. GPS trackers, on the other hand, are typically marketed for just that purpose. Before deciding on which trackers to test, we researched the field, looking at user reviews on Amazon, Best Buy and other retailers, along with discussions on sites like Reddit. We also checked out what other publications had to say on the matter before narrowing down our picks to Apple AirTag, Tile and Chipolo trackers. Here’s the full list of every tracker we tested: Apple AirTag Tile Mate Tile Pro Tile Slim Chipolo Card Spot Chipolo One Spot Chipolo One Chipolo Card After acquiring the trackers, I tested each one over the course of a few weeks using both an iPhone 11 and a Samsung Galaxy S22 Ultra. I recreated likely user experiences, such as losing and leaving items behind at home and out in the city. I planted trackers at different spots near downtown Albuquerque, mostly concentrated in and around the University of New Mexico and the surrounding neighborhood of Nob Hill. Each test was performed multiple times, both while walking and driving and I used the measure distance feature on Google Maps to track footage for alerts. I paid attention to how easy the app was to use, how reliable the phone-to-tracker connection was and any other perks and drawbacks that came up during regular use. Best OverallChipoloChipolo One Compatible with both iPhone and Android devices, the Chipolo One was the loudest tracker we tried and had the most reliable alerts and quickest nearby detection abilities.                     $25 at Amazon                                        $25 at Chipolo                 Compatible with both iPhone and Android devices, the Chipolo One was the loudest tracker we tried and had the most reliable alerts and quickest nearby detection abilities.  Hands-on testing is great at smashing assumptions, and that’s what happened with the Chipolo One. This tracker’s crowd-sourced finding network cannot compare with Apple’s AirTag or Tile. In fact, when I left the Chipolo for 24 hours just outside the busy student union at UNM, I was never alerted that a member of the Chipolo community had detected my item. But as I used it and pictured how most people would use a tracker on a daily basis, the device proved its worth and earned its spot on my keyring. The One is a small and colorful plastic disc with a hole. It works with both Apple and Android devices and requires an app which is simple to use and easily pairs new trackers. The app and tracking experience on an iPhone and a Galaxy phone were nearly identical, working equally well on both platforms. It rang the loudest of all the trackers, so lost items were quickly found around the house. Unlike other trackers, there was never a delay between pressing the Ring to Find button and hearing the trill. The ring delay for AirTag was never more than a few seconds and Tiles would generally connect and ring after no more than ten seconds. While that’s not a deal-breaking delay, it could add to the stress of rushing out the door. Where the Chipolo One truly set itself apart was with its separation alerts. I would only get a half to two blocks away (or an average of 350 feet) before getting an alert asking if I’d forgotten an item. Neither AirTag nor Tile ever beat Chipolo to the punch. The alerts were consistent whether I was forgetting an item at home, at a coffee shop, or inside my car. As far as losing stuff out in the wild, it will get you back to the spot where your phone and tracker were last paired. That means if you miss an alert or don’t have them turned on, Chipolo will give you directions (via your maps app) and take you right to where you left your item. In one test, I had a friend hide the tracker nearby when I wasn't looking. I left the area and returned hours later, using the last location information to lead me within a few feet of the tracker’s precise location. Ringing the tracker then made it easy to find. Of course, if someone walks off with your tracked item, the Chipolo will be harder pressed to help you out. If you’re concerned about lost luggage when you travel or if you worry you may lose things on trains or buses, this isn’t the tracker for you because of its much smaller finding network. But if you’re looking for a dead simple way to find your keys and make sure your jacket leaves the bar when you do, the Chipolo One is hard to beat. Best for iPhonesPhoto by Valentina Palladino / EngadgetApple AirTagWith the widest finding network we tried, Apple's AirTags excel at tapping into the community to find lost items.                    $29 at Amazon                                         $29 at Apple                 With the widest finding network we tried, Apple's AirTags excel at tapping into the community to find lost items. AirTags work with the Find My app, so they don’t require any additional downloads. If you’ve used the Find My app before, you’ll likely understand how this works. These are the quietest of the trackers we tested and each time you press the Play Sound button, the tags only ring for seven seconds. You’ll need to keep pressing if you don’t find your item right away and AirTags can’t be used to ring your phone. As for separation alerts, AirTags were consistent, always delivering a “left behind” alert when I traveled about 1,200 feet away, or about three square blocks, without an item. You can turn off separation alerts for any given tracker, as well as designate certain locations, such as your home or workplace, as exceptions for the notifications. One feature that AirTags have that no other tag offers is the ability to tap into the ultra-wideband (UWB) wireless protocol. This allows you to play a fun game of hot and cold with an item when it’s within about 25 feet of your iPhone. Directional arrows and a diminishing distance meter on your iPhone’s screen point you to an item without having to ring it. This worked reliably about 75 percent of the time in my tests; sometimes it was just easier to ring the item when the directional finding couldn’t keep a lock on the tracker. UWB is supported by iPhone models 11 and later and while newer Galaxy and Pixel phones also support UWB, no Android-compatible tracker has been released, though, Tile has announced one that will. AirTag’s ability to locate a lost item out in the city is almost eerie. I had someone (who was not carrying an iPhone) take my bike with a tracker hidden under the seat to a location a little over a half mile away. I set out a few minutes later and toggled on Notify When Found in the Find My app. Within three minutes, I received a notification that the bike had been “seen” near an address. Tapping on Directions navigates to Apple Maps, which took me to a spot about 30 feet from the bike. Had it been obscured from view, I could have then used the Find Nearby button to activate the UWB locating features. Ringing the tag was too quiet to hear on the sidewalk. If you want the same scary-precise community finding features, but with a louder ring and a hole in the tracker, the Chipolo One Spot is a solid option. It doesn’t offer UWB capabilities, however, and the separation alerts are the same as with AirTags (letting you get 1,200 feet away before a ping, versus an average of 350 feet with our top rec, Chipolo One classic). Best for AndroidTileTile Pro Tile has the second-best finding network and Tile Pro offers a replaceable battery.                     $35 at Amazon                 Tile has the second-best finding network and Tile Pro offers a replaceable battery.  Tile will work with either Android or Apple devices, but the experience is much better on Android. Certain connectivity issues and a lack of alerts that plagued the iPhone experience did not show up in tests with the Galaxy phone. One caveat to note is that Tile requires a subscription to enable separation alerts. Tile Premium goes for $3 per month or $30 per year and includes location history and item reimbursement of up to $100 on items that you register with the company, they’ll also send out a fresh battery once a year. Tile stands out as the only tracker company offering reimbursement — even without a subscription, they’ll pay out up to $25 for items that you register with them. The Tile Pro is a key-fob shaped device with a metal keychain hole that feels sturdy. The Pro’s ring was just a few decibels quieter than the Tile Mate (78 versus 82 decibels), but the connectivity range was better with the Pro, and it was more accurate in finder network tests. On top of that, this is the only current Tile device with a replaceable battery, which lasts about one year. For the lost-item tests, I had a friend take the Pro to random locations. After turning on the Notify When Found feature, an alert would arrive between five and ten minutes later saying my lost item was “found by the community.” The map details were typically accurate within about 100 feet or so, though it occasionally thought the Tile was at a business next door to where it actually was. Without the UWB feature, precision finding of an item was trickier. In one test, the tracker ended up in a noisy pub. While the directions pointed me to the right location, it would have been difficult to find the item if I hadn’t spotted my friend, as the ring function was useless among the din. Best wallet trackerTileTile Slim The slim design and loud ring will help you keep tabs on your wallet.                     $28 at Amazon                 The slim design and loud ring will help you keep tabs on your wallet.  The Tile Slim is louder than both the Pro and the Mate, and nearly equals the loudest tracker we tested, the Chipolo One. It works with both Android and Apple devices and its thick credit card shape fits in the slots of a typical wallet (though it often won’t connect when inside an RFID-blocking wallet). The separation alerts you’ll get if you pay for a Tile subscription activate at about the same distance as the Tile Pro, letting you get around 1,500 feet away before pinging you about a left-behind item. When using an iPhone with Tile trackers, separation alerts rarely came and connectivity between the phone and tracker was spotty at best, even in close proximity. If you use an iPhone, the Chipolo Card Spot is equally loud, runs on Apple’s vast Find My network and consistently gives you a left-behind alert at around 1,200 feet.", "url": "https://www.engadget.com/best-bluetooth-tracker-140028377.html", "threshold": 0.9999999996537361}