{"title": "The best gaming laptops for 2023 | Engadget", "content": "For a few years now, gaming laptops have been some of the most intriguing PCs around. They’ve gotten thinner and lighter, naturally — but they’ve also become vastly more powerful and efficient, making them suitable for both work and play. They’ve adopted some bold innovations, like rotating hinges and near desktop-like customizability. Gaming laptops are where PC makers can get adventurous.                        Quick Overview                    Best overallASUS ROG Zephyrus G14$1,600                        $1,600 at Amazon                                    $1,600 at Amazon            Best budgetDell G15 5520 Gaming Laptop$784                        $784 at Amazon                                    $784 at Amazon            Best premium gaming laptopRazer Blade 15 Gaming Laptop$2,300                        $2,300 at Amazon                                    $2,300 at Amazon            Another good optionAcer Predator Triton 500 SE Gaming Laptop$3,367                        $3,367 at Amazon                                    $3,367 at Amazon            Best large gaming laptopAlienware m18$2,000                        $2,000 at Dell                                    $2,000 at Dell            Best with a dual screenASUS ROG Zephyrus Duo 16 (2022)$2,799                        $2,799 at Amazon                                    $2,799 at Amazon            See 1 more If you’re a professional in the market for a beefy new computer, and you like to play a few rounds of Apex Legends on occasion, it may make more sense to go for a gaming notebook instead of a MacBook Pro-like workstation. You’ll still get plenty of power for video encoding and 3D rendering, plus you may end up paying less. We'll help you figure out which is the best gaming laptop for you, from budget options like the Dell G15 to premium notebooks like the Razer Blade 15 and everything in between. Your laptop buying journey starts and ends with the amount of money you're willing to spend. No surprise there. The good news: There are plenty of options for gamers of every budget. In particular, we're seeing some great entry-level PC gaming choices under $1,000, like Dell's G15 lineup. A cheap gaming laptop in this price range will definitely feel a bit flimsier than pricier models, and they'll likely skimp on RAM, storage and overall power. But they should be able to handle most games in 1080p at 60 frames per second, which is the bare minimum you'd want from any system. Things get interesting when you start looking at the best gaming laptops in the mid-range space, with prices at $1,000 and higher. At that point, you'll start finding PCs like the ASUS Zephyrus ROG G14, one of our favorite gaming notebooks. In general, you can look forward to far better build quality than budget laptops (metal cases!), improved graphics power and enough RAM and storage space to handle the most demanding games. These are the gaming machines we'd recommend for most people, as they'll keep you gaming and working for years before you need to worry about an upgrade. If you're willing to spend around $1,800 or more, you can start considering more premium options like Razer's Blade. Expect impeccably polished cases, the fastest hardware on the market, and ridiculously thin designs. The sky's the limit here: Alienware's uber customizable Area 51m is an enormous beast that can cost up to $4,700. Few people need a machine that high-end, but if you're a gamer with extra cash to burn, it may be worth taking a close look at some of these pricier systems. The answer to this question used to be relatively simple: Just get an Intel chip with an NVIDIA GPU. But over the last few years AMD has stepped up its game with its Ryzen notebook processors, which are better suited for juggling multiple tasks at once (like streaming to Twitch while blasting fools in Fortnite). Intel responded with its impressive 12th and 13th-gen chips, but it’s nice to have decent Ryzen AMD alternatives available, especially since they’re often cheaper than comparable Intel models. When it comes to video cards, though, AMD is still catching up. Its Radeon RX 6000M GPU has been a fantastic performer in notebooks like ASUS’s ROG Strix G15, but it lags behind NVIDIA when it comes to newer features like ray tracing. (We’re still waiting to test AMD’s new Radeon 7000 series mobile graphics.) At the very least, a Radeon-powered notebook can approach the general gaming performance of the NVIDIA RTX 3070 and 3080 GPUs. If you want to future-proof your purchase, or you’re just eager to see how much better ray tracing can make your games look, you’re probably better off with an NVIDIA video card. They’re in far more systems, and it’s clear that they have better optimized ray tracing technology. NVIDIA GeForce RTX GPUs also feature the company’s DLSS technology, which uses AI to upscale games to higher resolutions. That’ll let you play a game like Destiny 2 in 4K with faster frame rates. That’s useful if you’re trying to take advantage of a high refresh rate monitor. You’ll still find plenty of laptops with NVIDIA’s older RTX 30-series GPUs these days, and they’ll still give you tremendous performance. But to be safe, it’s probably worth opting for the newer RTX 40-series systems, since they support the newer DLSS 3 technology and offer a wealth of performance upgrades. (If you’re looking out for the best deals, you can probably find some killer RTX 3070 laptops out there.) The entry-level RTX 4050 is a solid start, but we’d suggest going for a 4060 or 4070 if you’re aiming to maximize your framerates on faster screens. The RTX 4080 and 4090 are both incredibly powerful, but they typically make systems far too expensive for most users. It’s worth noting that NVIDIA’s mobile GPUs aren’t directly comparable to its more powerful desktop hardware. PC makers can also tweak voltages to make gaming performance better in a thinner case. Basically, don’t be surprised if you see notebooks that perform very differently, even if they’re all equipped with the same GPU. Screen size is a good place to start when judging gaming notebooks. In general, 15-inch laptops will be the best balance of immersion and portability, while larger 17-inch models are heftier, but naturally give you more screen real estate. There are some 13-inch gaming notebooks, like the Razer Blade Stealth, but paradoxically you'll often end up paying more for those than slightly larger 15-inch options. We’re also seeing plenty of 14-inch options, like the Zephyrus G14 and Blade 14, which are generally beefier than 13-inch laptops while still being relatively portable. But these days, there is plenty to consider beyond screen size. For one: refresh rates. Most monitors refresh their screens vertically 60 times per second, or at 60Hz. That's a standard in use since black and white NTSC TVs. But over the past few years, displays have evolved considerably. Now, 120Hz 1080p screens are the bare minimum you'd want in any gaming notebook — and there are faster 144Hz, 240Hz and even 360Hz panels. All of this is in the service of one thing: making everything on your display look as smooth as possible. For games, higher refresh rates also help eliminate screen tearing and other artifacts that could get in the way of your frag fest. And for everything else, it just leads to a better viewing experience. Even scrolling a web page on a 120Hz or faster monitor is starkly different from a 60Hz screen. Instead of seeing a jittery wall of text and pictures, everything moves seamlessly, as if you're unwinding a glossy paper magazine. Going beyond 120Hz makes gameplay look even more responsive, which to some players gives them a slight advantage. Not to make things more complicated, but you should also keep an eye out for NVIDIA's G-SYNC and AMD's FreeSync. They're both adaptive sync technologies that can match your screen's refresh rate with the framerate of your game. That also helps to reduce screen tearing and make gameplay smoother. Consider them nice bonuses on top of a high refresh rate monitor; they're not necessary, but they can still offer a slight visual improvement. See Also: Best Laptops for 2023 Best Cheap Windows Laptops Best 2-in-1 Laptops for 2023 Best Chromebooks Best Laptops for College Students One more thing: Most of these suggestions are related to LCD screens, not OLEDs. While OLED makes a phenomenal choice for TVs, it's a bit more complicated when it comes to gaming laptops. They're mostly limited to 60Hz, though some models offer 90Hz. Still, you won’t see the smoothness of a 120Hz or 144Hz screen. OLEDs also typically come as 4K or 3.5K panels – you'll need a ton of GPU power to run games natively at that resolution. They look incredible, with the best black levels and contrast on the market, but we think most gamers would be better off with an LCD. Get at least 16GB of RAM. And if you're planning to do a ton of multitasking while streaming, 32GB is worth considering. Storage is still a huge concern. These days, I'd recommend aiming for a 1TB M.2 SSD, which should be enough space to juggle a few large titles like Destiny 2. (If you can afford the jump to a 2TB SSD though, just do it.)  Some laptops also have room for standard SATA drives, which are far cheaper than M.2's and can hold more data. Get your hands on a system before you buy it. I'd recommend snagging the best gaming laptop for you from a retailer with a simple return policy, like Amazon or Best Buy. If you don't like it, you can always ship it back easily. Don't forget about accessories! For the best performance, you'll need a good mouse, keyboard and headphones. Best overallASUSASUS ROG Zephyrus G14While the G14 has jumped in price since it debuted, it’s still one of the best gaming notebooks around, especially since ASUS has finally added a built-in webcam.                    $1,600 at Amazon                                        $1,650 at Best Buy                 While the G14 has jumped in price since it debuted, it’s still one of the best gaming notebooks around, especially since ASUS has finally added a built-in webcam. If you can't tell by now, we really like the Zephyrus G14. It's shockingly compact, at just 3.5 pounds, and features AMD's new Ryzen chips paired together with its Radeon 6000M graphics (we’d recommend the Ryzen 9 model with an RX 6700M for $1,400). While its 14-inch screen is a bit smaller than our other recommendations, it looks great and features a fast 144Hz refresh rate. We also like its retro-future design (some configurations have tiny LEDs on its rear panel for extra flair). While the G14 has jumped in price since it debuted, it’s still one of the best gaming notebooks around, especially since ASUS has finally added a built-in webcam. Read our Full Review of ASUS ROG Zephyrus G14 Best budgetDellDell G15 5520 Gaming LaptopWe've been fans of Dell's G5 line ever since it first appeared a few years ago. Now dubbed the G15, it starts at under $1,000 and, while not the most powerful gaming laptop, features all of the latest hardware.                    $784 at Amazon                 We've been fans of Dell's G5 line ever since it first appeared a few years ago. Now dubbed the G15, it starts at under $1,000 and, while not the most powerful gaming laptop, features all of the latest hardware. We've been fans of Dell's G5 line ever since it first appeared a few years ago. Now dubbed the G15, it starts at under $1,000 and, while not the most powerful gaming laptop, it features all of the latest hardware, like Intel's 13th-generation CPUs and NVIDIA's RTX 40-series cards. (You can also find AMD Ryzen chips in some models.) This budget gaming laptop is a bit heavy, weighing over five pounds, but it's a solid notebook otherwise. And you can even bring it into mid-range gaming territory if you spec up to the RTX 4060. Best premium gaming laptopWill Lipman Photography for EngadgetRazer Blade 15 Gaming LaptopRazer continues to do a stellar job of delivering bleeding-edge gaming hardware in a sleek package that would make Mac users jealous.                    $2,300 at Amazon                                        $2,500 at Razer                 Razer continues to do a stellar job of delivering bleeding-edge gaming hardware in a sleek package that would make Mac users jealous. Razer continues to do a stellar job of delivering bleeding-edge hardware in a sleek package that would make Mac users jealous. The Blade 15 has just about everything you'd want, including NVIDIA's RTX 4080, Intel's 13th-gen CPUs and speedy quad-HD screens. Our recommendation? Consider the model with a Quad HD 165Hz screen and an RTX 4060 GPU for $2,500. You can easily save some cash by going for a cheaper notebook, but they won't feel nearly as polished as the Blade. Read our Full Review of Razer Blade 15 Another good optionPhoto by Devindra Hardawar / EngadgetAcer Predator Triton 500 SE Gaming LaptopThe Triton 500 SE has the same sturdy build quality we've come to expect from Acer's gaming laptops, and it has most of the standard features you’d need.                    $3,367 at Amazon                 The Triton 500 SE has the same sturdy build quality we've come to expect from Acer's gaming laptops, and it has most of the standard features you’d need. While we've seen some wilder concepts from Acer, like its 360-degree hinge-equipped Triton 900, the Triton 500 is a more affordable bread and butter option. This year, it’s bumped up to a 16-inch display, giving you more of an immersive gaming experience. It’s relatively thin, weighs just over five pounds, and it can be equipped with Intel's 11th-gen CPUs and NVIDIA's RTX 30-series GPUs. Acer's build quality is as sturdy as ever, and it has most of the standard features you’d need in a gaming notebook. Read our Full Review of Acer Predator Triton 500 SE Gaming Laptop Best large gaming laptopPhoto by Devindra Hardawar / EngadgetAlienware m18Alienware’s m18 is its biggest gaming laptop ever, and it packs in just about everything we’d want.                    $2,000 at Dell                 Alienware’s m18 is its biggest gaming laptop ever, and it packs in just about everything we’d want. Alienware’s m18 is its biggest gaming laptop ever, and it packs in just about everything we’d want. It can be equipped with Intel and AMD’s fastest CPUs, as well as NVIDIA’s fastest GPUs (including the 4090). Its base configuration with an RTX 4060 is also surprisingly affordable for an 18-inch laptop, starting at $2,100. We’ve always liked Alienware’s m-series gaming laptops, but this year they’re more refined, with better cooling and a slightly sleeker design. You can also opt for CherryMX mechanical keys, which deliver a desktop-like gaming and typing experience. Best with a dual screenPhoto by Sam Rutherford / EngadgetASUS ROG Zephyrus Duo 16 (2022)If a single 17-inch screen isn’t enough, or you want a mobile setup that’s closer to a multi-monitor desktop, ASUS's unique gaming laptop might be your best bet.                    $2,799 at Amazon                                        $2,499 at B&H Photo                 If a single 17-inch screen isn’t enough, or you want a mobile setup that’s closer to a multi-monitor desktop, ASUS's unique gaming laptop might be your best bet.  You know if you actually need a dual-screen laptop: Maybe a single 17-inch screen isn’t enough, or you want a mobile setup that’s closer to a multi-monitor desktop. If that’s the case, the Zephyrus Duo 16 is the best laptop for you. It’s powerful, and its extra 14-inch screen can easily let you multitask while gaming dutifully working. It also has all of the latest hardware you’d want, like AMD’s new Ryzen chips and NVIDIA’s RTX 4000 GPUs. Sure, it’s nowhere near portable, but a true multitasker won’t mind. Read our Full Review of ASUS ROG Zephyrus Duo 16 Gaming Laptop ", "url": "https://www.engadget.com/best-gaming-laptops-172033838.html", "threshold": 1.0}