{"title": "The best laptops for 2023 | Engadget", "content": "You may want to upgrade your tech as we begin a new year, but buying a new laptop computer can be confusing. There have never been more brands, features and configurations to consider, and given that we're still dealing with inflation, you may also be concerned about rising prices. The good news is, companies are still making a ton of new laptops, and there are a wide range of models for you to choose from the budget HP Pavilion Aero 13 to the convertible Microsoft Surface Pro 9 to our best overall pick of the Apple MacBook Air M2. We've made it less complicated for you to pick out the best laptop for your needs.                        Quick Overview                    Best overallApple 2022 MacBook Air Laptop with M2 chip$1,199                        $1,199 at Amazon                                     $1,199 at Amazon             Best WindowsDell XPS 13 Plus$1,349                        $1,349 at Dell                                    $1,349 at Dell            Best for gamingRazer Blade 15$2,800                        $2,800 at Razer                                    $2,800 at Razer            Best ChromebookLenovo IdeaPad Flex 5i$430                        $430 at Amazon                                    $430 at Amazon            Best budgetHP Pavilion Aero$800                        $800 at HP                                    $800 at HP            Best convertibleMicrosoft Surface Pro 9$970                        $970 at Amazon                                    $970 at Amazon            See 1 more You probably have an idea of your budget here, but just so you know, most modern laptops with top-of-the-line specs can cost you around $1,800 to $2,000 these days. That doesn’t mean you won’t find a good system for under $1,000 — a grand is the base price for a lot of high-end ultraportables in the 13-inch category, with chips like Intel’s Core i3 or i5 series. And if that’s too expensive, you’ll still have respectable options in the $600 to $800 range, but they might come with older, slower processors and dimmer screens. I’ve included our favorite budget-friendly model in this best laptop roundup but we have a list of more-affordable laptops that you can check out as well. After working out how much money you want to spend, the laptop’s operating system is usually the first thing you have to narrow down. As always, the decision is slightly easier for people who prefer an Apple MacBook. Now that the company has brought its M-series chips to its whole lineup — your only real considerations are budget, screen size and how much power you need. Over on Team Windows, however, the shift to ARM-based chips hasn’t been as smooth. Though Apple laptops have been able to bring huge increases in battery life while maintaining (and in some cases improving) performance with their own silicon, PC makers have been limited by Windows’ shortcomings. Microsoft released Windows 11 last year, and it’s supposed to run better on ARM-powered machines. Since the first of these laptops, like Lenovo’s ThinkPad X13s or 10w tablet, haven’t been available for review yet, we can’t tell how well the system runs. Of course, you can upgrade to Windows 11 on existing ARM-based PCs, but for now, it’s still safer to stick with an Intel or AMD processor. Let’s not forget there’s a third and fairly popular laptop operating system: Chrome OS. If you do most of your work in a browser (lots of online research, emails and Google Drive), then a Chromebook might be a suitable, and often more affordable option. As for other things to look out for when shopping for the best laptop, it’s worth pointing out that some of the latest models coming out this year have done away with headphone jacks. Though this doesn’t seem to be a prevalent trend yet, it’s a good reminder to check that a machine has all the connectors you need. Most laptops in 2022 offer WiFi 6 or 6E and Bluetooth 5.0 or later, which should mean faster and more stable connections if you have compatible routers and devices. While 5G coverage is more widespread this year, whether you need support for that depends on how much you travel. See Also: Best Gaming Laptops for 2023 Best Cheap Windows Laptops Best 2-in-1 Laptops for 2023 Best Chromebooks Best Laptops for College Students Where you plan on taking your laptop also helps in deciding what size to get. Many companies launched new 14-inch machines in the last year, straddling the line between ultraportable and bulkier 15-inch offerings. For most people, a 14-inch screen is a great middle ground. But if you’re worried about weight, a 12- or 13-inch model will be better. Those that want more powerful processors and larger displays will prefer 15- or 16-inch versions. Best overallPhoto by Devindra Hardarwar / EngadgetApple 2022 MacBook Air Laptop with M2 chipThe latest MacBook Air M2 is a worthy sequel to the M1 that came out in 2020, bringing a fresh design and a performance boost that all users will appreciate.                    $1,199 at Amazon                                         $1,199 at Apple                                        $1,199 at Adorama                 The latest MacBook Air M2 is a worthy sequel to the M1 that came out in 2020, bringing a fresh design and a performance boost that all users will appreciate. As a Windows user, I find myself reluctant to name an Apple MacBook the best overall laptop. But I can’t deny that Apple’s transition to its own Silicon has made its machines better. The latest MacBook Air M2 is a worthy sequel to the M1 that came out in 2020, bringing a fresh design and a performance boost that all users will appreciate. That's not to say the M1 was a sluggish machine — quite the contrary. We found it to be impressively fast, and the M2 only builds on top of that excellent performance. It's probably overkill for a MacBook Air, but that means it will serve most people well for both work and play. Plus, its impressive 16.5-hour long battery life should be enough for anyone to get a day's worth of work and then some. As for its design, we like that Apple took a more uniformly thin approach here and retired the wedge shape of the previous model. The M2 Air also has a lovely 13.6-inch Liquid Retina display, interrupted only by the top notch which holds its 1080p webcam. Its quad-speaker setup is an improvement as well, and all of these small hardware changes add up to a machine that looks and feels more different than you may expect from its predecessor. However, both the Apple M1 and M2 MacBook Air laptops remain solid machines. Considering the M2 starts at $1,199, those with tight budgets may be willing to forgo the new design improvements in order to save some cash and get a still-speedy laptop. Read our Full Review of MacBook Air M2  Best WindowsPhoto by Devindra Haradwar / EngadgetDell XPS 13 PlusThe XPS 13 remains a well-rounded Windows laptop and still one of the best-looking PCs out there.                    $1,349 at Dell                 The XPS 13 remains a well-rounded Windows laptop and still one of the best-looking PCs out there. The best PC has long been Dell’s well-rounded XPS 13 series and it remains the best laptop for anyone that doesn't want a Mac. Yes, the new XPS 13 Plus lacks a headphone jack, and we haven’t got one in to test yet. But the XPS 13 is a well-rounded Windows laptop and still one of the best-looking PCs out there. Like its predecessors, the Dell XPS 13 Plus offers a lovely OLED display with impressively thin bezels and packs a roomy, comfortable keyboard. It also features a new minimalist design that looks more modern. I’m not sure about the row of capacitive keys at the top in lieu of traditional function keys, but I’m confident that the laptop’s 12th-gen Intel Core processors will provide a healthy performance boost from the last model. If you’re not sure about the changes Dell has made to the XPS 13, or if you definitely need a headphone jack, the older generations are still solid options. There’s also the Samsung Galaxy Book 2 Pro series, which feature beautiful OLED screens and sharper webcams in thin and light frames. I also like Microsoft’s Surface Laptops, and the most recent edition offers great performance and battery life, albeit in an outdated design. Read our Full Review of Dell XPS 13 Plus Best for gamingEngadgetRazer Blade 15Razer's laptop is the most expensive item on this list, but you get a 15-inch quad HD screen that refreshes at 240Hz, 13th-gen Intel processors and NVIDIA GeForce 40-series graphics.                    $2,800 at Razer                 Razer's laptop is the most expensive item on this list, but you get a 15-inch quad HD screen that refreshes at 240Hz, 13th-gen Intel processors and NVIDIA GeForce 40-series graphics. Gamers should look for machines with solid build quality, responsive screens and ample port selection for their favorite accessories that can best help them defeat their virtual enemies. My colleague Devindra Hardawar goes into more detail about what to consider in his guide to buying a gaming laptop, which you should read to learn about different CPUs and GPUs, minimum specs and more. Our pick for the best gaming laptop is the Razer Blade 15. It’s the most expensive item on this list, but you get a 15-inch quad HD screen with a 240Hz refresh rate, 13th-gen Intel processors and NVIDIA GeForce 40-series graphics. Different configurations are available, depending on your preference, including a Full HD 360Hz and a 4K 144Hz version. The Blade series is also one of the most polished and powerful gaming laptops around. Those looking for a budget gaming laptop should consider the ASUS ROG Zephyrus G14, which was our favorite model last year. The main reason it got bumped down a notch is because the 2022 refresh is almost $600 more expensive. It’s still a solid gaming laptop though, with an excellent display, roomy trackpad and plenty of ports in spite of its thin profile. Read our Full Review of Razer Blade 15 Best ChromebookPhoto by Nathan Ingraham / EngadgetLenovo IdeaPad Flex 5iThe Ideapad Flex 5i hits the sweet spot for a large majority of Chromebook buyers out there, providing a level of quality and performance that’s pretty rare to find at this price point.                    $430 at Amazon                 The Ideapad Flex 5i hits the sweet spot for a large majority of Chromebook buyers out there, providing a level of quality and performance that’s pretty rare to find at this price point. Our favorite Chromebook is Lenovo’s Flex 5 Chromebook, which Engadget’s resident Chrome OS aficionado Nathan Ingraham described as “a tremendous value.” This laptop nails the basics, with a 13-inch Full HD touchscreen, a fantastic keyboard and a 10th-generation Intel Core i3 processor. Its 4GB of RAM and 64GB SSD may sound meager, but in our testing the Flex 5 held up in spite of this constraint. It’s also nice to see one USB-A and two USB-C ports, eight hours of battery life and a 360-degree hinge that makes it easy to use the Flex 5 as a tablet. That’s a bonus, especially now that Chrome OS supports Android apps. Though the Flex 5 is almost two years old by now, this Lenovo Chromebook is a solid deal at around $400. In fact, you can sometimes find it on sale for as little as $300, making it a great option for someone looking for a basic browser-based machine on a tight budget. Best budgetPhoto by Daniel Cooper / EngadgetHP Pavilion AeroThis sub-$1,000 laptop sports a Full HD screen with a 16:10 aspect ratio and surprisingly thin bezels, as well as a comfortable keyboard and spacious trackpad.                    $800 at HP                                        $835 at Best Buy                 This sub-$1,000 laptop sports a Full HD screen with a 16:10 aspect ratio and surprisingly thin bezels, as well as a comfortable keyboard and spacious trackpad. If you’re looking for a budget laptop priced around $800, your best bet is the HP Pavilion Aero 13. For around $799 (or often less when on sale), you’ll get a Full HD screen with a 16:10 aspect ratio and surprisingly thin bezels, as well as a comfortable keyboard and spacious touchpad. Importantly, the Aero 13 provides relatively powerful components compared to others in this price range, with an AMD Ryzen 5000 series processor and Radeon graphics. Plus, it has a generous array of ports and enough battery life to last you the entire work day and then some. Read our Full Review of HP Pavilion Aero  Best convertibleEngadgetMicrosoft Surface Pro 9The Surface Pro 9 is Microsoft's latest 2-in-1, and if you've had your eye on a Surface for a while, just know to get the Intel version of this machine rather than the ARM model.                    $970 at Amazon                                        $1,000 at Microsoft                 The Surface Pro 9 is Microsoft's latest 2-in-1, and if you've had your eye on a Surface for a while, just know to get the Intel version of this machine rather than the ARM model.  For those who need their laptops to occasionally double as tablets, the Surface Pro series is a good option. Compared to notebooks with rotating hinges, tablets with kickstands are often much slimmer and lighter. The Surface Pro 9 is Microsoft's latest 2-in-1 laptop model and if you've had your eye on a Surface for a while, just know to get the Intel version of this machine rather than the ARM model. In our testing, we found that the 5G ARM version of the Pro 9 was much slower than a flagship convertible should be and that's mostly due to the fact that lots of the Windows apps readily available on Intel's x86 hardware have to be emulated to work on Microsoft's custom ARM SoC. Considering you'll pay at least $1,000 for any Surface Pro 9 model, you might as well get a configuration that has as few limitations as possible. While we have our gripes about the Pro 9's overall ergonomics, it's undoubtedly one of the thinnest and lightest laptop alternatives you can get. It's attractive and has a gorgeous 13-inch display, and we still consider Microsoft's Type Cover to be one of the best you can get, period. They will cost you extra, though, so be prepared to shell out another $100 to $180 for one. Microsoft's Slim Pen 2 is another highlight, and it will be a must-buy stylus for anyone that loves to draw or prefers to take handwritten notes. Overall, if you want a machine that can switch seamlessly from being a laptop to being a tablet, the Intel Surface Pro 9 is one of your best bets. Of course, if you're married to the Apple ecosystem, you should consider an iPad Pro. Read our Full Review of Microsoft Surface Pro 9", "url": "https://www.engadget.com/best-laptops-120008636.html", "threshold": 1.0}