{"title": "The best webcams for 2023 | Engadget", "content": "That tiny webcam on your laptop has probably gotten more use in the last few years than it ever has before. Even if you’re going back into the office for meetings on occasion, chances are frequent video calls are a permanent part of your professional life. Once an afterthought, your computer’s webcam has become one of its most important components — and the fact remains that most built-in cameras are not able to provide consistent, high-quality video call experiences.                        Quick Overview                    Best overallLogitech Brio 500$100                        $100 at Amazon                                    $100 at Amazon            Runner upAnker PowerConf C200 2K Webcam$60                        $60 at Amazon                                    $60 at Amazon            Best for streamingRazer Kiyo Pro Ultra$300                        $300 at Razer                                    $300 at Razer            Runner upLogitech Streamcam$140                        $140 at Amazon                                    $140 at Amazon             This is where external webcams come in. They can do wonders for people who spend most of their working hours on video conferences, and those who picked up a new hobby of streaming on Twitch or YouTube over the past couple of years. But as with most PC accessories, it can be tough to sort through the sea of options out there and find the best webcams for your needs. We tested out a bunch of the latest webcams to see which are worth your money and which you can safely skip. While some newer computers have 1080p webcams, most built-in cameras have a resolution of 720p, so you’ll want to look for an external webcam that’s better than that. FHD webcams will give you a noticeable bump in video quality; ideally, you’re looking for something that can handle 1080p at 60fps or 30fps. If you’re considering a cheap 720p webcam, make sure to get one that supports at least 30fps (most will) or, even better, 60fps. However, if your primary concern is better picture quality during video calls, 1080p is the way to go. Some webcams can shoot in 4K, but that’s overkill for most people. Not to mention most video conferencing services like Zoom, Google Meet and Skype don’t even support 4K video. When it comes to streaming, Twitch maxes out at 1080p video, but YouTube added 4K live streaming back in 2016. Ultimately, with 4K webcam shots having such limited use, most people can get by with a solid 1080p camera. Field of view (FOV) controls how much can fit in the frame when you’re recording. Most webcams I tested had a default field of view of around 78 degrees, which  captured me and enough of my background to prove that I really need to organize my home office. On cheaper webcams you’ll usually see narrower fields of view (around 60 degrees), and those aren’t necessarily bad. They won’t show as much of your background, but that also means you won’t be able to squeeze as many friends or family members into frame when you’re having Zoom birthday parties. On the flip side, more expensive webcams may let you adjust the field of view to be even wider than average. Webcams with autofocus will keep the image quality sharp without much work on your part. You should be able to move around, step back and forth, and remain in focus the whole time. Some standalone webcam models let you manually adjust focus, too, if you have specific needs. Devices with fixed focus are less convenient, but they tend to be more affordable. In the same vein is auto framing, a feature that some high-end webcams now offer. Similarly to Apple’s Center Stage feature, the camera automatically adjusts to keep you in the center of the frame even as you move around. This used to be a feature only available on the most premium webcams, but now you can find it on sub-$200 devices. You’ll also see other “auto” features listed in webcam specs, most notably auto light correction. This will adjust the camera’s settings to make up for a dimly lit room. If you don’t have bright lights, or often take calls in places where you can’t control the lighting, this feature will be valuable. Most webcams have built-in microphones that, depending on your setup, might end up being closer to you than your computer’s own mics. Check to see if the model you’re considering has mono or stereo mics, as the latter is better. Some even use noise-reduction technology to keep your voice loud and clear. While audiophiles and streamers will want to invest in a standalone microphone, most others can get by using a webcam’s built-in mic. There aren’t a ton of fascinating breakthroughs when it comes to external webcam design. Most are round or rectangular devices that clip onto a monitor or your laptop screen. Some have the ability to swivel or screw onto a tripod stand and others can simply sit on your desk beside your computer. But unless you really like having people stare up your nose, the latter isn’t ideal. We recommend clipping your webcam to your monitor and ensuring that it’s at or slightly above eye level. A few webcams go above and beyond by adding hardware extras like built-in lights and lens covers, too. The former can help you stand out in a dark room, while the latter makes it so hackers can’t view you through your webcam without your knowledge. Most external webcams that are just good enough to be a step up from your computer’s built-in camera cost between $60 and $150. If the webcam has the same resolution as the internal one on your laptop, you should look out for other specs like auto light correction, a wider field of view or an extra-long connecting cable that can provide a step-up in quality or ease of use. Spending $150 or more means you might get advanced features like 4K resolution, vertical and horizontal recording options, stereo mics, customizable video settings and more. But unless you’re spending hours on video calls each day or streaming multiple times each week, you can settle on a budget webcam and safely skip most of those high-end options. Best overallLogitechLogitech Brio 500The Logitech Bio 500 is essentially an upgraded version of the beloved C920s HD Pro. It shoots the same quality of video, but it has a wider FOV, an upgraded zoom, improved auto-light correction and a USB-C connecting cable.                    $100 at Amazon                                        $130 at Focus Camera                 The Logitech Bio 500 is essentially an upgraded version of the beloved C920s HD Pro. It shoots the same quality of video, but it has a wider FOV, an upgraded zoom, improved auto-light correction and a USB-C connecting cable. The Logitech Bio 500 is essentially an upgraded version of the beloved C920s HD Pro. It shoots the same quality of video — up to 1080p 30fps — but it has a wider field of view, an upgraded zoom, improved auto-light correction, a better mic array and a USB-C connecting cable. The biggest difference I noticed in testing the Bio 500 was the improved light correction. My home office can feel very cave-like when the blinds are shut or when it’s raining, but you wouldn’t know it when on a video call with me. Logitech’s RightLight 4 technology does a great job of brightening the whole shot when you’re in a dim or dark environment. The Bio 500 works with the LogiTune software, which lets you customize camera settings like field of view, autofocus, contrast, brightness and more, plus lets you enable Show Mode and RightSight features. The former lets you present things on your desk just by tilting the camera down while the latter will automatically keep you in frame during calls even if you move around. RightSight works much like Apple’s Center Stage feature does on iOS devices, and most people will likely get more use out of this feature than Show Mode. If you prefer to keep things more consistent (or control how much of your background is visible), you can choose from 90-, 78- or 65-degree field of views instead of enabling RightSight. Logitech also updated the design of the Bio 500. It’s made of recycled plastic and it comes in three different colors that you can match to other Logitech peripherals. The camera attaches magnetically to its base and it easily swivels from side to side when you need to adjust its position, plus it has a built-in lens cover for extra privacy when you’re not using it. Overall, it has the best mix of essential features and handy extras of any webcam we tested. But $130 might be a lot for some people to spend on a webcam. We think it’s worth it if you’re primarily a hybrid or remote worker, but there is a cheaper option for those with tight budgets. The Logitech Brio 300 has many of the same core features as the Bio 500: 1080p resolution, auto light correction, a built-in privacy shutter and USB-C connectivity. However, you won’t get HDR support, an adjustable field of view, Show Mode or omnidirectional mics (although it does have a noise-reducing microphone of its own). It’s a pared-down version of the Bio 500 and it’ll only cost you $70. Runner upPhoto by Valentina Palladino / EngadgetAnker PowerConf C200 2K WebcamAnker's cube-like webcam has a default 2K resolution which you can customize, plus a 95-degree field of view and a built-in lens cover.                    $60 at Amazon                                        $60 at Anker                 Anker's cube-like webcam has a default 2K resolution which you can customize, plus a 95-degree field of view and a built-in lens cover. Anker’s cube-like PowerConf C200 webcam has has a lot of the same perks as our top pick, along with a few extras. Setup is equally as easy – just plug it into your computer or docking station and start using it. You can download the AnkerWork software to edit things like brightness, sharpness and contrast ratio, but I just kept all the defaults. You’re also able to control the camera’s resolution and field of view with this software, too. The C200 webcam defaults to a 2K resolution, but you can bring it down to 1080p, 720p or even 360p if you wish. Same goes for field of view: The default is 95 degrees, but I bumped mine down to 78 degrees to spare my colleagues a wider view of my messy home office. I was immediately impressed with the C200’s video quality: 2K is likely more than most people need (1080p should do just fine), but the extra sharpness and clarity is a nice touch. The webcam’s autofocus is quite fast, and its larger f/2.0 aperture captures more light so you stay illuminated even in darker settings. In addition to a built-in lens cover that you can slide closed for privacy, the C200 has dual stereo mics that actually do a good job of capturing your voice loud and clear. You can also choose directional or omnidirectional vocal pickup in the AnkerWork settings, with the latter being better if you have multiple people speaking on your end. My biggest complaints about the C200 webcam are that it’s a bit cumbersome to adjust its angle when it’s perched on your screen. Unlike most webcams, Anker’s doesn’t have a short neck of sorts that connects the camera to its adjustable base – it’s just one, chunky piece of plastic that I had to use both hands to adjust. Also, the C200 comes with a USB cable that’s much shorter than others. This won’t be a problem if you’re connecting the webcam directly to your laptop, but it’s not as flexible if you have a standing desk converter or a more complicated setup that requires long cables. Best for streamingRazerRazer Kiyo Pro UltraStreamers will not only appreciate the high quality image coming from this cam, but also its face-tracking autofocus that swiftly transitions from zeroing-in on their face to whatever object they may be showing off.                    $300 at Razer                 Streamers will not only appreciate the high quality image coming from this cam, but also its face-tracking autofocus that swiftly transitions from zeroing-in on their face to whatever object they may be showing off. Razer built the Kiyo Pro Ultra for streaming and that’s immediately apparent as soon as you take the webcam out of the box. It’s huge. Its circular frame measures three inches in diameter and about two inches thick. It follows the design language of other Kiyo webcams, but it’s definitely the biggest of the bunch and that’s probably because Razer stuffed a lot into this peripheral. It has the biggest sensor of any Kiyo webcam (1/1.2 inches to be exact), and the company claims it’s the largest in any webcam, period. The Pro Ultra has a F/1.7 aperture lens as well, which lets in a ton of light and results in a super crisp image. It certainly delivered the best quality image of all the webcams I tested, which isn’t a surprise since it can capture raw 4k/30fps (or 1080p/60fps) footage. Streamers will not only appreciate the high quality image coming from this cam, but also its HDR support, tasteful background blurring and face-tracking autofocus that swiftly transitions from zeroing-in on their face to whatever object they may be showing off to their viewers. It works with Razer’s Synapse software, too, so you can customize your image to your liking, tweaking things like zoom, pan, tilt, ISO and shutter speed. Just know that Synapse only works on Windows devices, so you’ll be stuck with default settings if you’re on macOS or Linux. The Kiyo Pro Ultra is compatible with Open Broadcaster Software (OBS) and XSplit, so most streamers will be able to unbox it and get right to producing content. We also appreciate that you can twist the camera’s frame to physically shutter the lens, giving you more privacy when you need it. Undoubtedly, the Kiyo Pro Ultra is one of the most powerful webcams we tried out and it may even be overkill for streamers just starting out (our final pick might be better for those folks), but serious and professional content creators will love the quality video and customization options they get. If you want a similar level of quality and the ability to tweak settings on a Mac, Elgato’s Facecam Pro is a good alternative. It costs the same as the Razer Kiyo Pro Ultra, can record video at 4K/60fps and its Camera Hub software works on macOS and Windows. Runner upPhoto by Valentina Palladino / EngadgetLogitech StreamcamThe Streamcam is one of the most fun webcams to use, and we like that it lets you shoot in both portrait and landscape orientations.                    $140 at Amazon                                        $170 at Logitech                 The Streamcam is one of the most fun webcams to use, and we like that it lets you shoot in both portrait and landscape orientations. Of all the webcams I tested, I had the most fun using Logitech’s Streamcam. While it’s a bit weird to say I “had fun” with such an innocuous piece of tech, I found the Streamcam to be remarkable in many ways. First and foremost, the video quality is excellent, coming in at a sharp 1080p/60fps. Details in my clothing came through much better and, whether I liked it or not, so did some of the texture on my skin. The Streamcam was also one of the best webcams I tested when it came to color reproduction. All of those perks remain the same even when you’re shooting in low-light conditions. The Streamcam’s auto-exposure feature made up for the darkness in my office on gloomy days. And it has the best kind of autofocus — the kind that you never notice in action. The dual omnidirectional mics inside the Logitech Streamcam delivered my voice loud and clear during video calls. If you stream often and find yourself without an external mic, it’s nice to know that you could get by with the Streamcam’s built-in ones in a pinch. The microphones also have noise reduction to keep your voice font and center. As far as design goes, the Streamcam is a bit larger than your standard cam. It’s a chunky almost-square that can easily be positioned on a monitor or on a tripod, and a unique feature of its design is its ability to shoot either vertically or horizontally. I kept mine in the standard 16:9 format, but some content creators and streamers who post to social media often will like the 9:16 format that’s best for Instagram and TikTok. Logitech also made sure the Streamcam was optimized for OBS, XSplit and Streamlabs, so you can use it directly out of the box for your next live session.", "url": "https://www.engadget.com/best-webcams-123047068.html", "threshold": 0.9999999960816699}