{"title": "Central de confiança: segurança e conformidade  |  Google Cloud", "content": "Como nos concentramos em segurança, conformidade e privacidade para                        conquistar a posição de uma nuvem mais confiável. A decisão de mover aplicativos ou dados para a nuvem se resume a:  por fim, os dados do cliente são seus, e não do Google.  Fazemos o seguinte para conquistar sua confiança:  Protegemos informações, identidades,                            aplicativos e dispositivos usando a mesma                            infraestrutura de segurança incorporada ao design,                            a proteção integrada e a rede global utilizadas pelo Google. Criptografamos dados em trânsito entre nossas instalações e                        dados em repouso, garantindo que só possam ser acessados por papéis                        e serviços autorizados com acesso auditado às chaves de                        criptografia.   Fornecemos uma visão opinativa das                            práticas recomendadas de segurança para o Google Cloud, incluindo estas: Nossos controles de segurança, privacidade e compliance passaram por uma verificação independente para ajudar você a atingir seus objetivos em matéria de normas e políticas. Veja detalhes sobre nosso conjunto completo de                            ofertas de conformidade, como ISO/IEC                            27001/27017/27018/27701,                            SOC                            1/2/3,                            PCI DSS                            e                            FedRAMP                            e alinhamento com o                            GDPR                            e                            HIPAA                            na nossa central de recursos de conformidade. Sabemos que a privacidade é essencial para                            conquistar e manter sua confiança. A forma como trabalhamos para proteger sua privacidade é codificada em                            nossos                            Compromissos de privacidade empresarial,                            que orientam nossas práticas de privacidade e                            de segurança.                            Veja como o Google Cloud ajuda você a obedecer                            aos princípios comuns de privacidade,                            independentemente da região,                            ver produtos relevantes                            ou acessar nossa página abrangente sobre privacidade Central de recursos.                           No Google Cloud, somos transparentes sobre nossos compromissos e o que esperar quando se trata da proteção e do gerenciamento dos seus dados na nuvem.  Consulte os termos de processamento de dados para o                            Google Cloud,                            que abrangem o Google Cloud Platform, o Google                            Workspace e o Cloud Identity. Veja o                            tempo de atividade e a disponibilidade                            dos nossos serviços na nuvem em todo o mundo e acesse o histórico de desempenho                            dos serviços do Google Cloud. Os especialistas em segurança do Google Cloud analisarão detalhadamente sua configuração atual do Google Cloud e fornecerão recomendações detalhadas e um roteiro de mitigação. Consulte todo o                           portfólio de consultoria                          e                          entre em contato com a equipe de vendas                          para começar.  \"Mantemos suas informações              pessoais privadas, seguras e protegidas. Todos os nossos produtos são              guiados por três princípios importantes: com uma das infraestruturas              de segurança mais avançadas do mundo, nossos produtos são seguros por              padrão. Mantemos as práticas relacionadas a dados responsáveis para garantir que todos              os produtos que criamos sejam particulares por padrão. Além disso, criamos configurações de privacidade e segurança fáceis de usar para que você esteja no controle. ”   Sundar              Pichai, Google I/O 2021  Todos os produtos do Google contam com a proteção contínua de uma das infraestruturas de segurança mais avançadas do mundo. Tratamos seus dados com responsabilidade usando protocolos e princípios rígidos.  Qual a                    solução que você procura? Um especialista do Google Cloud ajudará você a                    encontrar a melhor solução.   Qual a                    solução que você procura? Um especialista do Google Cloud ajudará você a                    encontrar a melhor solução. ", "url": "https://cloud.google.com/trust-center?hl=pt-br", "threshold": -0.3733703020092378}