{"title": "IA e machine learning: quais as diferenças?  |  Google Cloud", "content": "As pessoas usam inteligência artificial (IA) e machine learning (ML) de maneira intercambiável, principalmente ao discutir Big Data, análise preditiva e outros tópicos de transformação digital.                          A confusão é compreensível, porque a                          inteligência artificial e o machine learning estão fortemente relacionados.                          No entanto, essas tecnologias são diferentes de várias maneiras, incluindo escopo, aplicativos e muito mais.   Cada vez maisProdutos de IA e ML têm proliferado conforme as empresas os utilizam para processar e analisar volumes imensos de dados, tomar decisões melhores, gerar recomendações e insights em tempo real e criar previsões precisas.  Portanto, qual é exatamente a diferença enter a                          ML em comparação com IA, como o ML e a IA estão conectados e o que                          esses termos significam na prática para as organizações                          atualmente?  Vamos detalhar a IA e o ML e ver como esses dois                          conceitos inovadores estão relacionados e o que os torna                          diferentes.  Inteligência artificial é um campo amplo, que se refere ao uso de tecnologias para criar máquinas e computadores que são capazes de imitar funções cognitivas associadas à inteligência humana, como a capacidade de ver, entender e responder à linguagem falada ou escrita, analisar dados, fazer recomendações e muito mais.  Embora a                    inteligência artificial                    seja considerada um sistema em si, ela é um conjunto de                    tecnologias implementadas em um sistema para permitir que ela                    possa ponderar, aprender e agir para resolver um problema complexo.                      O machine learning                    é um subconjunto da inteligência artificial que permite                    automaticamente que uma máquina ou um sistema aprenda e melhore com base na                    experiência. Em vez de programação explícita, o machine learning usa algoritmos para analisar grandes volumes de dados, aprender com os insights e tomar decisões embasadas.  Os algoritmos de machine learning melhoram o desempenho ao longo do tempo                    conforme são treinados (expostos a mais dados). Modelos de machine learning são a saída, ou o que o programa aprende com a execução de um algoritmo em dados de treinamento. Quanto mais dados forem usados, melhor será o modelo.  IA e ML não são exatamente a mesma coisa, mas estão diretamente conectados. A maneira mais simples de entender a relação entre a IA e o ML é:    Uma maneira útil de lembrar a diferença entre machine learning e inteligência artificial é imaginá-los como categorias amplas. Inteligência artificial é o termo abrangente que cobre uma ampla variedade de abordagens e algoritmos específicos. O machine learning está sob esse amplo escopo, mas também há outros subcampos, como aprendizado profundo, robótica, sistemas de especialistas e processamento de linguagem natural.                   A inteligência artificial abrange a ideia de uma máquina que pode imitar a inteligência humana, mas o machine learning não. O aprendizado de máquina tem como objetivo ensinar uma máquina a                    realizar uma tarefa específica e fornecer resultados precisos identificando                    padrões.  Digamos que você pergunte ao seu dispositivo Google Nest: \"Qual é a duração do meu deslocamento diário hoje?\". Nesse caso, faça uma pergunta a uma máquina e receba uma resposta sobre o tempo estimado que levará para você ir ao escritório. Aqui, o objetivo geral é que o dispositivo execute uma tarefa de maneira bem-sucedida. Uma tarefa que você normalmente teria que fazer em um ambiente real (por exemplo, pesquisar seu tempo de deslocamento diário).                    No contexto deste exemplo, o objetivo de usar ML no sistema geral não é permitir que ele execute uma tarefa. Por                    exemplo, é possível treinar algoritmos para analisar dados de trânsito                    e trânsito em tempo real para prever o volume e a densidade do                    fluxo de tráfego. No entanto, o escopo é limitado a identificar padrões, a precisão da previsão e o aprendizado dos dados para maximizar o desempenho dessa tarefa específica. IA e ML trazem benefícios poderosos para organizações de todos os formatos e tamanhos, com novas possibilidades constantemente em evolução. Em especial, à medida que a quantidade de dados aumenta em                        tamanho e complexidade, os sistemas automatizados e inteligentes                        estão se tornando vitais para ajudar as empresas a automatizar tarefas,                        agregar valor e gerar insights úteis para                        alcançar melhores resultados.  Veja alguns dos benefícios comerciais do uso da                        inteligência artificial e do machine learning:  Analisa e ativa uma maior variedade de fontes de dados estruturados e não estruturados. Melhora a integridade de dados, acelera o processamento de dados                        e reduz erros humanos para tomar decisões mais rápidas e                        fundamentadas. Aumenta a eficiência operacional e reduz custos.                       Capacitando os funcionários ao integrar insights e análises                        preditivas a relatórios e aplicativos                        empresariais. Empresas de todos os setores estão usando a IA e o ML de                    várias maneiras para transformar a forma como trabalham e fazem negócios.                    Incorporar os recursos de IA e ML nas estratégias                    e sistemas ajuda as organizações a repensar o uso dos                    dados e os recursos disponíveis, impulsionar a produtividade e a                    eficiência, melhorar a tomada de decisões baseada em dados com                    análises preditivas e aprimorar a experiência                    dos clientes e funcionários.    Veja a seguir algumas das aplicações mais comuns de IA e                    ML:  Análise e insights de históricos de saúde de pacientes, previsão                    e modelagem de resultados, desenvolvimento acelerado de medicamentos,                    diagnóstico aprimorado, monitoramento de pacientes e extração                    de informações de notas clínicas. Monitoramento de máquina de produção, manutenção preditiva, análise                    de IoT e eficiência operacional. otimização de inventário e da cadeia de suprimentos, previsão de demanda, pesquisa visual, ofertas e experiências personalizadas e mecanismos de recomendação. Avaliação e análise de riscos, detecção de fraudes, negociação                    automatizada e otimização de processamento de serviços. Redes inteligentes e otimização de rede, manutenção                    preditiva, automação de processos de negócios, planejamento de upgrade                    e previsão de capacidade. O Google Cloud oferece uma ampla variedade de ferramentas de IA e ML para                        ajudar suas equipes a se concentrarem no trabalho de valor                        mais importante. Projetados e criados com o melhor da pesquisa e tecnologia do Google, nossos produtos e serviços estão ajudando as organizações a transformar e resolver os problemas mais desafiadores do mundo real.   Comece                      a criar no Google Cloud com US$ 300 em créditos e mais de 20 produtos do programa                      Sempre gratuito.   Inicie seu                      próximo projeto, explore tutoriais interativos e gerencie sua                      conta. ", "url": "https://cloud.google.com/learn/artificial-intelligence-vs-machine-learning?hl=pt-br", "threshold": -0.9640544175754484}