{"title": "Infraestrutura global  |  Google Cloud", "content": "                            Os locais do Google Cloud sustentam                      todo o trabalho importante que fazemos para nossos clientes.                            Desde regiões redundantes de nuvem até alta                            conectividade de largura de banda via cabos submarinos,                            cada aspecto da nossa infraestrutura é projetado para que você                            possa oferecer seus serviços aos clientes, independentemente de onde                            estejam. A rede global de                            data centers do Google Cloud,                            capaz de executar                            seus serviços ininterruptamente com alta velocidade                            e confiabilidade, está entre as instalações mais seguras e de baixo consumo do mundo. Nossos data centers                            contam com segurança em camadas, tolerância a falhas e redundância                            integradas e acesso de funcionários rigorosamente limitado.                           Com uma rede                            de baixa latência e altamente provisionada, a mesma usada em                            produtos como Gmail, Pesquisa                            Google e YouTube, seu tráfego permanece no backbone                            privado do Google na maior                            parte do tempo, garantindo alto desempenho e uma experiência excelente                            ao usuário.   \"O PayPal processa              bilhões de transações em todo o mundo. Com o Google Cloud, temos              acesso a maior rede do mundo, que nos ajuda a alcançar nossas metas de              infraestrutura e a servir milhões de usuários com mais eficiência.   Sri              Shivananda, vice-presidente sênior e diretor de tecnologia do              PayPal  Protegemos seus dados usando                            camadas progressivas de infraestrutura                            que garantem proteção completa. A aderência                            do Google Cloud                            aos padrões                            de privacidade de dados                            e                            de segurança                            já conquistou a confiança de auditores de terceiros.                            Eles confirmaram que nossas operações e infraestrutura mantêm                            os dados do usuário mais seguros e em conformidade com as regras estabelecidas. Nossa arquitetura de rede e data centers é projetada para                            oferecer o máximo de confiabilidade e tempo de atividade. Suas                            cargas de trabalho ficam distribuídas com segurança em                            várias regiões, zonas de disponibilidade,                            pontos de presença                            e cabos de rede para que assim você possa contar com a disponibilidade de aplicativos e                            redundância robusta integrada. O Google compensa 100% da energia consumida pelas                            operações globais da empresa com o uso de energia                            renovável. Portanto, todo produto do Google Cloud usado por                            você tem emissão zero de carbono. Além disso, nossos data centers altamente                            eficientes usam 50% a menos de energia em comparação a maioria dos sistemas.                            Saiba mais sobre nosso                            compromisso com a sustentabilidade.                            Qual a                    solução que você procura? Um especialista do Google Cloud ajudará você a                    encontrar a melhor solução.   Qual a                    solução que você procura? Um especialista do Google Cloud ajudará você a                    encontrar a melhor solução. ", "url": "https://cloud.google.com/infrastructure?hl=pt-br", "threshold": 0.07198769026242502}