{"title": "Nuvem aberta  |  Google Cloud", "content": "Saiba como a nuvem aberta do Google atende às necessidades da sua                    organização fornecendo opções, flexibilidade e agilidade                    para acelerar os processos e impulsionar a transformação. A nuvem aberta do Google leva serviços do Google Cloud a                      diversas localidades físicas, como instalações no local,                      diversas nuvens públicas e dispositivos de borda, e, ao mesmo tempo, deixa a operação,                      a governança e a evolução dos serviços                      por conta do Google Cloud. Nossa abordagem de nuvem aberta                      possibilita o desenvolvimento de software                      mais rápido, uma maior facilidade na inovação e um escalonamento mais                      eficiente, além de reduzir o risco tecnológico.  Google                      Cloud adota código aberto.  #1  Colaborador de projetos de código                          aberto da CNCF  Fonte:                        Stackalytics A nuvem aberta depende do código aberto. Temos um longo                      histórico de                      liderança em código aberto de                      projetos como o Kubernetes, o TensorFlow e outros. O código                      aberto proporciona flexibilidade de implantação e, se                      necessário, de migração para cargas de trabalho essenciais dentro ou fora de                      plataformas de nuvem pública. Seus aplicativos estão em vários locais, e                        sabemos como é importante ter a liberdade para mantê-los nesses locais ou                        movê-los conforme necessário. O Anthos é uma                            plataforma de apps moderna                            que amplia as práticas de engenharia e os serviços                            do Google Cloud para ambientes híbridos e de várias nuvens. Ele oferece                            a portabilidade necessária para modernizar apps mais rapidamente e                            estabelecer consistência operacional entre                            eles. Você quer controle total sobre a infraestrutura e os dados                      sem deixar de usar as tecnologias do Google Cloud                      em qualquer lugar. A nuvem aberta ajuda você a gerenciar todos                      seus apps, tanto os legados quanto os nativos da nuvem, enquanto                      atende às suas                      necessidades de soberania.                            Com essa autonomia e controle, você continua tomando                      as decisões finais para atender seus requisitos de regulamentações e políticas. A nuvem aberta adota o ecossistema de parceiros em vez de                      competir com ele. Pensando nisso, oferecemos                      serviços gerenciados de código aberto operados pelos nossos parceiros,                      totalmente integrados ao Google Cloud e que proporcionam                      ao usuário uma experiência tranquila de gerenciamento, faturamento e suporte. Dessa forma                            nossos clientes empresariais têm mais facilidade para desenvolver com                            tecnologias de código aberto.  Qual a                    solução que você procura? Um especialista do Google Cloud ajudará você a                    encontrar a melhor solução.   Qual a                    solução que você procura? Um especialista do Google Cloud ajudará você a                    encontrar a melhor solução. ", "url": "https://cloud.google.com/open-cloud?hl=pt-br", "threshold": -0.7584835449587737}