{"title": "First Contact: Finland’s Framery reveals new office pod with in-person effect", "content": "We are officially 80% SOLD OUT! Secure your ticket today 🎟️ →                                             Andrii is the Head of Media at TNW, with over a decade of experience in covering the European tech ecosystem. Talk to him about new and exci                                                                                                                                                (show all)                                                                                            Andrii is the Head of Media at TNW, with over a decade of experience in covering the European tech ecosystem. Talk to him about new and exciting developments in tech, especially those involving vastly underreported industry niches and geographies.                                         If you’re working with other people — which most of us are — it’s quite likely that you’re spending a sizeable chunk of your time in meetings. Before COVID-19, you’d expect most meetings to be conducted in-person, and business travel was much more prolific than it is these days. The pandemic changed that dynamic beyond recognition, as startups and corporates alike suddenly discovered that a lot of things can actually be discussed and solved in a video call. Combined with people being generally reluctant to return to the office, this has ushered in an era of telepresence, where at least 84% of meetings (or even 98% depending on whom you’re listening to) have at least one remote participant. But spending a bulk of your meeting time looking at the screen is tiring, and the rapport established over a Zoom meeting is nothing like what you can expect in-person. In an attempt to address this issue, Finland-based office pod pioneer Framery has just unveiled Framery Contact, an indoor call booth aimed at emulating an IRL meeting as closely as possible. Most suitable for one-on-one meetings, the Contact is essentially a blacked out office pod with a large high-quality 4K screen, strategically positioned lighting, and a camera with a mirror system that gives the feeling of proper eye contact. Tickets are officially 80% sold out Don't miss your chance to be part of Europe's leading tech event A couple of weeks before the official unveiling, TNW (represented by yours truly) went to Tampere, Finland to experience the pod and learn more about Framery’s journey that led to its creation. (Disclosure: travel and accommodation for the trip were covered by Framery. The company had no editorial influence on this story and didn’t see it before publication.) Founded in 2010 in Tampere, about a two-hour drive north from Helsinki, Framery started as a passion project of two young guys whose manager had insisted on making loud sales calls in their open-plan office. One of the guys, the company’s CEO Samu Hällfors, says that the company became the world’s first and biggest producer of truly soundproof office pods. From the first one-person enclosure, Framery O, the startup has extended its offering over the years with the four-person Q and six-person 2Q models. In 2021, the company also presented Framery One, a version of the one-person pod with advanced connectivity options, built-in occupancy sensors, and calendar integration capabilities, which allowed booking it the same way you would a meeting room. Since then, the Finns have been hard at work on the software part of the product, aimed at providing insight into the pods’ usage for the HR or building managers. Going even further, the team is currently working on a project that would see a heart rate sensor integrated into the seat in the pod, which could potentially provide anonymised and aggregated data on the users’ health and mental well-being. The company, which currently employs some 400 people, saw €154 million in revenue in 2022. Back in 2018, Finnish private equity firm Vaaka Partners acquired 60% of Framery for an undisclosed amount. With the new office pod, Framery is definitely making a big bet on the importance its customers attach to the presence effect. Hällfors assumes that the first users of the product will be “international companies with offices on different continents;” having a Contact in each of them would supposedly make one-on-one meetings more engaging. Achieving the desired effect, however, is likely to take some time, as the tech may require some getting used to. Unlike Framery’s other pods, Contact has blackout glass walls, so entering it for the first time feels very unusual; it certainly did for me.  Inside the pod, I found a seat and a side table, as well as a small screen on the left-hand side where you can control the calling system. The pod’s software suite runs on Windows 10 IoT with the UI written using the Qt framework. Its custom architecture is based on Scalable Video Coding (SVC) and uses the H.265 compression standard. A portrait-oriented 4K screen occupies most of the pod’s wall in front of the user, with two bright lights to its sides. When Hällfors, who was in the US at the time of the test, called from another pod, I saw his image with proper depth right away, although some other people reported that it took them a couple of minutes to adjust. The reason is that Framery Contact isn’t using any sophisticated technologies like volumetric or light-field displays, opting for a normal 2D screen together with our own mental capabilities. “Removing the surroundings with black [backdrop] helps your brain to actually fill in the gaps and build this kind of 3D representation,” Hällfors explained. Framery Contact uses only one camera; Karvinen didn’t name the brand or model, but mentioned that it’s an off-the-shelf component rather than a custom-built device. The camera is clearly optimised to deliver the most crisp image when the person in the pod is sitting upright; if they lean forward or backward, however, their image on the screen quickly becomes a bit blurred. Combined with a mirror-based system that gives the illusion of eye contact and a seemingly decent audio setup in the soundproof booth, Framery Contact does feel much closer to an in-person experience. Although it supposedly only requires a bandwidth of 10Mbit/s to work, I was able to see a few stutters and jitters during the five-minute call, although the experience was hardly affected by them. At the moment, there are under a dozen Framery Contact booths in existence. Most of them are installed at the offices of the company’s unnamed pilot customers — and Framery is looking for more of those. As for commercial availability, Hällfors doesn’t expect it to happen before some time next year. The planned price for the new pod is around €24,000; for comparison, a Framery Q pod that the Contact is based on costs around €16,000. Framery’s unveiling comes just a few days after Google presented the latest update on its Project Starline, which uses several cameras and heavily relies on AI to create a 3D representation of the person you’re talking to on the screen. The obvious advantage of Google’s approach is that it doesn’t require a blacked out pod; the obvious issue, however, is that there’s no timeline on when it’d become commercially available. In addition, Google has continuously deflected questions about Skyline’s possible pricing, which suggests that it’s going to be sky-high indeed. In addition to corporate offices, Hällfors sees the Contact being used in industries like telehealth and recruitment among others. He also mentioned that the next step for the company will be to scale the technology to allow meetings with up to two people on each side. “I don’t think the Contact will replace all of our products, I don’t think the technology will be useful for all the use cases,” he said. “[Framery pods] are also used for in-person meetings, hybrid meetings, concentrated work, and so on.” Another feature to be added in the future is interoperability with traditional video conferencing services like Google Meet, Zoom, or Microsoft Teams to allow a one-to-many usage scenario. According to Hällfors, it’s not a particularly difficult task from a technological standpoint; the biggest obstacle at this point is that none of those apps support 4K video, which is paramount for the product. All in all, Framery Contact is an impressive feat of engineering that could signify a new technological trend and bring our expectations for online meetings to a new level. It’s not quite clear, however, how much is too much when it comes to creating a real-life feeling. In the meantime, look out for those black-glass booths in a corporate office near you to answer this question for yourself. Get the TNW newsletter Get the most important tech news in your inbox each week. The heart of tech                     Copyright © 2006—2023, The Next Web B.V.                    Made with <3 in Amsterdam.                    ", "url": "https://thenextweb.com/news/first-contact-framery-reveals-new-office-pod-in-person-effect", "threshold": 0.9958068521624561}