{"title": "Wikipedia, the free encyclopedia", "content": "Other reasons this message may be displayed: An enzyme inhibitor is a molecule that binds to an enzyme's active site, or another site on the enzyme, and blocks the enzyme's catalysis of the reaction. Enzyme inhibitors are generally specific to one enzyme and control that enzyme's activity. They also control essential enzymes such as proteases or nucleases that, if left unchecked, may damage a cell. Many poisons produced by animals or plants are enzyme inhibitors, and many drug molecules are enzyme inhibitors that inhibit an aberrant human enzyme or an enzyme critical for the survival of a pathogen. Since anti-pathogen inhibitors generally target only one enzyme, such drugs are highly specific and generally produce few side effects in humans. Medicinal enzyme inhibitors often have low dissociation constants, meaning a minute amount of the inhibitor will inhibit the enzyme. The discovery of enzyme inhibitors and their refinement are researched in biochemistry and pharmacology. (Full article...) March 28 Amilcare Ponchielli (1834–1886) was an Italian composer. Born in Paderno Fasolaro (now Paderno Ponchielli) near Cremona, then Kingdom of Lombardy–Venetia, Ponchielli won a scholarship at the age of nine to study music at the Milan Conservatory, writing his first symphony by the time he was ten years old. He is best known for his operas, most notably La Gioconda, the third and most successful version of which debuted at La Scala in Milan on 28 March 1880. The Dance of the Hours from that opera is widely known thanks in part to its use in Walt Disney's Fantasia in 1940 and in Allan Sherman's novelty song \"Hello Muddah, Hello Fadduh\". In 1881, Ponchielli was appointed the maestro di cappella of Bergamo Cathedral and a professor of composition at the Milan Conservatory, where his pupils included Giacomo Puccini, Pietro Mascagni, Emilio Pizzi, and Giovanni Tebaldini. He was married to the soprano Teresina Brambilla and died at the age of 51 in Milan. This formal photographic portrait of Ponchielli was taken in Milan and is in the archives of the music publisher Casa Ricordi. Photograph credit: Icilio Calzolari; restored by Adam Cuerden Wikipedia is written by volunteer editors and hosted by the Wikimedia Foundation, a non-profit organization that also hosts a range of other volunteer projects: This Wikipedia is written in English. Many other Wikipedias are available; some of the largest are listed below.", "url": "https://en.wikipedia.org/wiki/Main_Page"}