{"title": "The best robot vacuums for 2023 | Engadget", "content": "Robot vacuums have come a long way over the past few years. They’re smarter, more powerful and (marginally) better at avoiding chair legs than they ever were before, and some of them even have built-in mopping functionality and a penchant for pet hair. Plus, you don’t have to shell out as much money to get one either. It’s safe to say the space is pretty saturated now, with established names like iRobot and Shark competing with companies like Anker and TP-Link that are not necessarily known for their dirt-sucking tech. With all those choices, deciding which to buy isn’t as simple as it was a few years ago. We tested out many of the newest models available now to see how they stack up against each other and to help you choose the best robot vacuums for your needs.                        Quick Overview                    Best midrange robot vacuumShark AI Ultra Robot Vacuum$445                        $445 at Amazon                                    $445 at Amazon            Runner-up midrangeiRobot Roomba j7$544                        $544 at Amazon                                    $544 at Amazon            Honorable mentionAnker Eufy RoboVac X8 Hybrid$320                        $320 at Amazon                                    $320 at Amazon            Best robot vacuum and mopiRobot® Roomba Combo j7+$1,100                        $1,100 at Amazon                                    $1,100 at Amazon            Runner up robot vacuum and mopShark AI Ultra 2-in-1 Robot Vacuum & Mop$520                        $520 at Amazon                                    $520 at Amazon            Best premium robot vacuumiRobot Roomba s9+$955                        $955 at Amazon                                    $955 at Amazon            Honorable mentionRoborock S7+$950                        $950 at Amazon                                    $950 at Amazon            Best budget robot vacuumiRobot Roomba 694$250                        $250 at Amazon                                    $250 at Amazon            See 3 more We tackled this question when we reviewed budget robot vacuums and the answer is yes, especially if vacuuming is one of your least favorite chores. Robots take the hard work out of cleaning your floors – just turn the thing on and watch it go. Any robot vacuum cleaner worth buying is semi-autonomous in that it will suck up dirt around your home until its battery is low and then make its way back to its charging dock. You should only have to interact with it to turn it on, empty its dustbin and untangle it if it were to get stuck somewhere. That’s not to say robot vacuums are perfect. They’re almost always less powerful and less flexible than standard vacuums. Since most robo-vacs are much smaller than traditional models, they often don’t have the same level of suction you’ll get in an upright machine. Plus, their dustbins are smaller, so they will need to be emptied more frequently. While WiFi-connected robot vacuums give you the flexibility to start a cleaning job from anywhere using an app, targeting a small area of your home can be more complicated. Some robo-vacs have spot-cleaning features that focus the machine’s attention on a specific area, which almost – but not quite – mimics the spot-cleaning you’d be able to do yourself with a regular or cordless vacuum. As we explained in our budget guide, WiFi is a key feature for most robot vacuums. Some of the affordable devices aren’t WiFi connected, though, so it’s best to double check before you buy cheap. WiFi lets a robot vacuum cleaner do things like communicate with a mobile app, which then allows you to control the device from your phone. Suction power is another important factor to consider. Unfortunately, there isn’t a standard power scale that all robo-vacs adhere to, so it’s difficult to compare among a bunch of devices. Some companies provide Pascal (Pa) levels and generally the higher the Pa, the stronger the vacuum cleaner will be. But other companies don’t rely on Pa and simply say their robots have X-times more suction than other robots. Ultimately, we recommend thinking first about the floors in your home: Do you have carpet throughout, or tile and hardwood floors, or a mix? Robots with stronger suction power will do a better job cleaning carpets as they can get into the nooks and crannies more easily. Some machines have “max” modes as well, which ups the suction power but also typically eats at battery life faster than the “normal” cleaning mode. Past a certain price threshold, you’ll find advanced features like home mapping, improved object detection and automatic dustbin disposal. Home mapping is exactly what it sounds like: The vacuum uses sensors to map your home’s layout as it cleans, allowing you to send it to particular rooms or areas. Most robo-vacs have object detection, but some will be better than others at actually avoiding things like chair legs and children’s toys. Higher-end models like iRobot’s j7 series even go so far as to promise obstacle avoidance to steer clear of things like pet poop that can potentially ruin your machine. We’re also now starting to see more robot vacuums with mopping capabilities. Machines with this feature have a water reservoir either built into the robot’s chassis or as a separate piece that you swap in for the dustbin when you want to mop your floors. It makes the robo-vac more useful if you have hard flooring in your home that you like to keep squeaky clean, but it does require more work on your part. Filling and emptying the reservoir remains a human’s job. Finally, for peak convenience, consider a robot vacuum that comes with a self-emptying base. These are basically garbage bins attached to the machine’s charger. At the end of each job, the robo-vac automatically empties its small dustbin into the large clean base – that means you won’t have to empty the dustbin yourself and you’ll only have to tend to the base once every few weeks. Just keep in mind that most self-cleaning bases require proprietary garbage bags – another long-term expense you’ll have to factor in. Also, any vac-and-mop robot with a water tank will not dump its dirty water into the clean base, so you’ll still have to clean that yourself. Best midrange robot vacuumSharkShark AI Ultra Robot VacuumShark's robo-vac ticks most of the boxes you'd expect in a midrange machine: it offers reliable cleaning performance, its mobile app is easy to use and it produces accurate home maps.                     $445 at Amazon                                        $445 at Target                 Shark's robo-vac ticks most of the boxes you'd expect in a midrange machine: it offers reliable cleaning performance, its mobile app is easy to use and it produces accurate home maps.  Shark’s RV2502AE AI robot vacuum with Base ticks all of the boxes that a mid-range machine should. It offers reliable cleaning performance, its mobile app is easy to use and it produces accurate home maps. On top of that, its base is bagless, which means you won’t have to spend money every few months on garbage bags for your robotic vacuum. Setting up the Shark is as simple as taking it and its base out of the box, plugging the base in and downloading the companion mobile app to finish things up. The machine connects to WiFi, allowing you to control it via the app when you’re not at home, or using Google Assistant and Alexa voice commands. The first journey the Shark makes is an “Explore Run,” during which it produces a map of your home that you can then edit from the mobile app. The Shark produced a pretty accurate floorplan of my two-bedroom apartment, and I was happy to see a “re-explore” option that I could use if the map wasn’t up to my standards. With a completed map, you’re then asked to label rooms in your home. That way, you can send the Shark to only the bedroom for more direct cleaning jobs, select “no-go” zones and more. The first few times I ran the Shark robot, I had it clean my whole apartment. I was impressed by how quiet it was – or rather, how much quieter it was compared to other robo-vacs I’ve tried. You’ll have to turn up the volume on your TV if it’s cleaning in the same room, but it’ll be hard to hear when it’s sucking up debris down the hallway. It also did a decent job maneuvering its way around the cat toys I left out on the floor. The device’s object detection feature claims it can avoid things as small as four inches, but I found that it was much better at sensing and moving around the three-foot-long cat tunnel on my floor than the many tiny mouse toys. But even if Mr. Mouse caught the edge of the Shark’s wheels now and then, the robo-vac took it all in stride. One thing I look for when testing robot vacuums is how much attention they need from me during cleanings. The best ones require no extra attention at all – once they start a job, they’re smart enough to putter around your home, move around objects and return to their base when they’re finished. With Shark’s robo-vac, I never had to tend to it when it was cleaning. Now, I did my due diligence and picked up pieces of clothing and charging cables off the ground before running the Shark (ditto for every other robot vacuum I tested), so those things were never in the way. Most companion apps will actually remind you to do this before starting a cleaning job. This Shark machine comes with a clean base, so it will empty its dustbin after every job – and also during a job if its bin gets full before it’s done. In the latter situation, the Shark will go back to cleaning automatically after it’s freed up its bin. That’s a great feature, but I found the best thing about the base to be its bagless design. Shark’s device is unlike most other robot vacuum clean bases because you don’t have to keep buying proprietary garbage bags to outfit the interior of the base. When you want to empty the base, part of it snaps off and opens to eject debris, and it easily locks back in place when you return it. Not only is this quite convenient, but it also brings the lifetime cost of ownership down since you won’t be buying special bags every few months. Its worth noting that Shark has a couple of models that are similar to the RV2502AE that just have a different color scheme, a 30- versus 60-day clean base capacity and other minor differences. The biggest feature that would impact how you use the machine is the clean base capacity: we recommend springing for the 60-day models if you want to interact as little as possible with your robo-vac. Runner-up midrangeiRobotiRobot Roomba j7The biggest selling point of the Roomba j7 series is its upgraded AI-driven computer vision which helps it detect and move around objects, including pet waste.                    $544 at Amazon                                        $600 at iRobot                 The biggest selling point of the Roomba j7 series is its upgraded AI-driven computer vision which helps it detect and move around objects, including pet waste. Not much has changed since Amazon bought iRobot a little while back – the Roomba j7 remains a great option if you want the latest obstacle avoidance technology from the company in an attractive package. The $600 j7 doesn’t come with a clean base, but you can get the same vacuum with one for $200 extra. The biggest selling point of the Roomba j7 series is its upgraded AI-driven computer vision which helps it detect and move around objects. This includes pet poop – a robot vacuum’s arch nemesis – and iRobot even promises that it will replace your j7 machine if it runs into pet poop within the first year of ownership. That’s one feature I was happy I never got to test while reviewing this Roomba, as my cat kept all of her activity to her litter box. Otherwise, the Roomba j7 did a good job sucking up dirt and debris around my apartment and it didn’t make too much noise while doing so. All of the robo-vacs I tested at this mid-range level had roughly the same level of suction, so there wasn’t a big difference between them when it came to cleaning power. Like other robot vacuums, you can set cleaning schedules in the iRobot mobile app so you never have to start a cleaning job on the fly. The app also has a “favorites” section, which lets you create profiles that you’ll use all the time like “clean the living room and the entryway.” And if you prefer to use voice commands, the robot supports Amazon’s Alexa and the Google Assistant. The Roomba j7 has Imprint Smart Mapping, but unlike the Shark, it took more than one runthrough of my home for it to create a complete map. iRobot’s app distinguishes between a regular cleaning job and a “mapping run,” so make sure you’re choosing the latter the first few times you run the machine. I tested the j7+, which means I was treated to the roaring sounds of the machine emptying its dustbin into its clean base. The emptying process isn’t as simple as an automatically opening flat that shakes dirt from one garbage can to another – the base actually sucks the dirt from vacuum. This was the case for all of the machines I tried that came with clean bases; they’re all quite loud, but the Roomba j7+ was the loudest of them all. The whooshing sounds last for only five to 10 seconds, but it was shocking the first time it happened. Just keep that in mind if you ever decide to run your self emptying robot vacuum at night when others are sleeping. Honorable mentioneufyAnker Eufy RoboVac X8 HybridThis hybrid machine has both a dustbin for collecting debris and a 250-milliliter water tank that you can fill whenever you want to run a mopping cycle.                    $320 at Amazon                                        $550 at Anker                 This hybrid machine has both a dustbin for collecting debris and a 250-milliliter water tank that you can fill whenever you want to run a mopping cycle. You may be unfamiliar with Anker’s robot vacuums, but they’re often more affordable alternatives to the iRobots and Sharks of the world. The Eufy RoboVac X8 Hybrid isn’t a budget machine by any means, but it’s a solid robot vacuum that offers a few key features that many competitors don’t have. Plus, you can often find it on sale for $549 or even $449. Unlike our other midrange picks, the X8 Hybrid doesn’t come with a clean base, nor is there one you can purchase separately. It’s just a standalone robo-vac, but the “hybrid” indicates that it’s also a robot mop. It has both a dustbin for collecting debris and a 250-milliliter water tank that you can fill whenever you want to run a mopping cycle. Plenty of other robot vacuums have this feature, and it could be even more useful than a clean base if you have lots of tile or hardwood floors throughout your home. Besides that, I was impressed with how easy it was to set up the X8 Hybrid, how accurate its mapping technology was and how many extra features it supports. It has four cleaning modes – auto, room, zone and spot – and four suction levels starting with Pure at the low end and topping out at Max. These features give you a lot of control over where the machine cleans and how powerfully it will do so. The X8 Hybrid was in Pure mode the first time I ran it, and I was surprised by not only how quiet it was but also how thoroughly it cleaned considering it was on the lowest suction setting. There’s also a “tap and go” feature that lets you pinpoint any spot on your home map in the EufyHome app, sending the robot there to clean. Manual controls are also available, which isn’t something you see on a ton of robo-vacs. This option lets you control the machine almost like a slow and slightly clumsy RC car, giving you more control over where it cleans. It may not have the name recognition that iRobot or Shark do, but the Eufy RoboVac X8 Hybrid is a solid choice nonetheless, especially if you don’t care to add a clean base into the mix. It’s an even more tempting choice if you can snag it when it’s discounted. Best robot vacuum and mopiRobotiRobot® Roomba Combo j7+This machine offers an elegant solution to what usually is a more manual process of instructing the robot vacuum where to mop and where to actually vacuum.                     $1,100 at Amazon                                        $1,100 at iRobot                 This machine offers an elegant solution to what usually is a more manual process of instructing the robot vacuum where to mop and where to actually vacuum.  Vac-and-mop devices aren’t new, but they are new to iRobot’s lineup and the company made a great one in the Roomba j7+ Combo. This machine offers an elegant solution to what usually is a more manual process of instructing the robot vacuum where to mop and where to actually vacuum. The 2-in-1 version of the Roomba j7+ has a mop pad built in that only flips down when the machine senses that it’s rolling over hard flooring, dispensing water and cleaning solution before lighting scrubbing your floors. When it’s on carpet, it’ll act like a standard robot vacuum. Arguably the most compelling reason to get a robot vacuum at all is convenience, and iRobot managed to figure out how to incorporate mopping into an already stellar robot vacuum without removing any convenience. Sure, you have to add water and cleaning solution when you want to mop, and dispose of the remnants when it’s finished, but that’s about it. The Roomba has enough smarts to take care of the rest, without accidentally dampening your carpet along the way. The included clean base still comes in handy as it will suck up the vacuumed debris that the robot catches, but just know that it will not take care of excess water for you. Aside from the adding mopping abilities, the Combo is basically just a Roomba j7+ and that’s not a bad thing. It’s been one of our favorite robot vacuums since it came out thanks to its improved obstacle avoidance, strong suction power, accurate home mapping technology and decent battery life. The iRobot mobile app, from which you can start and schedule jobs, edit your home map and more, is easy to use, and you can even control the machine using Alexa or Google Assistant commands. The hardest thing to swallow about it (besides how it sounds like a jet engine when emptying debris into the clean base) is its sky-high, $1,100 price tag. Runner up robot vacuum and mopSharkShark AI Ultra 2-in-1 Robot Vacuum & MopThe main reason why Shark’s machine is our runner-up is its more manual nature: it comes with two dustbins, one for vacuuming only and one for vacuuming and mopping that has a water reservoir and a detachable mop pad.                    $520 at Amazon                                        $700 at Shark                 The main reason why Shark’s machine is our runner-up is its more manual nature: it comes with two dustbins, one for vacuuming only and one for vacuuming and mopping that has a water reservoir and a detachable mop pad. The main reason why Shark’s machine is our runner-up pick is its more manual nature. It comes with two dustbins, one for vacuuming only and one for vacuuming and mopping that has a water reservoir and a detachable mop pad. You have to switch to the appropriate dustbin when you want to mop your floors, and after each job, the dustbin will not automatically empty into the clean base since it has the reservoir in it. You’ll have to manually empty it instead, but you would have to do that anyway to clean and refill the water tank in preparation for the next job. Despite being a more hands-on machine, Shark’s robotic vac and mop was a pleasure to review. Setting it up was as quick and simple as one of the company’s standard robot vacuums, and its first run will create a map of your home, which you can then label with room names, edit with no-go zones and carpeted areas and more. You can even choose to have the robot do a dry run first before doing any actual mopping, so you can make sure it doesn’t enter into the carpeted areas you’ve indicated in your home map. In my testing, the robot accurately stayed away from these zones that I set and I actually like having that little bit of extra control over where the machine goes. But of course, that’s just another thing you have to do manually that iRobot’s vac and mop takes care of using built-in tech. The Shark’s water–and-solution based cleaning abilities are basic but much better than having to schlep out an old-school mop and bucket yourself. My mix of hardwood and tile floors appeared noticeably cleaner after the Shark passed over them with its mopping pad. I know I’ll have to whip out my floor steamer every once in a while to really get a deep clean, but the Shark’s capabilities are more than enough for biweekly runs – and it’s hard to beat the convenience of not having to do it yourself. Shark’s machine has a few other things going for it, too: the clean base is bagless, which means you won’t have to shell out more money over time for proprietary garbage bags like you will have to with iRobot machines; its mobile app remains easy to use and one that newbies will be able to pick up quickly; and, maybe most importantly, this device comes in at $700. That’s still a good chunk of change, but it’s a far-cry cheaper than the Roomba j7+ Combo. Best premium robot vacuumiRobotiRobot Roomba s9+The Roomba s9+ is admittedly overkill for most people – but it’s nothing if not one of the best robot vacuums out there.                     $955 at Amazon                                        $955 at iRobot                 The Roomba s9+ is admittedly overkill for most people – but it’s nothing if not one of the best robot vacuums out there.  The Roomba s9+ is admittedly overkill for most people – but it’s nothing if not one of the best robot vacuums out there. You’ll notice its premium features as soon as you unbox it. The s9+ is the biggest but also the most attractive robo-vac I tried, with a corner-friendly design, copper accents and a 1.5-foot tall clean base. The setup was quick and easy, with the machine taking only a few minutes to connect to my home’s WiFi and the iRobot app. While the s9+ doesn’t have the Precision Navigation feature that the newer j7 does, it has something called “Careful Driver” that uses a 3D sensor to detect and clean around objects. It seems that the main difference is that the s9+ isn’t specifically wired to avoid pet poop, so keep that in mind if you have furry friends around the house. However, with 40x the suction power of a standard Roomba, the s9+ does a great job cleaning up pet hair. It’s also louder than the j7 when it’s cleaning, but not irritatingly so, and I noticed a deeper clean in my carpets thanks to the extra suction. And it changes its cleaning mode automatically when transitioning from, say, carpeting to a hardwood floor. Even this $1,000 robot vacuum bumped into a few table legs while cleaning, but it was noticeably better than other machines at navigating around my furniture and correcting itself when it got stuck. It also moves faster than the j7, so it was able to cover a bit more of my apartment before it had to return to the base for charging after about one hour of cleaning. I was also pleasantly surprised to find that the s9+ wasn’t nearly as loud as the j7 vacuum when emptying its dustbin into the clean base. With the iRobot app experience being the same across all Roombas, the s9+ stands out for its subtle premium features like its elegant design, elegant-looking clean base, superior cleaning intelligence and top-of-the-line suction power. Aside from the extra suction, those are all nice-to-haves rather than must-haves, so most people – including you! – probably don’t need the Roomba s9+. It’s the fanciest robot vacuum iRobot has to offer, but you’ll get a similar level of quality with the Roomba j7 while spending a couple hundred bucks less. Honorable mentionRoborockRoborock S7+This vac-and-mop combo deserves a mention for its good cleaning performance, zone targeting, child lock and other extra features.                    $950 at Amazon                 This vac-and-mop combo deserves a mention for its good cleaning performance, zone targeting, child lock and other extra features. Roborock’s high-end S7+ deserves a mention for its cleaning power and number of additional features that many other competitors don’t have. First, the S7+ is a vac-and-mop combo, and its mopping map automatically lifts itself out of the way when the machine reaches the carpet. That means you can have it clean your whole home, vacuuming and mopping in the right spots, without you giving it any extra attention (besides filling its 300ml water tank at the start). The expensive machine has a longer setup process because its clean base comes in two pieces. You must attach the bottom of the base, where the robo-vac charges, to the garbage-bin upper portion using a few screws and a tool that attaches to the bottom of the base. Roborock provides everything you need to do this in the box, so while it takes a bit more time, it’s still an easy process. What wasn’t so easy for me at first was connecting the S7+ to the Roborock app. The vacuum had trouble connecting to my home’s WiFi network, but I was able to connect it to the Mi Home app, which is Xiaomi’s main smart home companion app (Xiaomi is an investor in Roborock). There aren’t a ton of differences between the two apps when it comes to robo-vac controls, but the S7+ is designed to work with Roborock’s program. After troubleshooting with a Roborock representative, I was able to fix the problem by factory resetting the vacuum and that allowed me to connect it to the Roborock app properly. That said, the Roborock app isn’t nearly as polished as those from iRobot, Shark and others. The main page shows your home’s map along with the battery level, cleaning time, cleaning area in feet, and buttons that let you quickly start a cleaning job and empty the dustbin. You’re also able to select specific rooms or zones to clean, but the rest of the control options live in the menu accessible by the three-dot icon at the top-right corner of the app. Things are a little buried, and that might make the S7+ harder for robot-vacuum newbies to use. When it comes to cleaning performance, the Roborock S7+ did a great job sucking up dirt around my home. In addition to the usual features like cleaning schedules, zone targeting and others, the vacuum also has things like child lock, which will disable the physical buttons on the machine; different auto-emptying settings to choose from; “pin and go,” which lets you tap on your home map to send the robot to a specific location; and manual direction controls so you can move the machine like a toy car. This isn’t the robot vacuum to get if you want the most polished experience – and you may very well want that if you’re dropping $1,000 on one – but it remains a powerful vac-and-mop machine with a handful of extra perks. Best budget robot vacuumiRobotiRobot Roomba 694The Roomba 694 is a great option for most people thanks to its good cleaning power and easy-to-use mobile app.                    $250 at Amazon                                        $275 at iRobot                 The Roomba 694 is a great option for most people thanks to its good cleaning power and easy-to-use mobile app. iRobot’s $279 Roomba 694 is a great option for most people thanks to its good cleaning power and easy-to-use mobile app. We won’t get too deep into it here since we have a whole guide to affordable robot vacuums with additional recommendations. But suffice to say, the 694 gives you all the essentials you’d expect from a robot vacuum, along with all of the convenience that comes with iRobot’s mobile app.", "url": "https://www.engadget.com/best-robot-vacuums-130010426.html", "threshold": 0.9999999999994276}