{"title": "Overview | Uranus – NASA Solar System Exploration", "content": "Uranus is the seventh planet from the Sun, and has the third-largest diameter in our solar system. It was the first planet found with the aid of a telescope, Uranus was discovered in 1781 by astronomer William Herschel, although he originally thought it was either a comet or a star. It was two years later that the object was universally accepted as a new planet, in part because of observations by astronomer Johann Elert Bode. Herschel tried unsuccessfully to name his discovery Georgium Sidus after King George III. Instead, the scientific community accepted Bode's suggestion to name it Uranus, the Greek god of the sky, as suggested by Bode.​ Everything you need to know about Uranus. Uranus In Depth  Uranus is about four times wider than Earth. If Earth were a large apple, Uranus would be the size of a basketball. Uranus orbits our Sun, a star, and is the seventh planet from the Sun at a distance of about 1.8 billion miles (2.9 billion kilometers). Uranus takes about 17 hours to rotate once (a Uranian day), and about 84 Earth years to complete an orbit of the Sun (a Uranian year). Uranus is an ice giant. Most of its mass is a hot, dense fluid of \"icy\" materials – water, methane and ammonia – above a small rocky core. Uranus has an atmosphere made mostly of molecular hydrogen and atomic helium, with a small amount of methane. Uranus has 27 known moons, and they are named after characters from the works of William Shakespeare and Alexander Pope. Uranus has 13 known rings. The inner rings are narrow and dark and the outer rings are brightly colored. Voyager 2 is the only spacecraft to fly by Uranus. No spacecraft has orbited this distant planet to study it at length and up close. Uranus cannot support life as we know it. Like Venus, Uranus rotates east to west. But Uranus is unique in that it rotates on its side.  Uranus is the source of more than a few jokes and witty (and not so witty) puns, but the ice giant and its moons has been a serious destination various fictional stories, and on TV shows such as \"Doctor Who.\" The radioactive element uranium was named after Uranus when it was discovered in 1789, just eight years after the planet was discovered.  Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: May 15, 2023", "url": "https://solarsystem.nasa.gov/planets/uranus/overview", "threshold": 0.8747028740365339}