{"title": "Overview | Venus – NASA Solar System Exploration", "content": "Venus is the second planet from the Sun and is Earth’s closest planetary neighbor. It’s one of the four inner, terrestrial (or rocky) planets, and it’s often called Earth’s twin because it’s similar in size and density. These are not identical twins, however – there are radical differences between the two worlds. Venus has a thick, toxic atmosphere filled with carbon dioxide and it’s perpetually shrouded in thick, yellowish clouds of sulfuric acid that trap heat, causing a runaway greenhouse effect. It’s the hottest planet in our solar system, even though Mercury is closer to the Sun. Surface temperatures on Venus are about 900 degrees Fahrenheit (475 degrees Celsius) – hot enough to melt lead. The surface is a rusty color and it’s peppered with intensely crunched mountains and thousands of large volcanoes. Scientists think it’s possible some volcanoes are still active. Venus has crushing air pressure at its surface – more than 90 times that of Earth – similar to the pressure you'd encounter a mile below the ocean on Earth. Another big difference from Earth – Venus rotates on its axis backward, compared to most of the other planets in the solar system. This means that, on Venus, the Sun rises in the west and sets in the east, opposite to what we experience on Earth. (It’s not the only planet in our solar system with such an oddball rotation – Uranus spins on its side.) Venus was the first planet to be explored by a spacecraft – NASA’s Mariner 2 successfully flew by and scanned the cloud-covered world on Dec. 14, 1962. Since then, numerous spacecraft from the U.S. and other space agencies have explored Venus, including NASA’s Magellan, which mapped the planet's surface with radar. Soviet spacecraft made the most successful landings on the surface of Venus to date, but they didn’t survive long due to the extreme heat and crushing pressure. An American probe, one of NASA's Pioneer Venus Multiprobes, survived for about an hour after impacting the surface in 1978. More recent Venus missions include ESA’s Venus Express (which orbited from 2006 until 2016) and Japan’s Akatsuki Venus Climate Orbiter (orbiting since 2016). NASA’s Parker Solar Probe has made multiple flybys of Venus. On Feb. 9, 2022, NASA announced the spacecraft had captured its first visible light images of the surface of Venus from space during its February 2021 flyby. In June 2021, three new missions to Venus were announced. NASA announced two new missions, and ESA announced one: Everything you need to know about Venus. Venus In Depth  Venus is often called \"Earth’s twin\" because they’re similar in size and structure, but Venus has extreme surface heat and a dense, toxic atmosphere. If the Sun were as tall as a typical front door, Earth and Venus would each be about the size of a nickel. Venus is the second closest planet to the Sun, orbiting at a distance of about 67 million miles (108 million kilometers) Venus rotates very slowly on its axis – one day on Venus lasts 243 Earth days. The planet orbits the Sun faster than Earth, however, so one year on Venus takes only about 225 Earth days, making a Venusian day longer than its year! Venus has a solid surface covered in dome-like volcanoes, rifts, and mountains, with expansive volcanic plains and vast, ridged plateaus. The average surface of Venus is less than a billion years old, and possibly as young as 150 million years old – which is relatively young from a geological perspective. This is a major conundrum for scientists – they don’t know exactly what happened that made Venus completely resurface itself. Venus’ thick atmosphere traps heat creating a runaway greenhouse effect – making it the hottest planet in our solar system with surface temperatures hot enough to melt lead. The greenhouse effect makes Venus roughly 700°F (390°C) hotter than it would be without a greenhouse effect. Venus is permanently shrouded in thick, toxic clouds of sulfuric acid that start at an altitude of 28 to 43 miles (45 to 70 kilometers). The clouds smell like rotten eggs! Venus was the first planet explored by a spacecraft and was intensely studied early in the history of space exploration. Venus was also the first planet whose surface was reached by a spacecraft from Earth. The intense heat means landers have only survived for a couple of hours. Venus is an unlikely place for life as we know it, but some scientists theorize microbes might exist high in the clouds where it’s cooler and the pressure is similar to Earth’s surface. Phosphine, a possible indicator of microbial life, has been observed in the clouds. Venus rotates backward on its axis compared to most planets in our solar system. This means the Sun rises in the west and sets in the east, opposite of what we see on Earth.  Because it’s so bright and easy to see in the sky, Venus has played a role in popular culture since ancient times, inspiring writing and song: It was called the most beautiful star in the sky by Homer, author of \"The Iliad\" and \"The Odyssey\" – two of the oldest and most important works in Greek literature. More recently, Venus became a popular venue for 20th-century science fiction writers, including Edgar Rice Burroughs (“Pirates of Venus,” 1934); Arthur C. Clarke (“Before Eden,” 1961); and C.S. Lewis (“Perelandra,” 1943). Australian author Shirley Hazzard won the 1980 National Book Critics Circle Award for fiction with her book, “The Transit of Venus,” about two orphaned sisters. American author John Gray used the planet and its masculine counterpart to explain relationships in his 1992 book “Men Are From Mars, Women Are From Venus.” A song called “Venus” was teen idol Frankie Avalon’s first No. 1 hit when it topped the Billboard Hot 100 chart in 1959. A decade later, a different song called “Venus\" by the Dutch rock band Shocking Blue topped the charts in several countries. In 1986, British pop group Bananarama had a No. 1 hit in the U.S. with their cover of the song. More recently, Venus has been a backdrop for video games such as Transhuman Space, Battlezone, and Destiny. And in the Disney animated film “The Princess and the Frog,” Ray the firefly falls in love with Venus, “the evening star,” as he has mistaken it for another firefly.  Venus is the second planet from the Sun and Earth’s closest planetary neighbor. Even though Mercury is closer to the Sun, Venus is the hottest planet in our solar system. Its thick atmosphere is full of the greenhouse gas carbon dioxide, and it has clouds of sulfuric acid. The atmosphere traps heat, making it feel like a furnace on the surface. It’s so hot on Venus, the metal lead would melt. Venus is sometimes called Earth’s twin because it’s similar in size and structure, but the planets are very different in other ways. In addition to being extremely hot, Venus is unusual because it spins in the opposite direction of Earth and most other planets. It also has a very slow rotation making its day longer than its year. Visit NASA Space Place for more kid-friendly facts.  Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: May 15, 2023", "url": "https://solarsystem.nasa.gov/planets/venus/overview", "threshold": 0.9997255643169036}