{"title": "Overview | Mercury – NASA Solar System Exploration", "content": "The smallest planet in our solar system and nearest to the Sun, Mercury is only slightly larger than Earth's Moon. From the surface of Mercury, the Sun would appear more than three times as large as it does when viewed from Earth, and the sunlight would be as much as seven times brighter. Despite its proximity to the Sun, Mercury is not the hottest planet in our solar system – that title belongs to nearby Venus, thanks to its dense atmosphere. Because of Mercury's elliptical – egg-shaped – orbit, and sluggish rotation, the Sun appears to rise briefly, set, and rise again from some parts of the planet's surface. The same thing happens in reverse at sunset. Everything you need to know about Mercury. mercury in depth  Mercury is the smallest planet in our solar system – only slightly larger than Earth's Moon.  Mercury is the planet that orbits the closest to the Sun. Mercury is the fastest planet in our solar system – traveling through space at nearly 29 miles (47 kilometers) per second. The closer a planet is to the Sun, the faster it travels. Since Mercury is the fastest planet and has the shortest distance to travel around the Sun, it has the shortest year of all the planets in our solar system – 88 days. Mercury is a rocky planet, also known as a terrestrial planet. Mercury has a solid, cratered surface, much like the Earth's moon. Mercury's thin atmosphere, or exosphere, is composed mostly of oxygen (O2), sodium (Na), hydrogen (H2), helium (He), and potassium (K).  Mercury has no moons.  There are no rings around Mercury.  It is unlikely that life as we know it could survive on Mercury due to solar radiation, and extreme temperatures. Standing on Mercury's surface at its closest approach to the Sun, our star would appear more than three times larger than it does on Earth. Two NASA missions have explored Mercury: Mariner 10 was the first to fly by Mercury, and MESSENGER was the first to orbit. ESA's BepiColombo is on its way to Mercury.  The smallest planet in our solar system has a big presence in our collective imagination. Scores of science fiction writers have been inspired by Mercury, including Isaac Asimov, C. S. Lewis, Ray Bradbury, Arthur C. Clarke, and H. P. Lovecraft. Television and film writers, too, have found the planet an ideal location for storytelling. In the animated television show \"Invader Zim,\" Mercury is turned into a prototype giant spaceship by the extinct Martians. And in the 2007 film \"Sunshine,\" the Icarus II spacecraft goes into orbit around Mercury to rendezvous with the Icarus I. In the comic strip \"Calvin and Hobbes,\" Calvin and his classmate Susie give a presentation about Mercury, in which Calvin's contribution is full of questionable information: \"The planet Mercury was named after a Roman god with winged feet,\" says Calvin. \"Mercury was the god of flowers and bouquets, which is why today he is a registered trademark of FTD florists. Why they named a planet after this guy, I can't imagine.\"  Mercury is the smallest planet in our solar system. It’s a little bigger than Earth’s Moon. It is the closest planet to the Sun, but it’s actually not the hottest. Venus is hotter. Along with Venus, Earth, and Mars, Mercury is one of the rocky planets. It has a solid surface that is covered with craters like our Moon. It has a thin atmosphere, and it doesn’t have any moons. Mercury likes to keep things simple. Mercury spins slowly compared to Earth, so one day lasts a long time. Mercury takes 59 Earth days to make one full rotation. But a year on Mercury goes fast. Because it’s the closest planet to the sun, it goes around the Sun in just 88 Earth days. Visit NASA Space Place for more kid-friendly facts.  Planetary Photojournal: Mercury Johns Hopkins University MESSENGER Mission Site For Kids: About Mercury Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: May 15, 2023", "url": "https://solarsystem.nasa.gov/planets/mercury/overview", "threshold": 0.9999989272238523}