{"title": "Overview | Our Solar System – NASA Solar System Exploration", "content": "There are many planetary systems like ours in the universe, with planets orbiting a host star. Our planetary system is called “the solar system” because we use the word “solar” to describe things related to our star, after the Latin word for Sun, \"solis.\" Our planetary system is located in an outer spiral arm of the Milky Way galaxy. Our solar system consists of our star, the Sun, and everything bound to it by gravity – the planets Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, and Neptune; dwarf planets such as Pluto; dozens of moons; and millions of asteroids, comets, and meteoroids. Beyond our own solar system, we have discovered thousands of planetary systems orbiting other stars in the Milky Way. Everything you need to know about your galactic neighborhood. Solar System In Depth  Our solar system is made up of a star, eight planets, and countless smaller bodies such as dwarf planets, asteroids, and comets. Our solar system orbits the center of the Milky Way galaxy at about 515,000 mph (828,000 kph). We’re in one of the galaxy’s four spiral arms. It takes our solar system about 230 million years to complete one orbit around the galactic center.  There are three general kinds of galaxies: elliptical, spiral, and irregular. The Milky Way is a spiral galaxy. Our solar system is a region of space. It has no atmosphere. But it contains many worlds – including Earth – with many kinds of atmospheres. The planets of our solar system – and even some asteroids – hold more than 200 moons in their orbits. The four giant planets – and at least one asteroid – have rings. None are as spectacular as Saturn’s gorgeous rings. More than 300 robotic spacecraft have explored destinations beyond Earth's orbit, including 24 American astronauts who made the trip from the Earth to the Moon. Our solar system is the only one known to support life. So far, we only know of life on Earth, but we’re looking for more everywhere we can. NASA’s Voyager 1 and Voyager 2 are the only spacecraft to leave our solar system. Three other spacecraft – Pioneer 10, Pioneer 11, and New Horizons – will eventually hit interstellar space.  Five spacecraft have achieved enough velocity to eventually travel beyond the boundaries of our solar system. Two of them reached the unexplored space between the stars after several decades in space. Science Writers: Phil Davis & Steve CarneySocial Media Lead: Bill DunfordDesign & Development: Moore Boeck Site last updated: May 15, 2023", "url": "https://solarsystem.nasa.gov/solar-system/our-solar-system/", "threshold": 0.9992652371622348}