{"title": "Autonomous Worlds Aim to Free Online Games From Corporate Control | WIRED", "content": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. By Mike Orcutt The pitch sounds like an echo from the distant crypto past, when the blockchain was not only going to fight climate change but also cure cancer. Log on to Minecraft clone OPCraft and—through the magic of decentralized cryptography—experience true gaming freedom. The pixelated world closely resembles its role model both in aesthetics and gameplay. As in Minecraft, the environment that OPCraft players explore is made up of blocks, which players can move, destroy, and combine to produce new materials. OPCraft was built by crypto devotees who disdain the format of the most popular crypto games, which generally take conventional game designs and add a cryptocurrency element on top, often centered on making money exchanged as digital currency or NFTs.  The creators of OPCraft are trying to establish a new genre of games shaped more fundamentally by blockchains. Their rules and core mechanisms are encoded into smart contracts—software applications that encode an agreement—linked to the Ethereum blockchain. The game, which debuted in October for a two-week test period, is meant to demonstrate a vision its developers call an autonomous world—a digital space owned and controlled not by a single, centralized entity but by a decentralized network of people interacting with a blockchain. OPCraft is not the first on-chain game, and dozens more are in the works, setting out to build gaming worlds their creators describe as “sovereign” or “eternal.” At a time when the games industry is more lucrative and corporate than ever, these projects are trying to show that it’s possible to rethink some long-established patterns—like the fact that a game’s code typically lives on a privately owned server and can be changed or removed on a whim by its owners. The challenge now for these crypto idealists is to build games that demonstrate and prove out those ideals. If they can do that, they might change the conventional wisdom about what blockchains can do, too, by showing that they’re useful for more than just cryptocurrency and NFTs. In-game screenshot of OPCraft. Justin Glibert, cofounder of the blockchain research nonprofit 0xPARC, is quick to acknowledge that the idea of online games offering a new canvas for self-expression might not sound very new. But he argues that the freedom offered by conventional games is partly an illusion. Players of the 20-year-old space-themed game Eve Online, like devotees of other online multiplayer games, invest huge amounts of time and energy into their play, creating and running sophisticated organizations and maintaining genuine relationships. Players feel like they’re free to shape their own destiny inside the game. But Glibert says that freedom can in fact be yanked away at any moment by CCP Games, Eve’s owner. “They believe that CCP is not running the game world,” when in fact it retains total control, says Glibert, who runs a division of 0xPARC called Lattice that builds on-chain games. He says that games built on blockchains can be designed to prevent any one entity from controlling a world’s fate, while also offering new freedom for users to customize and expand on a game’s design. Khari Johnson Morgan Meaker Rose Eveleth WIRED Staff To Morris and Emerson Hsieh, the risk that a game’s creator or owner might wreck the world a community of players loves isn’t just theoretical. In late 2021, the brothers launched a popular custom Minecraft server called Critterz, in which many of the objects were also NFTs. But in July last year, Minecraft’s owner, Mojang, banned the use of crypto and NFTs, and Critterz came crashing down. Morris and Emerson became fixated on the question of how to build compelling games underpinned directly by the blockchain that were more independent and fun than traditional games could be. “If it’s not fun, nobody’s going to pay any attention to it,” Morris says. The pair are currently building a factory-themed game, called Primodium, to demonstrate what they call a decentralized economy, where rules encoded on the blockchain prevent a game’s creator from suddenly changing a key component—say, making a weapon less effective or valuable. Like Glibert’s concept of autonomous worlds, Morris says, the Hsiehs’ proposal boils down to “an agreement on the rules.” Once a game’s creator or founding community defines a set of low-level rules, players should be able to trust that they won’t change, similar to the way Bitcoin’s code fixes the supply at 21 million coins. During OPCraft’s test run, some players showed how building games on the blockchain can create new opportunities for creative play.  One core rule of the game held that if a player mined enough  diamonds, they could claim a tract of land for themselves, preventing anyone else from mining or building on it. One player, calling themself the Supreme Leader of OPCraft, used this rule to claim a huge swathe of land around where new players first arrive in the world when logging in for the first time. The aspiring dictator then announced on Twitter and in the OPCraft Discord channel that they had launched a new Ethereum smart contract that offered players the chance to opt into becoming a member of the Autonomous People’s Republic of OPCraft, a new game within the game. “All of your private property will be added to the government treasury,” the player wrote, “however from that point forward you will have access to the near limitless resources of our treasury.”  To join, users needed only to download and run a plug-in to OPCraft. Once they were in, the add-on software took over their possessions and also kept track of an individual’s contributions. Citizens could build things on Republic land, but only as long as they were contributing more resources to the treasury than they were taking.  The Autonomous People’s Republic was an extreme example of a quality that crypto enthusiasts call permissionlessness, describing a system that permits anyone to build software on top of it. Others built smaller-scale OPCraft plug-ins that let players do things like chat with each other or simply automate the action required to mine diamonds.  Khari Johnson Morgan Meaker Rose Eveleth WIRED Staff OPCraft was built to demonstrate blockchain-related features like that, and also to demonstrate a toolkit developed by 0xPARC’s Lattice for building on-chain games. Conventional videogames are often built using game engines such as Unreal Engine that speed up the work by handling lower-level details of the programming of 3D environments and other components. OPCraft was built using software Lattice developed called MUD, an “on-chain game engine.”  Glibert and a fellow Lattice engineer, who goes by the pseudonym Alvarius, built MUD after struggling to build their own on-chain game. The name borrows an acronym for multi-user dungeon, a genre of virtual multiplayer game worlds that originated in the 1970s and inspired online role-playing games like Eve Online. The crypto-era MUD is designed to take care of tricky challenges such as keeping every player’s software in sync with the blockchain and adding new content to a game. Last fall, Glibert’s team hosted a 12-week Autonomous Worlds Residency in London, where 45 participants, including Morris and Emerson Hsieh, built game prototypes using MUD. Most resembled conventional multiplayer games, in a similar vein to OPCraft, but one, named Eat Drain Arson, hinted at the opportunity for on-chain worlds to head off in new directions. The prototype displayed a hovering, skeleton-like goblin. In the demo, the game’s creators, Arthur Röing Baer and his cocreator, who goes by the pseudonym GVN, made the goblin do simple actions like eat, start fires, move around a simple map, and gather a finite resource called sludge. Work-in-progress in-game screenshot of Eat Drain Arson. The goblin’s world—and even the point of the game—are still under construction. But it will be designed to encourage players to form cooperative groups if they want to make progress. The game’s developers, who call themselves Moving Castles, took inspiration from the online communities that form on Discord servers and Telegram group chats. They hope the game can incubate collectives that exist beyond the game, such as an in-game organization that has the capability to move to another digital place or platform. “You start in a constrained world that facilitates the emergence of it, but it’s not constrained by it long-term,” says Baer. As well as trying to prove out new approaches to gaming, experiences built on MUD are also pushing the boundaries of blockchain technology. The creators of Ethereum originally promised a “world computer” that could run anything, including games, on the decentralized network powering the system. That would provide an alternative to conventional, centralized cloud computing and make services resistant to being shut down.  The downside is that running software on the blockchain this way is currently slow and expensive. OPCraft made use of a cryptographic system called a “rollup,” which combines many individual transactions and periodically links a bundle of them onto the blockchain. Lattice partnered with OP Labs, a startup developing rollup technology, for the OPCraft demonstration. The game, which had more than a hundred players active simultaneously, was a “stress test at the most realistic but also the most innovative level,” says Annie Ke, head of protocol partnerships at OP Labs. She hopes that blockchain games can demonstrate how rollup technology could make blockchains cheaper and easier to use, making ideas like mainstream decentralized financial services and even more general-purpose applications, like blockchain-based organizations, more feasible. 📧 Get the best stories from WIRED’s iconic archive in your inbox 🎧 Our new podcast wants you to Have a Nice Future Where to find the energy to save the world This fanfic sex trope caught a plundering AI red-handed “Cash stuffing” is thriving on TikTok The surprising synergy between acupuncture and AI Why suicide rates are dropping around the world ⛺ Embrace the new season with the Gear team’s best picks for best tents, umbrellas, and robot vacuums Reece Rogers Amanda Hoover Khari Johnson Will Knight Laurie Clarke David Nield Paresh Dave Will Knight More From WIRED Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices", "url": "https://www.wired.com/story/autonomous-worlds-aim-to-free-online-games-from-corporate-control/", "threshold": 0.9999461494700976}