{"title": "This Is Catfishing on an Industrial Scale\n| WIRED", "content": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. Laura Cole This wasn’t Supposed to happen. In 2020, in a house surrounded by fields in the Irish countryside, Liam, 19, sat at his laptop, an energy drink fizzing at his elbow. He leaned in for a better look at the profile photo and, sure enough, saw the face of an old rugby friend looking back at him. Just weeks earlier, Liam, whose name has been changed to protect his privacy, had been living in Waterford, in Southeast Ireland, about to start his second year at university. Then Covid-19 shut down the city and his university’s campus. On any Saturday on the main street, there were now more pigeons than people. Pubs and cafés shut their doors, and job opportunities dried up. “Money-wise it was worrying,” he says. Increasingly concerned, Liam responded to a Facebook ad for a “freelance customer support representative,” working remotely for vDesk, a company based in Cyprus. He was invited to an online interview. At the end of the call, the interviewer asked how he would feel about moderating dating websites. “I thought I might be moderating hateful content on Tinder, something like that,” he says, “they weren’t clear about the kind of work it would really be.” It wasn’t long before he found out. Rather than moderating content, Liam was asked to adopt fake online personas—known as “virtuals”—in order to chat to customers, most of them men looking for relationships or casual sex. Using detailed profiles of customers and well-crafted virtuals, Liam was expected to lure people into paying, message by message, for conversations with fictional characters. This is how, while pretending to be Anna2001, he found himself staring at an old acquaintance. But, he thought, hands slack on the keyboard, he needed the money. So for the next two minutes, he played the role he was paid to. Liam is one of hundreds of freelancers employed all over the world to animate fake profiles and chat with people who have signed up for dating and hookup sites. WIRED spoke to dozens of people working in the industry, people who had worked for months at a time at two of the companies involved in the creation of virtual profiles. vDesk didn’t respond to requests for comment. Often recruited into “customer support” or content moderation roles, they found themselves playing roles in sophisticated operations set up to tease subscription money from lonely hearts looking for connections online. In a kitchen in Mexico, more than 8,000 kilometers away from Liam’s house in Ireland, Alice faced a similar dilemma. She circled her cursor in frustration over a profile of someone she knew from her hometown in France. His chat history had all of his personal details: his name, city, job, past marriages. His kids’ names and ages. For nearly two years, he had been talking to a virtual. He says he’s in love with her. Alice—whose name has also been changed to protect her privacy—was next in line to inhabit that virtual. “I could tell him,” she thought, “and I really should.” Like Liam, Alice had responded to a job ad for vDesk during the pandemic. The position was for a “freelance remote translator.” Alice, stuck in Mexico with no way to make rent and no way back to France, went for it. “I even sent them a long cover letter, detailing my skills in translating,” she says dryly, “how embarrassing.” Khari Johnson Morgan Meaker Rose Eveleth WIRED Staff Once she got over the realization—on her first day working for the company—that translating really meant “flirting through fake profiles,” she couldn’t help but be impressed by how detailed the virtuals are. “The fakes don’t seem like obviously unattainable women, they are eerily convincing and hyper-specific,” she says. “Customer service” staff don’t play a single character on the sites. Instead, they sit in a chat queue to be cycled between virtuals who they occupy for two minutes at a time. They are given a biography of the virtual. One, seen by WIRED, looks like this: Andrea667 (45), lonely divorcee looking for a man Home: Chesham Bois - 3 bed House with her kids Job: Owner of a makeup & beauty products shop in Watford 10-6pm, Mon-Sat Food/Drinks: pub lunch, lamb jalfrezi, strong Brazilian coffee Child 1: Ben - 15 (2006) Child 2: Annie - 12 (2009) It continues in more granular detail, her parents’ names, her car (a Honda Civic automatic). On the right side of the moderator’s screen is a cache of photos that can be drip-fed into the conversation. Another former freelancer for vDesk, who was hired to create profiles in a country in Eastern Europe (to protect her privacy, WIRED is also not naming the country), says she was asked to divide her city into economic zones to make the profiles more believable. “It has to make sense,” she says, “if you had a banking executive living in, say, a students’ area it would seem suspicious.” She wasn’t sure where the photos used to illustrate the profiles were coming from. “I don’t want to think about it,” she says, describing the work as “like making Sims characters.” (A reverse-image search on some of the images seen by WIRED show that at least some are grabbed from pornography sites.) To ease her conscience, she told all the people she knew in that city—“even though you’re supposed to be discreet about the job.” Don’t use these websites, she told her friends, “I’ve created them, and they are all fake.” Moderators are encouraged to send 30 messages an hour. For two minutes, Alice says, that means you’re “a distinguished woman with multiple postgraduate degrees,” then for the next two minutes you’re “a teenage girl with crazy interests.” The freelancers have to be thorough. “You have to stay alert to weather and news in the fake’s location,” says Alice, “so you can pretend you are a person you are not.” Liam puts it more bluntly: “You have to be prepared to fuck with people’s feelings.” Employees are not told where the customers come from. External online portals promising anything from romantic dates to extreme fantasies funnel users into the same pool of “customer service” freelancers. “You feel bad because some of them are genuinely on there to find someone to date,” says one ex-freelancer from France. Others are brought in by “affiliate” freelancers who use the virtuals to directly email potential users. According to the guidelines Alice received, users who have been lured like this might start up the conversation on the site with “hi, I’m here like you asked.” Khari Johnson Morgan Meaker Rose Eveleth WIRED Staff Most of the users gain access to the dating sites by buying “coins.” The smallest costs €10 ($10.90), the largest €800. Overall, the user pays roughly €2 per message to a virtual. The sites collect detailed information about users, building profiles that help the freelancers maintain the fiction. These contain their living arrangements, details about their family and marital status (“single after two failed marriages,” one read), and other personal details. “It will add their kids’ names and ages, when they tell us them,” Alice says, “if they have been to therapy recently, what they have been feeling—anything which can be used by the virtual to keep a sense of real connection.” Failing to catch such details or to log near plans—“a trip, an exhibition, an appointment,” the freelancers’ guidelines say, can result in a reprimand from management. It is not clear what the company does with such data should the user terminate their profile. The guidelines given to Alice, which WIRED has examined, forbid copy-pasting and “sabotage”—meaning any acknowledgement that virtuals are fake, or mentioning the chat queue. Once a user is hooked in the conversation, the aim is always to stretch out the talking phase. “If a New York user asks to meet up with your virtual, the freelancer is to say ‘let me check my schedule and let you know,’” says Liam, even if you are writing from Budapest. If the user asks to move off to a free messaging app, the freelancers must write through the virtuals “I prefer to stay in here until I know you better” or “I feel safer on this app until we are better acquainted,” and so on. Alice says she saw chats where users said they had bought expensive gifts, “nevermind the weeks of money they had spent talking to the virtuals.” She spoke to elderly users in care homes, and others under protective conservatorships who asked virtuals to wait until they were given their next allowance. “I think a lot of the users are vulnerable enough to believe it is real,” she says. One morning, Alice opened her chat to a new message: “Please stop talking to my husband, he is spending money we do not have to talk to you,” read the chat line. “How would you respond to that?” asks Alice, “but there’s nothing you can do to stop it.” Freelance workers cannot shut down a conversation themselves, she says. Besides, even if it is a spouse, they are still paying per message—“and we only get paid if we respond in a way that provokes another one.” WIRED discussed vDesk’s business model with Volkan Topalli and Fangzhou Wang, who research romance fraud and criminology at Georgia State University’s evidence-based cyber security research group. “It’s possible this falls under romance scamming, what do you think?” Topalli says. “I’m not sure, but wow the system is efficient,” says Wang, “in any case, it’s like the owners are trying to cover their backs with the T&Cs.” The niche dating portals, which have names like Snap-Date, Horny-Spot, SexDater, Discreet-Meets, Only-Flirts.com, PassionsLove, and BeeMyPair, funnel users into the system and usually include lengthy terms and conditions. Most of them say something along the lines of “we may use system profiles at our discretion to communicate with users to enhance our users’ entertainment experience.” According to Topalli, the language is ambiguous enough that it might let people think “hey, maybe I’m talking to a pornstar,” or that maybe only a small number of them are fakes. Khari Johnson Morgan Meaker Rose Eveleth WIRED Staff Most of the sites are run by larger companies called Meet Us Media and Take Two Digital. Neither responded to requests for comment. At Georgia State University, Topalli and Wang research the toll of romance scams, the kind where individual perpetrators use popular free dating apps to scam large sums of money from victims that they groom, sometimes for years. For the “moderator” companies Alice and Liam worked for, “there’s deception here, that’s for sure,” says Wang. But unlike typical romance fraud, the transactions take place within the vague contractual agreements of the dating portals. Payments made by the users are limited to batch “coin” subscriptions within these sites, rather than through requests for grand payouts to cover fabricated crises, such as flight tickets or bailouts or fake medical emergencies. “Through this system, they ask a wider pool of people for a smaller amount of money,” says Wang, “though of course this could amount to large amounts for individuals over years of talking.” For Topalli, these companies are operating in a legal gray area. What they are doing may well be legal, he says, but “that doesn’t mean they are not completely unethical and immoral.” While sex chat and call lines have been around forever, there is generally a mutual understanding that these are fee-for-service arrangements. If users are instead wooed by ads offering a real dating application and then freelancers are paid to continue this charade, “it constitutes real deception,” he says, “and arguably exploitation on both sides of the internet—both the victims and the workers.” Freelancers working in the industry say they make a fraction of the money users are paying. Workers earn around 7 cents per message, or €2 an hour. For the company where Liam freelanced, the shifts were six hours a day, six days a week, “and they want you to be active on screen all that time—no breaks,” he says. The 36-hour weeks got him around €400 a month. “It was a pittance,” he says. In the murky, anonymous, globally dispersed industry, even some of the freelancers aren’t who they say they are—and are working for even less. In Lagos, 22-year-old physics student Idris—who asked for anonymity to protect his privacy, started working for Cloudworkers, a Swiss company, in June 2020 . The company doesn’t actually hire people in Nigeria, so he has to sublet an account from someone else. He gets 40 percent of the fee paid to the account’s owner. Cloudworkers didn’t respond to requests for comment. While illegal and not endorsed by the customer service companies, black market subletting is common in the industry. A scroll through Facebook groups dedicated to subcontracting (subcon) chat work finds hundreds of similar requests for people looking to rent accounts—“We make a deal 40/60, I can produce 200 to 400 quality messages daily”—and established moderators selling them—“looking for a moderator for my account with experience, good grammar and knows how to follow rules.” The companies are known to block accounts suddenly for suspected subcon work. The same Facebook groups are full of questions such as, “anyone else having trouble logging in?” met with comments of “uh-oh, you’ve been blocked.” Khari Johnson Morgan Meaker Rose Eveleth WIRED Staff Idris works on his phone six hours a night for about 400 Naira (87¢) an hour.” While he chats, he pretends to be the owner of the account, who is pretending to be a woman in the United States, who is pretending to be hundreds of virtual women. For Idris, it’s difficult to see how anyone from high-income countries could make a living operating freelance profiles. “The pay is so terrible,” says Idris from his bedroom in Lagos, “it only makes sense if you are doing it from a country like Nigeria or the Philippines, and only then if you are desperate.” Topalli says there’s an inevitability to the scaling up of this industry, where a combination of an increasingly atomized remote workforce, the rise of gig work, and the number of people turning to the internet for connection has turned a cottage industry of deception into a production line. “The internet has made this possible,” says Topalli. “Technology exponentiates a romance scam that used to happen face-to-face to unprecedented, global dimensions.” On Facebook and Twitter, the moderation companies continue to advertise new roles. Alice and Liam have both left the industry. After Liam saw his old friend in the chat, he messaged his team leader. “Could I take a moment off? To process it?” A wait. An ellipsis icon rolled. “It would be better if you went back to work.” Liam handed in his notice not long after. By then, he’d seen users talking to the virtuals about their heaviest emotional concerns: “one was talking about suicide and how the fake woman had saved him from it, now that he’d found love.” Liam had seen marriage proposals from users, some who had been on there as long as four and a half years. “And how can you blame them,” says Liam, “when the system is doing its best to get to know you as well as it can?” 📧 Get the best stories from WIRED’s iconic archive in your inbox 🎧 Our new podcast wants you to Have a Nice Future Where to find the energy to save the world This fanfic sex trope caught a plundering AI red-handed “Cash stuffing” is thriving on TikTok The surprising synergy between acupuncture and AI Why suicide rates are dropping around the world ⛺ Embrace the new season with the Gear team’s best picks for best tents, umbrellas, and robot vacuums Chris Stokel-Walker Khari Johnson Morgan Meaker Steven Levy Will Knight Tracy Wen Liu Matt Burgess Will Knight More From WIRED Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices", "url": "https://www.wired.com/story/catfishing-customer-support-love/", "threshold": -0.9999999979806551}